{
  "metadata": {
    "totalMaxScore": 40,
    "scoringSections": [
      "Key Projects & Initiatives",
      "Value Adds & Cost Avoidance",
      "Cost Savings Delivered",
      "Innovation & Continuous Improvement",
      "Issues, Challenges & Accountability",
      "2026 Forward Strategy & Vision",
      "Personal Goals & Role Maturity",
      "Executive Presence & Presentation Skills"
    ],
    "sectionShortNames": [
      "Projects",
      "Value Adds",
      "Cost Savings",
      "Innovation",
      "Accountability",
      "Strategy",
      "Goals",
      "Exec Presence"
    ],
    "lastUpdated": "2026-01-19T02:20:47.697874"
  },
  "accountDirectors": [
    {
      "accountDirector": "Benjamin Ehrenberg",
      "account": "Lockheed Martin",
      "vertical": "Manufacturing",
      "tier": "Tier 5",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 3.5,
        "Value Adds & Cost Avoidance": 3.0,
        "Cost Savings Delivered": 4.0,
        "Innovation & Continuous Improvement": 3.5,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 4.0,
        "Personal Goals & Role Maturity": 3.5,
        "Executive Presence & Presentation Skills": 4.5
      },
      "avgTotalScore": 30.0,
      "reviews": [
        {
          "accountDirector": "Benjamin Ehrenberg",
          "account": "Lockheed Martin",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "ageorge1@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Clearly articulated the 2025 initiatives; however, the measurable impact to the client was not fully clear. Strong overview, but additional quantification of outcomes would strengthen this area.",
            "Value Adds & Cost Avoidance": "Mentioned value-add activities, but lacked financial framing. To reach a higher score, value adds should be tied more clearly to cost avoidance or tangible impact. This is an opportunity to strengthen the approach in 2026.",
            "Cost Savings Delivered": "Demonstrated strong delivery of cost savings. Clear articulation of savings achieved and effectiveness of execution.",
            "Innovation & Continuous Improvement": "Showed clear improvement and adaptability, including a strong pivot from Q2 to Q4. Innovation efforts and progress toward improving how we innovate for the client were evident.",
            "Issues, Challenges & Accountability": "Completely transparent in addressing challenges. Clearly owned gaps and outlined corrective actions with supporting timelines. Strong accountability and leadership demonstrated.",
            "2026 Forward Strategy & Vision": "Clearly articulated a strong vision and roadmap for 2026. Strategy was well thought out and supported by clear planning, as evidenced in the presentation materials.",
            "Personal Goals & Role Maturity": "Demonstrated strong role maturity and clarity in personal goals. Showed readiness for continued growth and leadership development.",
            "Executive Presence & Presentation Skills": "It was the first one -> good"
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Benjamin Ehrenberg",
          "account": "Lockheed Martin",
          "reviewerName": "Shane Follman",
          "reviewerEmail": "ageorge1@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Missing quantification",
            "Value Adds & Cost Avoidance": "Value adds were broad but did not quantify the cost offset for the client.",
            "Cost Savings Delivered": "Delivered cost savings across all sites.",
            "Innovation & Continuous Improvement": "Would have liked to see roadmap for executing the proposed innovations. What was done in 2025 on the innovation side?",
            "Issues, Challenges & Accountability": "Reviewed challenges but would have wanted to see more specificity within the challenges. How can these issues be prevented in the future?",
            "2026 Forward Strategy & Vision": "Well established growth plan for 2026. 3 site bids upcoming. Specific path to securing these locations would have improved the overall delivery.",
            "Personal Goals & Role Maturity": "How are you measuring success? Answer to Val’s question was well delivered but would have benefitted from being incorporated in the presentation.",
            "Executive Presence & Presentation Skills": "First One -> It was good"
          },
          "totalScore": 33.0
        },
        {
          "accountDirector": "Benjamin Ehrenberg",
          "account": "Lockheed Martin",
          "reviewerName": "Ryan Blackwood",
          "reviewerEmail": "ageorge1@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Some time constraints necessitated speed through this sections but I felt like end impact of projects could have been highlighted in more detail.",
            "Value Adds & Cost Avoidance": "Explanation and review of Value Adds and Cost avoidances was great but no summary of dollars impact. This was addressed on the call but lack of values hurts this section. There was a very short turnaround time but even estimates would have helped to contextualize the impact of the different activities.",
            "Cost Savings Delivered": "Very clear explanation of cost savings by location with cost breakdown included.",
            "Innovation & Continuous Improvement": "Clear articulation of projects but was a little light on what the why of the project was. Would have been helpful to hear what problem the innovations were trying to solve.",
            "Issues, Challenges & Accountability": "Between the opening section in 4I and the slide deck I felt this was covered very well. Issues were tackled head on without avoidance or deflection and clear remedies were articulated. Very good job answering questions in this section.",
            "2026 Forward Strategy & Vision": "Path forward was well done. There were clear targets/objectives and a real plan on how to achieve them.",
            "Personal Goals & Role Maturity": "There were good goals in this section but all account focused not personal. I think some of this content could have been in the path forward and I would have liked to see at least one self-reflective goal.",
            "Executive Presence & Presentation Skills": "First one -> It was Good"
          },
          "totalScore": 35.0
        },
        {
          "accountDirector": "Benjamin Ehrenberg",
          "account": "Lockheed Martin",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 2.0,
            "Value Adds & Cost Avoidance": 2.0,
            "Cost Savings Delivered": 1.0,
            "Innovation & Continuous Improvement": 2.0,
            "Issues, Challenges & Accountability": 2.0,
            "2026 Forward Strategy & Vision": 2.0,
            "Personal Goals & Role Maturity": 2.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "The review did not clearly articulate the major initiatives delivered in 2025 in a way that tied scope, outcomes, and client impact together. While account ownership and context were evident, the discussion did not sufficiently highlight what was prioritized, why it mattered, or what tangibly changed for the client as a result. Going forward, this section should focus on 2–3 clearly defined initiatives delivered in 2025 and frame them around results and impact rather than general account context.",
            "Value Adds & Cost Avoidance": "Value creation beyond the core contract was not clearly demonstrated. The review lacked concrete examples of value-added services or cost avoidance efforts delivered in 2025, and there was limited translation of actions into operational, financial, or risk-based impact. To strengthen this area, future reviews should clearly call out specific decisions or actions that delivered incremental value and explain why those decisions mattered to the client.",
            "Cost Savings Delivered": "Cost savings delivered in 2025 were not clearly articulated. The review did not identify ownership of cost reduction initiatives, workflow improvements, or efficiency gains. At the Account Director level, it is important to explicitly call out savings achieved, how they were created, and whether they are repeatable or one-time in nature.",
            "Innovation & Continuous Improvement": "The review did not clearly demonstrate leadership in innovation or continuous improvement. While collaboration and alignment were referenced, there was limited evidence of new processes, tools, or enhancements implemented in 2025 or the results of those efforts. This section should highlight where you led change, tested new approaches, or improved how the account operates, along with the outcomes and learnings.",
            "Issues, Challenges & Accountability": "Challenges and gaps from 2025 were not meaningfully addressed. The review would be stronger with greater transparency around what did not go as planned, what could have been done differently, and what corrective actions were taken or are planned. Clear ownership and reflection are expected at this level.",
            "2026 Forward Strategy & Vision": "A clear, actionable 2026 account strategy was not fully articulated. While general intent was present, the review lacked a cohesive roadmap outlining priorities, sequencing, and how the account will be elevated through retention, growth, or differentiation. Future reviews should present a structured forward plan tied to specific initiatives and outcomes.",
            "Personal Goals & Role Maturity": "Personal development goals were not clearly defined or measurable. At the Account Director level, I expect clear leadership goals that demonstrate role maturity and accountability, along with an explanation of how those goals will positively impact account performance.",
            "Executive Presence & Presentation Skills": "Communication was professional and clear, and engagement with senior stakeholders was appropriate. However, the discussion would benefit from a more structured, outcome-driven narrative. Executive presence is strongest when the story is concise, results-focused, and clearly connects performance, challenges, and forward strategy."
          },
          "totalScore": 16.0
        }
      ]
    },
    {
      "accountDirector": "Brian Davis",
      "account": "Merck",
      "vertical": "Life Science",
      "tier": "Tier 6",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 3.0,
        "Value Adds & Cost Avoidance": 2.3333333333333335,
        "Cost Savings Delivered": 3.0,
        "Innovation & Continuous Improvement": 2.6666666666666665,
        "Issues, Challenges & Accountability": 3.3333333333333335,
        "2026 Forward Strategy & Vision": 3.0,
        "Personal Goals & Role Maturity": 2.6666666666666665,
        "Executive Presence & Presentation Skills": 2.3333333333333335
      },
      "avgTotalScore": 22.333333333333332,
      "reviews": [
        {
          "accountDirector": "Brian Davis",
          "account": "Merck",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 1.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 2.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 2.0,
            "Executive Presence & Presentation Skills": 2.0
          },
          "feedback": {
            "Key Projects & Initiatives": "3",
            "Value Adds & Cost Avoidance": "2",
            "Cost Savings Delivered": "4",
            "Innovation & Continuous Improvement": "3",
            "Issues, Challenges & Accountability": "3",
            "2026 Forward Strategy & Vision": "3",
            "Personal Goals & Role Maturity": "2",
            "Executive Presence & Presentation Skills": "2"
          },
          "totalScore": 19.0
        },
        {
          "accountDirector": "Brian Davis",
          "account": "Merck",
          "reviewerName": "Marvin Owens",
          "reviewerEmail": "Mowens@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 2.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Clarity lacking. Attempted to include too much data about relationships and did not focus on clearly articulating the specific projects and initiatives.",
            "Value Adds & Cost Avoidance": "Value adds and cost avoidances were not clearly identified. There is opportunity to bring into this discussion some of the financial tracking that we currently provide to Merck Direct to show this data.",
            "Cost Savings Delivered": "Good job here. Include specific details and the cost savings drivers.",
            "Innovation & Continuous Improvement": "OK job here.  Slight mention of Autonomous and could have expanded on outcomes and results. Failed to mention all autonomous being used (i.e. window cleaning) Good but long story on pest control. More high-level descriptions needed.",
            "Issues, Challenges & Accountability": "MYO explanation good. Clearly articulated Merck reasoning. Failed to speak to what percentages and initiatives that we proposed based on the Merck ask and requirements for MYO.",
            "2026 Forward Strategy & Vision": "Lacking details with closure plan.",
            "Personal Goals & Role Maturity": "Personal goal to develop management team but needs to include more detail. Need to articulate better.",
            "Executive Presence & Presentation Skills": "Very hard to follow. Floated around and did not stick to topic which really impacted his messaging."
          },
          "totalScore": 24.0
        },
        {
          "accountDirector": "Brian Davis",
          "account": "Merck (CBRE + Direct)",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 2.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Given Brian’s mid-year start, the review demonstrated a reasonable grasp of the portfolio and an understanding of the major initiatives in motion. Oversight across multiple relationships was clear, and there was evidence of active engagement and learning. That said, the articulation of initiatives leaned more toward inherited context and shared ownership than clearly defined initiatives Brian personally drove in 2025. As Brian moves into a full-year role, I would expect clearer framing around what he owns end-to-end, why those initiatives matter, and what changed for the client as a result.",
            "Value Adds & Cost Avoidance": "Brian showed awareness of where value is created across the portfolio and how different teams contribute. However, value-adds and cost avoidance efforts were not yet clearly framed as deliberate actions owned by Brian with defined impact. This is understandable given tenure, but going forward, I would expect more explicit examples of decisions or interventions that delivered incremental value beyond the contract, even if directional in nature.",
            "Cost Savings Delivered": "Cost savings delivered in 2025 were not clearly articulated. Given the timing of Brian’s start, this is not unexpected, but this section lacked clarity around ownership of savings, execution, or sustainability. As Brian enters a full operating year, it will be important to explicitly call out cost savings achieved, how they were driven, and whether they are repeatable improvements tied to financial stewardship.",
            "Innovation & Continuous Improvement": "Brian demonstrated openness to learning the portfolio and engaging with existing processes and teams. However, leadership in driving new processes, tools, or meaningful improvements was not yet clearly established. This is appropriate for a ramp period. In 2026, I would expect Brian to move from participation to leadership by identifying opportunities to improve how the portfolio operates and testing changes with measurable outcomes.",
            "Issues, Challenges & Accountability": "Brian was transparent about his tenure, the inherited nature of many challenges, and the shared accountability across the team. There was a healthy tone of ownership without defensiveness, which is important at this level. To continue building strength here, future reviews should include clearer reflection on what Brian would approach differently and specific corrective actions he intends to drive, with timelines.",
            "2026 Forward Strategy & Vision": "A general forward-looking intent was present, but the 2026 strategy was not yet articulated as a clear, cohesive roadmap. This is reasonable given time in role. As Brian moves into a full planning cycle, I would expect a more structured strategy outlining priorities, sequencing, and how the portfolio will be elevated through retention, growth, and differentiation",
            "Personal Goals & Role Maturity": "Brian demonstrated self-awareness around his ramp and role scope, which is a positive signal. Personal development goals, however, were not yet clearly defined or measurable. As he matures in the role, I would expect clearer leadership goals tied directly to portfolio performance, team development, and operational outcomes.",
            "Executive Presence & Presentation Skills": "Brian communicated professionally and engaged appropriately with senior leaders. Executive presence is developing, and confidence will naturally increase with tenure. Going forward, tightening the narrative around outcomes, ownership, and forward strategy will strengthen Brian’s ability to lead executive-level account discussions more decisively.\n\nBrian is in a reasonable ramp phase and is demonstrating the right fundamentals: openness, accountability, and engagement across a complex portfolio. The primary opportunity moving into 2026 is shifting from shared context to clear ownership, tightening outcome-based storytelling, and more explicitly articulating impact. With a full year in role, expectations will appropriately rise, and Brian is positioned to meet them with stronger clarity and execution discipline."
          },
          "totalScore": 24.0
        }
      ]
    },
    {
      "accountDirector": "Justin Homa",
      "account": "CBRE Merck",
      "vertical": "Life Science",
      "tier": "Tier 5",
      "reviewCount": 2,
      "avgScores": {
        "Key Projects & Initiatives": 3.5,
        "Value Adds & Cost Avoidance": 3.5,
        "Cost Savings Delivered": 3.0,
        "Innovation & Continuous Improvement": 3.5,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 3.5,
        "Personal Goals & Role Maturity": 3.5,
        "Executive Presence & Presentation Skills": 3.5
      },
      "avgTotalScore": 28.0,
      "reviews": [
        {
          "accountDirector": "Justin Homa",
          "account": "CBRE Merck",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "5",
            "Value Adds & Cost Avoidance": "5",
            "Cost Savings Delivered": "5",
            "Innovation & Continuous Improvement": "4",
            "Issues, Challenges & Accountability": "4",
            "2026 Forward Strategy & Vision": "4",
            "Personal Goals & Role Maturity": "3",
            "Executive Presence & Presentation Skills": "4"
          },
          "totalScore": 32.0
        },
        {
          "accountDirector": "Justin Homa",
          "account": "Merck (CBRE + Direct)",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 2.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Given Brian’s mid-year start, the review demonstrated a reasonable grasp of the portfolio and an understanding of the major initiatives in motion. Oversight across multiple relationships was clear, and there was evidence of active engagement and learning. That said, the articulation of initiatives leaned more toward inherited context and shared ownership than clearly defined initiatives Brian personally drove in 2025. As Brian moves into a full-year role, I would expect clearer framing around what he owns end-to-end, why those initiatives matter, and what changed for the client as a result.",
            "Value Adds & Cost Avoidance": "Brian showed awareness of where value is created across the portfolio and how different teams contribute. However, value-adds and cost avoidance efforts were not yet clearly framed as deliberate actions owned by Brian with defined impact. This is understandable given tenure, but going forward, I would expect more explicit examples of decisions or interventions that delivered incremental value beyond the contract, even if directional in nature.",
            "Cost Savings Delivered": "Cost savings delivered in 2025 were not clearly articulated. Given the timing of Brian’s start, this is not unexpected, but this section lacked clarity around ownership of savings, execution, or sustainability. As Brian enters a full operating year, it will be important to explicitly call out cost savings achieved, how they were driven, and whether they are repeatable improvements tied to financial stewardship.",
            "Innovation & Continuous Improvement": "Brian demonstrated openness to learning the portfolio and engaging with existing processes and teams. However, leadership in driving new processes, tools, or meaningful improvements was not yet clearly established. This is appropriate for a ramp period. In 2026, I would expect Brian to move from participation to leadership by identifying opportunities to improve how the portfolio operates and testing changes with measurable outcomes.",
            "Issues, Challenges & Accountability": "Brian was transparent about his tenure, the inherited nature of many challenges, and the shared accountability across the team. There was a healthy tone of ownership without defensiveness, which is important at this level. To continue building strength here, future reviews should include clearer reflection on what Brian would approach differently and specific corrective actions he intends to drive, with timelines.",
            "2026 Forward Strategy & Vision": "A general forward-looking intent was present, but the 2026 strategy was not yet articulated as a clear, cohesive roadmap. This is reasonable given time in role. As Brian moves into a full planning cycle, I would expect a more structured strategy outlining priorities, sequencing, and how the portfolio will be elevated through retention, growth, and differentiation",
            "Personal Goals & Role Maturity": "Brian demonstrated self-awareness around his ramp and role scope, which is a positive signal. Personal development goals, however, were not yet clearly defined or measurable. As he matures in the role, I would expect clearer leadership goals tied directly to portfolio performance, team development, and operational outcomes.",
            "Executive Presence & Presentation Skills": "Brian communicated professionally and engaged appropriately with senior leaders. Executive presence is developing, and confidence will naturally increase with tenure. Going forward, tightening the narrative around outcomes, ownership, and forward strategy will strengthen Brian’s ability to lead executive-level account discussions more decisively.\n\nBrian is in a reasonable ramp phase and is demonstrating the right fundamentals: openness, accountability, and engagement across a complex portfolio. The primary opportunity moving into 2026 is shifting from shared context to clear ownership, tightening outcome-based storytelling, and more explicitly articulating impact. With a full year in role, expectations will appropriately rise, and Brian is positioned to meet them with stronger clarity and execution discipline."
          },
          "totalScore": 24.0
        }
      ]
    },
    {
      "accountDirector": "Mark Schlerf",
      "account": "HP LAM Xerox and others",
      "vertical": "Technology",
      "tier": "Tier 5",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 4.5,
        "Value Adds & Cost Avoidance": 4.5,
        "Cost Savings Delivered": 4.0,
        "Innovation & Continuous Improvement": 4.75,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 3.75,
        "Personal Goals & Role Maturity": 4.5,
        "Executive Presence & Presentation Skills": 4.0
      },
      "avgTotalScore": 34.0,
      "reviews": [
        {
          "accountDirector": "Mark Schlerf",
          "account": "HP LAM Xerox and others",
          "reviewerName": "Shane Follmann",
          "reviewerEmail": "sfollmann@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Clearly outlined and articulate his 2025 timeline of what he provided to his accounts. Savings, innovations, etc. carried through all initiatives more than just one. Thought outside the box, utilize outside resources verse depending on corporate to push. Positive outcomes including renewals and growth!",
            "Value Adds & Cost Avoidance": "Provided his clients numerous value adds and cost avoidance. Brining the latest and greatest in his space. Has his clients numerous value bets interest at heart.",
            "Cost Savings Delivered": "Delivered cost savings which resulted in off market renewals.",
            "Innovation & Continuous Improvement": "Demonstrated very well how Mark can continue to innovate, bringing ideas to the clients attention. He pushed the envelope to counties to test products, learned for each of them.",
            "Issues, Challenges & Accountability": "Challenges while navigating JLL Serv, competing interest.",
            "2026 Forward Strategy & Vision": "No feedback provided",
            "Personal Goals & Role Maturity": "No feedback provided",
            "Executive Presence & Presentation Skills": "No feedback provided"
          },
          "totalScore": 39.0
        },
        {
          "accountDirector": "Mark Schlerf",
          "account": "HP/LAM/Xerox",
          "reviewerName": "Ryan Blackwood",
          "reviewerEmail": "rblackwood@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Clearly framed the initiatives that were most impactful for LAM. Very clear you were able to create value, adding both revenue resources and benefits to the client. Outstanding!",
            "Value Adds & Cost Avoidance": "Your tracking of the true value is rare to see. Often time people struggle to articulate the benefit to the customer.",
            "Cost Savings Delivered": "Great job tracking and measuring this.",
            "Innovation & Continuous Improvement": "You are able to tell your story well, both with equipment and processes.",
            "Issues, Challenges & Accountability": "There was an opportunity to call out the actions needed to get closure of the challenges you have. I would focus on what you need from others and not just being accountable for the site level challenges but where leaders or others can support.",
            "2026 Forward Strategy & Vision": "I would have liked to have seen your actual plan around LAM transition and increase. How will you use the dollars whats the schedule and roll out for that increase.",
            "Personal Goals & Role Maturity": "I would have liked to have understood your goals you have for yourself that aligns to the AD role. Love the smartsheet tracker and taking things in smaller bite size pieces making it documented.",
            "Executive Presence & Presentation Skills": "The material was well organized, the communication was well thought out. While the flow worked well for you I would have liked a tone that supported your drive to expand, or get everything you need to be the clients only choice."
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Mark Schlerf",
          "account": "HP/LAM/Xerox",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "No feedback provided",
            "Value Adds & Cost Avoidance": "No feedback provided",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "No feedback provided",
            "Issues, Challenges & Accountability": "No feedback provided",
            "2026 Forward Strategy & Vision": "No feedback provided",
            "Personal Goals & Role Maturity": "No feedback provided",
            "Executive Presence & Presentation Skills": "No feedback provided"
          },
          "totalScore": 28.0
        },
        {
          "accountDirector": "Mark Schlerf",
          "account": "HP/LAM/Xerox",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Mark clearly articulated meaningful initiatives delivered in 2025, particularly around account stability, scalability, and innovation. He demonstrated strong judgment in identifying what is working, where a repeatable playbook exists, and how success on his accounts can be leveraged more broadly. While the initiatives were clearly described, client impact was often implied rather than explicitly stated. This section would be further strengthened by more direct articulation of what changed for the client as a result of these initiatives and, where possible, anchoring outcomes with measurable results.",
            "Value Adds & Cost Avoidance": "Mark provided strong examples of value creation beyond core contract scope, especially through innovation, sustainability-focused thinking, and differentiated use of existing tools such as 4insite. His commentary reflected intentional decision-making and a clear understanding of how value can be created without deviating from core SVM systems. To elevate to the highest level, Mark could further translate these value-add efforts into clearer financial, operational, or risk-based impact to reinforce the tangible benefit delivered to the client.",
            "Cost Savings Delivered": "Mark referenced efficiency improvements and operational refinements that suggest cost discipline and improved service delivery. However, cost savings were not clearly quantified or distinguished as repeatable versus one-time improvements. This section would benefit from clearer ownership of execution and more explicit articulation of how savings were created, sustained, and leveraged over time. Even directional estimates or examples would strengthen the demonstration of financial stewardship.",
            "Innovation & Continuous Improvement": "Mark demonstrated exceptional leadership in innovation and continuous improvement. His approach to leveraging existing platforms differently, building scalable playbooks, and challenging traditional execution models showed intentional experimentation, learning, and iteration. The level of interest generated from senior leadership and peers reinforces the impact and credibility of this work. Mark clearly operates with an enterprise mindset and has created innovation that is transferable beyond his immediate accounts.",
            "Issues, Challenges & Accountability": "Mark was transparent and self-aware in discussing the challenges of scale, particularly the need to transition from being deeply involved in innovation execution to leading through direction, playbooks, and governance. He demonstrated ownership of this gap and articulated a thoughtful reflection on what needs to change to support continued growth. To reach a 5, this section could include more explicit corrective actions with timelines tied to how Mark plans to operationalize this shift in 2026.",
            "2026 Forward Strategy & Vision": "Mark articulated a strong forward-looking strategy centered on scalability, sustainability, and elevating successful account practices into repeatable models. The vision was cohesive and clearly connected to improving execution at scale. This section would be further strengthened by more explicit sequencing, timelines, and linkage to retention, growth, and differentiation outcomes for 2026.",
            "Personal Goals & Role Maturity": "Mark clearly articulated mature, leadership-level development goals focused on scaling impact, moving out of the weeds, and leading through playbooks rather than individual execution. These goals demonstrate strong role maturity, self-awareness, and readiness for increased scope. The alignment between personal development and organizational needs was particularly strong.",
            "Executive Presence & Presentation Skills": "Mark communicated with confidence and credibility, demonstrating strong command of his material and an ability to engage executive audiences. His presentation sparked interest, follow-up requests, and broader organizational dialogue, which reflects effective executive presence. To elevate further, tightening structure and explicitly anchoring innovation discussions to outcomes and metrics would enhance clarity and executive-level impact."
          },
          "totalScore": 33.0
        }
      ]
    },
    {
      "accountDirector": "Grant Frazier",
      "account": "Meta",
      "vertical": "Technology",
      "tier": "Tier 6",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 4.25,
        "Value Adds & Cost Avoidance": 3.75,
        "Cost Savings Delivered": 4.25,
        "Innovation & Continuous Improvement": 4.25,
        "Issues, Challenges & Accountability": 4.5,
        "2026 Forward Strategy & Vision": 4.75,
        "Personal Goals & Role Maturity": 4.75,
        "Executive Presence & Presentation Skills": 4.5
      },
      "avgTotalScore": 35.0,
      "reviews": [
        {
          "accountDirector": "Grant Frazier",
          "account": "Meta",
          "reviewerName": "nan",
          "reviewerEmail": "anonymous",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Love the way you thought of how to be exclusive as a provider! Great details on the projects and I was impressed that you captured the clients feedback and impressions.",
            "Value Adds & Cost Avoidance": "Clearly explained savings, value delivery and management of the team through challenging them. I appreciate the thinking behind this example thebgreen cleaning. Future state quantify the value add in 2026.",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "Love that you thought outside of the box on innovation. While you were able to come with some thing I’d like you to dive deeper into innovation.",
            "Issues, Challenges & Accountability": "Your challenges and opportunities slide is the best I have seen so far. Your clear explanation of how you overcame your challenges reassures me we have the right leadership in you!",
            "2026 Forward Strategy & Vision": "Timelines are critical to me. Make sure you hold yourself and team accountable to the commitments communicated here. Will be interesting to see your half year review.",
            "Personal Goals & Role Maturity": "I am 100% aligned with your goals and thought process around what’s important.",
            "Executive Presence & Presentation Skills": "You lead discussion, drive transformation while being transparent and effective. Really appreciate the the thought put into these discussion."
          },
          "totalScore": 38.0
        },
        {
          "accountDirector": "Grant Frazier",
          "account": "Meta",
          "reviewerName": "nan",
          "reviewerEmail": "anonymous",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Great job of highlighting impact to the customer and strategic impact of all key projects. I was easily able to follow the details of the projects",
            "Value Adds & Cost Avoidance": "The explanation of what and how was very strong. There was quantified dollars to Cost Avoidance but not for the Value adds. Even if the exact dollar amount isn't known of tracked it would have been good to at least get a ball park amount to evaluate vs the other two categories.,",
            "Cost Savings Delivered": "Clearly articulated project value and numbers associated with the cost savings.",
            "Innovation & Continuous Improvement": "Robotics is a good innovation and seems like an inevitability and is just a matter of time. I would consider succession planning to be an account goal and not and innovation. It is 100% a best practice!",
            "Issues, Challenges & Accountability": "This section was very well done very clear ownership and what was being done to correct issues without making excuses.",
            "2026 Forward Strategy & Vision": "The items laid out were very clear and well explained. The conversation around margin retention was good",
            "Personal Goals & Role Maturity": "All of the goals were well articulated and clear. I do think the goals were all account focused and it would have been beneficial to hear what you Grant want to be better at or develop for yourself.",
            "Executive Presence & Presentation Skills": "The structure and content was well developed and explanations and impact clearly articulated. You are clearly knowledgeable and speak very confidently about each topic. Overall the flow felt a little rushed and I think some of the topics points would have benefitted from some time to breath in each section to provide space for impact to really sink in. It also would have presented as being more in control of the presentation."
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Grant Frazier",
          "account": "Meta",
          "reviewerName": "Luna Duarte",
          "reviewerEmail": "lduarte@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Clear narrative with a good focus.",
            "Value Adds & Cost Avoidance": "No feedback provided",
            "Cost Savings Delivered": "Grant took over the Meta account July 2025 after cost savings discussions were finalized with CBRE. Looking forward to him taking over financials fully in 2026.",
            "Innovation & Continuous Improvement": "Partnering with our Ops team to think outside the box",
            "Issues, Challenges & Accountability": "No feedback provided",
            "2026 Forward Strategy & Vision": "Strong plan with stretch goals. Looking forward to the 2026 roadmap updates.",
            "Personal Goals & Role Maturity": "Clear, measurable, and forward thinking. All in line with a Sr. AD over an almost $4M/mo. account",
            "Executive Presence & Presentation Skills": "Led the discussion with confidence and presented well to executive leadership."
          },
          "totalScore": 35.0
        },
        {
          "accountDirector": "Grant Frazier",
          "account": "Meta",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Grant demonstrated strong ownership of the account and articulated several well-considered focus areas, including revenue growth, operational stability, leadership development, and cross-campus collaboration. The strategic thinking and prioritization were clear. However, the discussion focused more on execution approach and future intent than on clearly framed 2025 initiatives delivered and their direct impact on the client. To strengthen this section, Grant should more explicitly separate what was delivered in 2025 from forward-looking plans and clearly articulate what changed for the client as a result, supported by measurable outcomes where possible.",
            "Value Adds & Cost Avoidance": "Grant showed thoughtful intent around creating value beyond the contract, particularly through efficiency gains and more deliberate use of ATB versus goodwill work. The underlying judgment and approach are strong. To improve, Grant should highlight concrete examples of value delivered in 2025 and translate those efforts into financial, operational, or risk-based impact, even at a directional level. Doing so would better demonstrate the tangible value created for the client.",
            "Cost Savings Delivered": "Grant acknowledged the importance of efficiency and margin improvement and discussed opportunities to drive savings through workflow optimization and smarter execution. However, the review did not clearly articulate cost savings delivered in 2025, nor did it quantify or distinguish between one-time versus repeatable savings. This section would be strengthened by explicitly calling out savings achieved, describing how they were executed, and clarifying ownership and sustainability to demonstrate stronger financial stewardship.",
            "Innovation & Continuous Improvement": "Grant demonstrated strong leadership in innovation and continuous improvement, particularly through forward-thinking exploration of AI-enabled decision support and data-driven contract and ATB optimization. The willingness to test, learn, and potentially scale new tools reflects a proactive and enterprise-minded approach. To reach the highest level, this section would benefit from clearer linkage to pilots, experiments, or early outcomes in 2025, along with lessons learned that inform next steps.",
            "Issues, Challenges & Accountability": "Grant showed transparency in acknowledging the importance of maintaining operational stability while pursuing growth and recognized the inherent challenges that come with scaling. There was a clear sense of ownership and awareness of risk. To further strengthen this section, Grant could deepen reflection by explicitly calling out specific challenges faced in 2025, what could have been done differently, and outlining corrective actions or guardrails with clearer timelines.",
            "2026 Forward Strategy & Vision": "Grant articulated a clear, compelling, and well-prioritized 2026 forward strategy focused on revenue growth, leadership development, cross-campus collaboration, and enterprise capability expansion. The strategy was proactive, cohesive, and strongly connected to retention, growth, and differentiation. The vision demonstrated strong judgment, sequencing, and scalability, with clear intent to elevate both the account and broader organizational capabilities.",
            "Personal Goals & Role Maturity": "Grant clearly defined thoughtful, leadership-level professional goals that align strongly with Account Director expectations and demonstrate role maturity. The goals were forward-looking, measurable in intent, and focused on developing leaders, improving margins, and driving enterprise-level impact. Grant demonstrated a strong growth mindset and readiness to operate at increased scope and influence.",
            "Executive Presence & Presentation Skills": "Grant communicated confidently and demonstrated strong command of the material, clearly articulating priorities and responding effectively to executive feedback. The discussion had logical flow and depth, and executive presence was evident throughout. To elevate further, Grant could tighten pacing and sharpen storytelling around outcomes and impact to ensure maximum clarity and resonance with senior executive audiences."
          },
          "totalScore": 31.0
        }
      ]
    },
    {
      "accountDirector": "Stuart Kelloff",
      "account": "Nvidia",
      "vertical": "Technology",
      "tier": "Tier 6",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 5.0,
        "Value Adds & Cost Avoidance": 4.75,
        "Cost Savings Delivered": 4.75,
        "Innovation & Continuous Improvement": 4.0,
        "Issues, Challenges & Accountability": 4.25,
        "2026 Forward Strategy & Vision": 4.75,
        "Personal Goals & Role Maturity": 4.75,
        "Executive Presence & Presentation Skills": 4.75
      },
      "avgTotalScore": 37.0,
      "reviews": [
        {
          "accountDirector": "Stuart Kelloff",
          "account": "Nvidia",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Renewal, scope and growth all well thought out. Great recap on the pricing and renewal strategy.",
            "Value Adds & Cost Avoidance": "Clearly described the value adds which supports the partnership and an equitable relationship!",
            "Cost Savings Delivered": "Nvidia is a people first customer, transparently sharing with them where they sit as a top provider is important … you’re doing that well.",
            "Innovation & Continuous Improvement": "While you clearly have the ability to manage your customer I would like to understand the ROI on your innovations. You did well on outcomes, but would like more on lessons learned or results.",
            "Issues, Challenges & Accountability": "Your transparency is refreshing and how you’ve overcome your challenges is appreciated. I like that the challenges pushed you to work cross functionally.",
            "2026 Forward Strategy & Vision": "No feedback provided",
            "Personal Goals & Role Maturity": "I am 100% aligned with your goals",
            "Executive Presence & Presentation Skills": "You are a great communicator clear and logical in flow, with strong, confident, presentation skills. It’s always a pleasure to hear you present because of your knowledge of your accounts and passion."
          },
          "totalScore": 39.0
        },
        {
          "accountDirector": "Stuart Kelloff",
          "account": "Nvidia",
          "reviewerName": "Shane Follmann",
          "reviewerEmail": "sfollmann@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "I think impact explanations started out light but got better during this section. I felt the projects bled together slightly and could have used a little stronger differentiation during the explanation. While the detail was great on each category this slide ended up taking a lot of the presentation and could probably have been slimed down.",
            "Value Adds & Cost Avoidance": "This ties back to the key projects and how you have continued to reinvest in the team and the account. I appreciated that everything had a cost even if it was estimated as it helped contextualized the size and impact of each item.",
            "Cost Savings Delivered": "Strong job summing up the total impact to all the monetary amount and tying that in to how we are planning out the next contract renewal.",
            "Innovation & Continuous Improvement": "No feedback provided",
            "Issues, Challenges & Accountability": "I was very interested in the utilization of a third-party auditor. That's something that is very unique and shows a real drive to continue to improve. The impact of Sustainability cannot be overstated and if you can catch MSFT it would be a giant achievement.",
            "2026 Forward Strategy & Vision": "Clear vision on continuing the path forward with Nvidia.",
            "Personal Goals & Role Maturity": "This section ended up being a little constricted due to time. I did appreciate the focus on what you were working on but would have liked to see more on what you specifically are going to develop from a skills and growth standpoint.",
            "Executive Presence & Presentation Skills": "You very clearly own the account and speak from a place of practical knowledge. There was some excellent conversation on some of the topics which was great to see. The timing was slightly off after the first slide and cascaded to the rest of the slides. It would have been great to try and catch up at some point to help with the flow."
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Stuart Kelloff",
          "account": "Nvidia",
          "reviewerName": "Luna Duarte",
          "reviewerEmail": "lduarte@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Customer focused initiatives. True customer partnership recognized.",
            "Value Adds & Cost Avoidance": "No feedback provided",
            "Cost Savings Delivered": "Fully understands and owns Nvidia financials.",
            "Innovation & Continuous Improvement": "No feedback provided",
            "Issues, Challenges & Accountability": "No feedback provided",
            "2026 Forward Strategy & Vision": "Looking forward to implementation of the strong plan.",
            "Personal Goals & Role Maturity": "Clear, measurable, and leader focused goals. Looking forward to seeing these develop in 2026",
            "Executive Presence & Presentation Skills": "Clear, confident, and led the discussion. Great positive attitude and effectively answered all executive questions."
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Stuart Kelloff",
          "account": "Nvidia",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Stuart clearly articulated the most important initiatives delivered in 2025 and why they mattered. His work around renewal strategy, reinvestment planning, wage structure alignment, and proactive pricing architecture demonstrated strong judgment and long-term thinking. These initiatives were intentionally executed well ahead of renewal timelines and materially reduced risk while strengthening the partnership. The linkage between initiative, outcome, and client impact was clear, particularly in how these actions positioned SBM as a trusted, forward-thinking partner rather than a reactive vendor.",
            "Value Adds & Cost Avoidance": "Stuart demonstrated exceptional value creation beyond the contract. Rather than defaulting to cost reduction, he aligned reinvestment strategies with NVIDIA’s growth objectives and CBRE’s expectations, reinforcing trust and long-term retention. The ability to ask the right questions, confirm client intent, and then deliberately reinvest margin back into the account reflects strong commercial judgment and credibility. This is a textbook example of value creation rooted in partnership, not short-term optimization.",
            "Cost Savings Delivered": "While cost savings were not the primary driver for this account, Stuart clearly demonstrated financial stewardship through disciplined margin management, proactive wage forecasting, and mitigation of renewal and RFP risk. The account’s strong financial performance at scale is not accidental and reflects sustained execution. This section could be elevated further by explicitly framing how financial performance was protected over time and which practices are repeatable across other large enterprise accounts.",
            "Innovation & Continuous Improvement": "Stuart showed strong leadership in continuously improving how the account is structured and managed, particularly through consolidated pricing models, early implementation of renewal strategies, and thoughtful reinvestment decisions. These improvements were practical, intentional, and outcome-oriented. To reach a 5, the next step would be documenting and formalizing these approaches into a repeatable playbook that can be leveraged across similar strategic accounts.",
            "Issues, Challenges & Accountability": "Stuart demonstrated maturity in how challenges were addressed, particularly around renewal risk, financial performance scrutiny, and reinvestment decisions. He showed ownership without defensiveness and made deliberate, data-backed choices aligned to client priorities. This section would be further strengthened by explicitly calling out any moments of trade-off or course correction and what was learned as a result.",
            "2026 Forward Strategy & Vision": "Stuart articulated a clear, cohesive forward strategy tied to retention, reinvestment, and scalable growth. The 2026 vision was not abstract; it was grounded in actions already taken and partnerships already built. The sequencing, foresight, and alignment across NVIDIA and CBRE position this account for continued success and differentiation.",
            "Personal Goals & Role Maturity": "Stuart demonstrated strong role maturity and leadership readiness. His approach reflects an enterprise mindset, balancing financial performance, client trust, and long-term partnership value. The way he thinks about timing, reinvestment, and risk mitigation is consistent with expectations for senior Account Director leadership on marquee accounts.",
            "Executive Presence & Presentation Skills": "Stuart led the discussion with confidence, clarity, and command of the account. He presented a structured, compelling narrative and responded effectively to executive feedback and questions. His ability to communicate complex financial and strategic decisions in a clear, credible way reflects strong executive presence.\n\nStuart is operating at a very high level and sets a strong benchmark for strategic account leadership. The NVIDIA account is a top performer not just financially, but relationally, and that outcome reflects deliberate choices, strong judgment, and disciplined execution. The opportunity ahead is scaling this approach, codifying it, and using it as a reference model for other large enterprise accounts across the portfolio."
          },
          "totalScore": 37.0
        }
      ]
    },
    {
      "accountDirector": "Jacqueline Maravilla",
      "account": "Lonza",
      "vertical": "Life Science",
      "tier": "",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 4.0,
        "Value Adds & Cost Avoidance": 5.0,
        "Cost Savings Delivered": 5.0,
        "Innovation & Continuous Improvement": 4.333333333333333,
        "Issues, Challenges & Accountability": 5.0,
        "2026 Forward Strategy & Vision": 4.0,
        "Personal Goals & Role Maturity": 4.333333333333333,
        "Executive Presence & Presentation Skills": 4.333333333333333
      },
      "avgTotalScore": 36.0,
      "reviews": [
        {
          "accountDirector": "Jacqueline Maravilla",
          "account": "Lonza",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Great job I would like to understand a little more about what changed for the customer as a result of projects or work we did. A little more on if it’s sustaining or one offs?",
            "Value Adds & Cost Avoidance": "Great work on value adds. Love how transparent you are with your customer. I was impressed by you having the calculations of your value adds!!!",
            "Cost Savings Delivered": "You went over cost savings super quickly for those who might not know or understand your exact glide path. I happen to understand your goals and what it took to complete this.",
            "Innovation & Continuous Improvement": "How can we be valuable is a question we should all ask. I like how you framed this and it’s a best practice we should implement as account leadership. Not what is our value but how can we be valuable!",
            "Issues, Challenges & Accountability": "Thank you for your transparency. It is clear that even through challenges your JLL team supports you which is a testament to your relationship.",
            "2026 Forward Strategy & Vision": "Over all good overview I would like to have understood a little more of the how behind the retention and initiatives.",
            "Personal Goals & Role Maturity": "Nice again you understood the ask and delivered on the goals. I would like to understand more on how you’ll measure thenquality goal.",
            "Executive Presence & Presentation Skills": "Overall I found you to be informed and an expert on your account refreshing! You clearly communicated with a logical flow. Next go round pause for questions! However love the confidence."
          },
          "totalScore": 37.0
        },
        {
          "accountDirector": "Jacqueline Maravilla",
          "account": "Lonza",
          "reviewerName": "Dan Hartman",
          "reviewerEmail": "dhartman@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Jacqueline was able to clearly communicate the major initiatives and how the client not only benefited from them but also bought in on the process.",
            "Value Adds & Cost Avoidance": "Jacqueline was able to demonstrate her ability to influence change within quality departments to not only avoid cost but also drive improvement for other vendors as a value add.",
            "Cost Savings Delivered": "5. She was able to clearly demonstrate that she not only met the glidepath but also proposed additional savings as options, knowing that they might be needed at a later date.",
            "Innovation & Continuous Improvement": "4",
            "Issues, Challenges & Accountability": "5",
            "2026 Forward Strategy & Vision": "4. Could use some concrete goal numbers to better capture the opportunities on the new sites.",
            "Personal Goals & Role Maturity": "5",
            "Executive Presence & Presentation Skills": "4"
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Jacqueline Maravilla",
          "account": "Lonza",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Jacqueline clearly articulated several meaningful initiatives delivered in 2025, particularly around above-the-base project execution, scope discipline, and proactive client engagement. She demonstrated strong ownership in identifying opportunities, aligning with the customer, and executing work outside the base scope in highly regulated environments. To elevate this further, the narrative could be tightened by prioritizing the most impactful initiatives and explicitly framing what changed for the client as a result of each effort.",
            "Value Adds & Cost Avoidance": "Jacqueline demonstrated exceptional value creation beyond the core contract. She proactively partnered with the client to restructure work classification, convert non-routine work into above-the-base revenue, and transparently surface savings opportunities. Her ability to operate within constraints while still delivering measurable financial value reflects strong judgment, credibility, and client trust.",
            "Cost Savings Delivered": "Jacqueline showed clear ownership of cost savings execution, including management layer reductions, headcount optimization, and deliberate vacancy management during sensitive RFP periods. She articulated how savings were created, quantified, and sustained, with meaningful financial impact for the client. This reflects strong financial stewardship and an ability to balance cost discipline with service integrity.",
            "Innovation & Continuous Improvement": "Jacqueline demonstrated continuous improvement through disciplined budget analysis, reclassification of work, and proactive identification of efficiency opportunities tied to scheduling, overtime, and material usage. These improvements show practical innovation grounded in operational realities. To reach a 5, the next step would be formalizing these practices into repeatable playbooks that can be scaled across similar accounts.",
            "Issues, Challenges & Accountability": "Jacqueline was transparent about challenges, including budget pressure, scope limitations, and customer demands for savings. She clearly owned the gaps, took corrective action, and engaged the client with data-driven solutions rather than deflection. Her willingness to surface issues early and work collaboratively toward resolution is a strong leadership signal.",
            "2026 Forward Strategy & Vision": "Jacqueline articulated a clear forward-looking approach centered on continued cost discipline, proactive savings identification, and retention through disciplined execution. The strategy is grounded, credible, and aligned with client priorities. This section could be strengthened further by explicitly sequencing initiatives and tying them to growth, differentiation, or expanded scope opportunities in 2026.",
            "Personal Goals & Role Maturity": "Jacqueline demonstrated strong role maturity through financial ownership, client-facing confidence, and disciplined decision-making. Continued focus on scaling her approach, enabling others, and translating individual execution into repeatable models will further increase her impact at the Account Director level.",
            "Executive Presence & Presentation Skills": "Jacqueline communicated with confidence and depth, demonstrating strong command of the financial and operational details of her accounts. She effectively engaged in executive-level dialogue and responded clearly to questions. Tightening prioritization and sharpening the narrative around outcomes and impact would further strengthen executive storytelling.\n\nJacqueline delivered a strong, outcome-driven review that demonstrated clear ownership, financial rigor, and client trust. Her ability to balance cost savings, value creation, and service integrity in complex environments is a differentiator. The opportunity ahead is tightening the narrative and scaling her approach so that strong individual execution translates into broader organizational leverage."
          },
          "totalScore": 35.0
        }
      ]
    },
    {
      "accountDirector": "Paul Rhodes",
      "account": "Google",
      "vertical": "Technology",
      "tier": "Tier 6",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 3.5,
        "Value Adds & Cost Avoidance": 4.0,
        "Cost Savings Delivered": 3.5,
        "Innovation & Continuous Improvement": 4.0,
        "Issues, Challenges & Accountability": 3.5,
        "2026 Forward Strategy & Vision": 3.25,
        "Personal Goals & Role Maturity": 3.5,
        "Executive Presence & Presentation Skills": 4.25
      },
      "avgTotalScore": 29.5,
      "reviews": [
        {
          "accountDirector": "Paul Rhodes",
          "account": "Google",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Lean into the value for us not just the customer. Any best practices? Alliance partnership or not be really well versed in our differences and always remind everyone of them.",
            "Value Adds & Cost Avoidance": "Love how you quantified your value adds and avoidances!",
            "Cost Savings Delivered": "Good overall explanation without any true areas of improvement. My only question was were these initiatives you came up with or managed based on your tenure.",
            "Innovation & Continuous Improvement": "Great expansion outside of janitorial. Remember to consider  process innovations as well.",
            "Issues, Challenges & Accountability": "I’d like to see more emphasis on timelines and deliverables so you can hold yourself accountable to overcoming in a sustainable way.",
            "2026 Forward Strategy & Vision": "How do the things we do add value, not sure I understood what they find valuable or how you plan to achieve it. I see where you’re going but I’d like you to know those things so we can action them.",
            "Personal Goals & Role Maturity": "I’m aligned with your goals use them in your touch base with leadership to ensure accountability.",
            "Executive Presence & Presentation Skills": "You were able to present a clear structured account narrative. Responses were well thought out when asked a question. You demonstrated confidence into the business as well as your ability to present."
          },
          "totalScore": 38.0
        },
        {
          "accountDirector": "Paul Rhodes",
          "account": "Google",
          "reviewerName": "Melissa Hampton",
          "reviewerEmail": "mhampton@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "3- discussed initiatives from a high level. Yousef hit on how we identify the value add of the client is bringing these to us first. Paul did a good job articulating process around the initiatives and process to ATB as well.",
            "Value Adds & Cost Avoidance": "Paul clearly has thought out value adds and the roadmap to implementation.",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "Value creation. I want to learn more about this with Paul and John.",
            "Issues, Challenges & Accountability": "Paul discussed how JLL doesn’t communicate between accounts and has taken it on himself to be they go between",
            "2026 Forward Strategy & Vision": "I would’ve liked to have seen specific strategy details with timelines. Paul focused mostly on the JLL strategy Ascend.",
            "Personal Goals & Role Maturity": "A lot of great ideas and would like to know the how and why behind these goals. How do you plan to increase engagement? \nWhat will you do with the account clarity?\nHow will you create value?",
            "Executive Presence & Presentation Skills": "Paul has had to get up to speed very quickly and presented very well and was confident and comfortable presenting. A deeper dive into the details is my main feedback."
          },
          "totalScore": 29.0
        },
        {
          "accountDirector": "Paul Rhodes",
          "account": "Google",
          "reviewerName": "Yousef Abbasi",
          "reviewerEmail": "yabbasi@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Demonstrated a strong shift from reactive to intentional account strategy. Effectively communicated project progress and execution with clarity. Thoughtful questions helped bridge gaps related to client outcomes. Moving forward, I’d like deeper insight into the client’s perspective and how these projects have influenced overall performance and strengthened/impacted the partnership.",
            "Value Adds & Cost Avoidance": "The financial impact of the projects was clearly articulated. Paul demonstrated our ability to pivot and support programs as a true partner, focused on mutual success and delivering substantial savings to the overall program. Looking ahead, I’d like to see SBM take a more proactive role in driving program enhancements as subject matter experts, rather than primarily following the client’s direction.",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "With a strong focus on larger accounts within the Google portfolio and the successful implementation of program enhancements, is there an opportunity to scale these single-site offerings across the broader portfolio? Additionally, I would have appreciated more insight into client feedback beyond the general statement that ‘the client is excited,’ to better understand their perspective and thoughts on the programs.",
            "Issues, Challenges & Accountability": "This portion of the presentation felt broadly outlined and lacked the specifics needed to provide deeper insight into the challenges and opportunities. The statement, ‘We need to figure out a way to drive innovation and the speed of innovation,’ without identifying the roadblocks or challenges, leaves much open to interpretation. Have we sought support to address these issues? As leaders and partners, managing accounts holistically is part of our role. A clearer understanding of why this is a challenge would be valuable. Are communication gaps with our partners contributing to this? Were we waiting for them to initiate? There seemed to be a lot left unsaid.",
            "2026 Forward Strategy & Vision": "I appreciated the emphasis on aligning with our partner around a shared vision. However, what does that vision entail? What does true alignment look like? Forward looking innovation was mentioned, but the specifics were unclear. What exactly are we innovating? The passion to support our partner and elevate value to Google came through strongly, which is greatly appreciated. What was missing were the concrete details: what steps we will take, how we will execute them, and the timeline for delivery.",
            "Personal Goals & Role Maturity": "The goals presented are commendable and will undoubtedly add value to our programs, team members, and partners. However, how will these goals be measured, and how is success defined? They felt more team and program oriented than personal, which is valuable, but I would also love to understand Paul’s personal goals.  What does he hope to achieve and what is the impact he envisions?",
            "Executive Presence & Presentation Skills": "Considering Paul’s relatively short tenure and limited time on the account, he did a fantastic job. However, references to his brief time, such as explicitly stating it upfront, seemed to be his desire lower expectations for the presentation. Removing those mentions would have strengthened the delivery and conveyed greater confidence. With more time on the account, I believe many of the gaps noted in the presentation will naturally be addressed, given the strength of his talking points and overall presentation. Gaining full account awareness will be a key advantage for him moving forward."
          },
          "totalScore": 28.0
        },
        {
          "accountDirector": "Paul Rhodes",
          "account": "Google",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 2.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Paul articulated several meaningful initiatives underway across the Google portfolio, including the shift toward a more intentional, unified account strategy, demand-based cleaning pilots, enhanced cleaning programs, and scope expansion through competitor displacement. The initiatives themselves were relevant and well selected. However, the framing leaned more toward describing what was happening or what partners were asking for rather than clearly articulating the outcomes those initiatives were designed to achieve. To strengthen this section, Paul should more explicitly define the objective behind each initiative, what success looks like for the client, and what changed or will change as a result.",
            "Value Adds & Cost Avoidance": "Paul demonstrated awareness of how value can be created through improved alignment, reduced noise, and more predictable outcomes for the client. There were clear signals of partnership and responsiveness to JLL and Google priorities. That said, value adds and cost avoidance were largely described at a conceptual level. Going forward, this section would benefit from clearer examples of deliberate decisions or actions taken that delivered incremental value beyond the contract, and from translating those efforts into operational, financial, or risk-reduction impact.",
            "Cost Savings Delivered": "While efficiency and demand-based models were discussed, cost savings delivered in 2025 were not clearly articulated or quantified. There was limited clarity on ownership of savings, execution details, or whether improvements are repeatable versus pilot-based. Given Paul’s tenure, this is understandable, but as he moves into a full operating year, I would expect clearer articulation of cost savings achieved, how they were driven, and how they will be sustained without eroding service quality or partnership trust.",
            "Innovation & Continuous Improvement": "Paul demonstrated a willingness to challenge the status quo and explore new operating models, particularly through right-time cleaning, enhanced cleaning programs, and pilot approaches at Westlake. These efforts reflect the right mindset. To elevate this further, future reviews should more clearly differentiate between ideas being tested versus innovations already delivering results, and capture lessons learned that inform broader rollout or course correction.",
            "Issues, Challenges & Accountability": "Paul acknowledged real challenges across the Google portfolio, including operational noise, siloed execution, and partner-driven change requests. There was openness around tension points, particularly where efficiency initiatives could impact flexibility or responsiveness. To strengthen this section, Paul should more explicitly state what he would do differently, where trade-offs were made, and what corrective actions or guardrails he plans to put in place with clear timelines.",
            "2026 Forward Strategy & Vision": "Paul articulated a general forward-looking direction focused on unifying the account view, improving predictability, and scaling successful initiatives across regions. The intent is sound, but the strategy would benefit from sharper definition. Moving forward, I would expect a clearer 2026 roadmap that outlines priorities, sequencing, and how these initiatives directly support retention, growth, and differentiation for Google.",
            "Personal Goals & Role Maturity": "Paul demonstrated appropriate self-awareness given his short time in role and showed a thoughtful approach to learning the portfolio and relationships. Personal development goals, however, were not yet clearly articulated or measurable. As Paul settles into the role, I would expect clearer leadership goals tied to account outcomes, team alignment, and execution discipline.",
            "Executive Presence & Presentation Skills": "Paul communicated clearly and professionally and demonstrated comfort engaging with senior stakeholders. Executive presence is developing, and confidence will naturally increase with tenure. To elevate further, tightening the narrative around outcomes, ownership, and decision rationale will help Paul lead executive-level discussions with greater authority and clarity.\n\nPaul is in a reasonable ramp phase and is demonstrating the right instincts around strategy, partnership, and modernization of the Google account. The primary opportunity moving into 2026 is sharpening outcome-based framing, clearly defining ownership versus partner-driven initiatives, and translating strategy into measurable results. With greater clarity on the “why” behind initiatives and more explicit articulation of impact, Paul is well positioned to strengthen his effectiveness and influence over the next year."
          },
          "totalScore": 23.0
        }
      ]
    },
    {
      "accountDirector": "Kimberly Wittekind",
      "account": "Nestle/GE Healthcare",
      "vertical": "Manufacturing",
      "tier": "Tier 5",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 4.333333333333333,
        "Value Adds & Cost Avoidance": 4.666666666666667,
        "Cost Savings Delivered": 4.666666666666667,
        "Innovation & Continuous Improvement": 4.0,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 4.333333333333333,
        "Personal Goals & Role Maturity": 3.6666666666666665,
        "Executive Presence & Presentation Skills": 4.0
      },
      "avgTotalScore": 33.666666666666664,
      "reviews": [
        {
          "accountDirector": "Kimberly Wittekind",
          "account": "Nestle/GE Healthcare",
          "reviewerName": "Kyle Wallace",
          "reviewerEmail": "kwallace@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Heavy on process and activities, leaving desire for additional information on results and client impact.",
            "Value Adds & Cost Avoidance": "Conveyed information well, one opportunity to capture dollars instead of percentage on ATB un-billed hours worked",
            "Cost Savings Delivered": "Nestle is an organization struggling with cost control and Kim has positioned SBM as a partner and solution, evident from national RFP",
            "Innovation & Continuous Improvement": "Strategy for additional support and increased regional presence, need outlined, gaps identified, and pinpoint issues",
            "Issues, Challenges & Accountability": "Transparent, with strategy to improve",
            "2026 Forward Strategy & Vision": "Articulated Nestle national RFP well, and strategic pipeline for GE Health",
            "Personal Goals & Role Maturity": "Clear need to clean up 4insite data and realign expectations.  Additiona understanding desired for how we plan to achieve goals - actionable, measurable, and tangible plan",
            "Executive Presence & Presentation Skills": "Presentation flow somewhat choppy.  Not a big deal to me, but time commitment on slides and overall presentation"
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Kimberly Wittekind",
          "account": "Nestle/GE Healthcare",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "No feedback provided",
            "Value Adds & Cost Avoidance": "Way to solve the problem and not have to charge them!",
            "Cost Savings Delivered": "Good savings on GE against their overall cost. I also appreciate your thinking on Little Chute to achieve cost savings.",
            "Innovation & Continuous Improvement": "How youre using service validation is exemplary!",
            "Issues, Challenges & Accountability": "You approach to issues and challenges was a different approach than others you looked inward vs issues and challenges on the accounts like failed CSATs or performance. I appreciate the self-reflection but I’m still curious on the challenges you faced on the portfolios.",
            "2026 Forward Strategy & Vision": "Your alignment is off as noted on the CSATs and your call thank you for owning it.",
            "Personal Goals & Role Maturity": "Flush out your goals.",
            "Executive Presence & Presentation Skills": "You know your accounts and you’ve clearly been a part of a lot of value creation as well as pushing to solution things as they come for your accounts. I strongly recommend you pause instead of saying um so much. You end almost every sentence with um which distracts from your best delivery. Further use your resources to tap on skills you may not have, getting in front of GE is the example. Overall your flow was logical and cohesive."
          },
          "totalScore": 33.0
        },
        {
          "accountDirector": "Kimberly Wittekind",
          "account": "GE Healthcare / Nestle",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Kimberly clearly articulated several meaningful initiatives delivered in 2025, including adding dedicated leadership capacity, expanding scope through additional equipment cleaning certifications, and strengthening the client relationship through joint industry engagement. These initiatives were well thought through and tied to account growth and scalability. To elevate this to a 5, the narrative could more explicitly connect each initiative to measurable client outcomes, such as improved coverage, reduced risk, or increased competitiveness in future bids.",
            "Value Adds & Cost Avoidance": "Kimberly demonstrated strong judgment and intentional decision-making within a highly constrained operating model. The reallocation of budget to add leadership support without additional cost to the client is a clear and credible value add, with meaningful financial impact. Given the limitations of the environment, this was a strong example of working creatively within constraints. This section could be further strengthened by framing additional value in terms of risk mitigation, continuity of service, or avoided operational disruption.",
            "Cost Savings Delivered": "Kimberly clearly articulated a tangible cost avoidance outcome through leadership support added at no incremental cost to the client, with a well-framed estimated annual value. She also demonstrated strong awareness of the account’s profitability and financial structure. To elevate further, future reviews should clearly distinguish between one-time versus repeatable savings and highlight any additional efficiencies that protect margin or improve long-term sustainability.",
            "Innovation & Continuous Improvement": "Kimberly demonstrated a thoughtful approach to continuous improvement through scope expansion, specialized training, and documentation of SOPs tied to highly regulated environments. The work shows strong potential for scalability across similar accounts. To reach a 5, the next step would be formalizing these practices into broader training or enablement mechanisms that can be leveraged more consistently across the portfolio.",
            "Issues, Challenges & Accountability": "Kimberly was transparent about the inherent constraints of the account and acknowledged operational challenges tied to growth and transitions. She demonstrated ownership by proactively adding leadership capacity and supporting difficult transitions. This section could be strengthened by more explicit reflection on what was learned and how those lessons will be applied to future growth scenarios.",
            "2026 Forward Strategy & Vision": "Kimberly articulated a clear forward-looking view centered on scalability, continued scope expansion, and leveraging unique capabilities to support future bids. The strategy was grounded in reality and aligned with account constraints. To elevate further, future reviews should include clearer sequencing and articulation of how these efforts will drive incremental growth or differentiation in 2026.",
            "Personal Goals & Role Maturity": "Kimberly demonstrated strong role maturity and self-awareness, particularly in recognizing capacity limits and proactively addressing them through leadership augmentation. Continued focus on scaling playbooks, enabling others, and driving repeatable outcomes will further strengthen impact at the Account Director level.",
            "Executive Presence & Presentation Skills": "Kimberly communicated clearly, confidently, and with strong command of the account details. She effectively responded to executive questions and demonstrated credibility with both operational and financial aspects of the business. Tightening the narrative around outcomes and explicitly linking initiatives to client impact would further enhance executive-level storytelling. \n\nKimberly delivered a strong review that demonstrated ownership, sound judgment, and effective execution within a highly constrained environment. Her ability to drive growth, protect margin, and add value without incremental cost is a real strength. The opportunity going forward is sharpening outcome-based storytelling and clearly framing impact, scalability, and lessons learned to consistently land at a 5 level."
          },
          "totalScore": 32.0
        }
      ]
    },
    {
      "accountDirector": "Peggy Shum",
      "account": "Deutsche Bank",
      "vertical": "Finance",
      "tier": "",
      "reviewCount": 1,
      "avgScores": {
        "Key Projects & Initiatives": 3.0,
        "Value Adds & Cost Avoidance": 3.0,
        "Cost Savings Delivered": 4.0,
        "Innovation & Continuous Improvement": 2.0,
        "Issues, Challenges & Accountability": 3.0,
        "2026 Forward Strategy & Vision": 4.0,
        "Personal Goals & Role Maturity": 2.0,
        "Executive Presence & Presentation Skills": 2.0
      },
      "avgTotalScore": 23.0,
      "reviews": [
        {
          "accountDirector": "Peggy Shum",
          "account": "Deutsche Bank",
          "reviewerName": "Shane Follmann",
          "reviewerEmail": "sfollmann@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 2.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 2.0,
            "Executive Presence & Presentation Skills": 2.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Good explanation of what the challenges were and some of the steps taken to address. More time and focus should be spent on the impact and results to the customer. Why does resolving the audit misalignment impact the customer relationship and what does fixing it do for CB and DB.",
            "Value Adds & Cost Avoidance": "Enhanced lobby program is a good example of a cost avoidance. I think we can develop some additional content to further define the cost impact and value add nature of this activity.",
            "Cost Savings Delivered": "Cost savings was clearly defined from a what how and why standpoint. I think this section warranted a little more conversation on what we were doing to get funding for the last EE and what other cost savings we can provide in return.",
            "Innovation & Continuous Improvement": "Enhanced Lobby program was mentioned in the cost avoidance section but was the only example of an innovation. Some work to do here on the specifics of this program and any other innovations SBM has deployed to the account.",
            "Issues, Challenges & Accountability": "The challenges of July coverage issue were brought up and discussed head on. Some additional details on what we have done over the last 6 months to address would have helped improve this section.",
            "2026 Forward Strategy & Vision": "Path forward had a strong visual with 3 components the conversation and plan around this section was much better developed.",
            "Personal Goals & Role Maturity": "No specific material prepared for this section, but we did discuss working on and developing stronger presentation skills",
            "Executive Presence & Presentation Skills": "The 4i portion of the presentation had some struggles with loading times and continuity but the structured PPT section on the presentation was much smother. I think the initial challenges in 4i created some hurdles that were hard to overcome and get back on track. I think it would have been wise to pivot off of 4i earlier once it became clear it wasn't going to work the way you needed it to."
          },
          "totalScore": 23.0
        }
      ]
    },
    {
      "accountDirector": "Ana Sabater",
      "account": "LinkedIn/Uber",
      "vertical": "Technology",
      "tier": "",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 4.75,
        "Value Adds & Cost Avoidance": 4.25,
        "Cost Savings Delivered": 4.25,
        "Innovation & Continuous Improvement": 3.75,
        "Issues, Challenges & Accountability": 4.75,
        "2026 Forward Strategy & Vision": 4.0,
        "Personal Goals & Role Maturity": 4.5,
        "Executive Presence & Presentation Skills": 4.25
      },
      "avgTotalScore": 34.5,
      "reviews": [
        {
          "accountDirector": "Ana Sabater",
          "account": "LinkedIn/Uber",
          "reviewerName": "Shane Follmann",
          "reviewerEmail": "sfollmann@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "- LinkedIn, I thought the walk through of the key projects was very good I had a clear understanding of what each item was and how it was accomplished. The very end of the section hit on how it transformed the relationship to be more strategic was an excellent impact. \n- Uber, conversation around 4I integration is key",
            "Value Adds & Cost Avoidance": "Uber, there was good conversation around the initiatives and the cost being tracked but felt the impact could have been hit harder on how Uber/CBRE responded to those items.",
            "Cost Savings Delivered": "LinkedIn - 87k cost reduction \nUber, there was good conversation around the initiatives and the cost being tracked but felt the impact could have been hit harder on how Uber/CBRE responded to those items.",
            "Innovation & Continuous Improvement": "Uber, 4I integration and usage by CBRE is really interesting I think this section could have been fleshed out more on the impact CBRE being in the tool is having. I thought you did a great job responding to questions here.",
            "Issues, Challenges & Accountability": "LinkedIn, I appreciated how you did not shy away from some of the challenges and took ownership where appropriate and talk through what we have been doing to address and fix the issues. \nUber, I appreciated the walk through of the union escalations but would have liked some additional explanation of what steps were taken to mitigate impact and if/how successful they were.",
            "2026 Forward Strategy & Vision": "The goals listed are great. I think a little more conversation on timeline would have helped.  While pricing and HC expansion can be hard to predict exactly a ballpark would have been helpful to understand expected impact.",
            "Personal Goals & Role Maturity": "I think these were all strong goals and definitely play key functions for your role. I would have appreciated hearing about something you wanted to work on for your own career growth.",
            "Executive Presence & Presentation Skills": "I thought the time allocation between LinkedIn and Uber was excellent. Pacing was quick without feeling overly rushed and sections contained"
          },
          "totalScore": 33.0
        },
        {
          "accountDirector": "Ana Sabater",
          "account": "LinkedIn and Uber",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "You clearly framed your most important initiatives and why they mattered the impact to your analysis of the customer was my favorite part.",
            "Value Adds & Cost Avoidance": "Way to go on the value add the events support is my favorite one. Excellent job with your cost avoidance.",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "Thank you for identifying innovations. Your customers creating to-dos wow! True integration. Challenge in 2026 innovate one process.",
            "Issues, Challenges & Accountability": "No feedback provided",
            "2026 Forward Strategy & Vision": "Love that you’re starting your renewal strategy early. Inventory control and consumables is a best practice. I’d like to see the roadmap built out a little more. The the plans to how they support the renewal.",
            "Personal Goals & Role Maturity": "I’d like to see how you plan to execute your goals and timelines.",
            "Executive Presence & Presentation Skills": "You know your accounts, you started off a bit nervous but as you settled into your flow you relaxed and communicated clearly what you know. Only a few minor gaps noted above overall I thought you did really well."
          },
          "totalScore": 37.0
        },
        {
          "accountDirector": "Ana Sabater",
          "account": "LinkedIn/Uber",
          "reviewerName": "Luna Duarte",
          "reviewerEmail": "lduarte@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Clearly highlighted the most important initiatives based on the customers needs.",
            "Value Adds & Cost Avoidance": "Strong examples for each area of the business with clear value adds.",
            "Cost Savings Delivered": "Uber was clearly quantified. Ana shows true account ownership over the financials.",
            "Innovation & Continuous Improvement": "Looking forward the all that Ana rolls out at LinkedIn.",
            "Issues, Challenges & Accountability": "Transparent with challenges and lessons learned. Owns gaps in process and working to overcome.",
            "2026 Forward Strategy & Vision": "No feedback provided",
            "Personal Goals & Role Maturity": "Defined goals were measurable and aligned with AD role.",
            "Executive Presence & Presentation Skills": "Ana led the conversation with confidence. She truly understands her accounts. Nice executive presence."
          },
          "totalScore": 36.0
        },
        {
          "accountDirector": "Ana Sabater",
          "account": "LinkedIn, Uber",
          "reviewerName": "NIck Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Ana clearly articulated the most important initiatives delivered in 2025, particularly around the LinkedIn transition, early stabilization, safety improvements, and rapid operational adjustments at HQ. She demonstrated strong ownership in navigating a complex transition without an IFM partner and establishing direct client relationships early. To elevate this to a 5, the narrative could be tightened by prioritizing the top initiatives and more explicitly framing what changed for the client in measurable terms as a result of each effort.",
            "Value Adds & Cost Avoidance": "Ana demonstrated strong value creation beyond the base contract, especially through the tiered cost optimization proposals and proactive repositioning as a strategic partner rather than a reactive vendor. Delivering clear productivity scenarios and potential savings ranges was a solid example of intentional value-add. This section would be further strengthened by translating proposed savings into realized outcomes or clearly distinguishing between delivered versus potential value.",
            "Cost Savings Delivered": "Ana articulated potential cost savings opportunities well, particularly through productivity tiering and staffing model adjustments. However, most savings discussed were directional or proposed rather than clearly executed and sustained in 2025. As the account matures, I would expect clearer articulation of savings that were actually delivered, how they were achieved, and whether they are repeatable going forward.",
            "Innovation & Continuous Improvement": "Ana demonstrated a strong continuous improvement mindset, particularly through rapid schedule redesign, hybrid staffing models, and operational refinements that reduced service tickets and improved client experience. These improvements were practical, responsive, and impactful. To reach a 5, the next step would be formalizing these approaches into repeatable practices that can be scaled across similar accounts.",
            "Issues, Challenges & Accountability": "Ana was transparent and accountable in discussing challenges, including the Omaha exit, staffing misalignment, and lingering client perceptions from prior account losses. She demonstrated strong self-awareness, owned the gaps, and clearly articulated what she would do differently moving forward. This level of reflection and accountability is a strong leadership signal.",
            "2026 Forward Strategy & Vision": "Ana articulated a clear forward-looking approach centered on strengthening talent placement, repairing key stakeholder relationships, and continuing to position SBM as a proactive partner. The strategy is grounded and aligned with client priorities. This section could be strengthened further by sequencing initiatives and explicitly tying them to retention, growth, or expansion opportunities in 2026.",
            "Personal Goals & Role Maturity": "Ana demonstrated strong role maturity and growth readiness, particularly in her willingness to self-reflect, make leadership changes, and adjust approach quickly when things were not working. Continued focus on scaling her decision-making and enabling consistent execution across sites will further increase her impact.",
            "Executive Presence & Presentation Skills": "Ana communicated clearly and confidently, with strong command of operational details and client context. She led the discussion effectively and responded well to questions. Tightening prioritization and sharpening the storyline around outcomes and impact would further strengthen executive-level storytelling.\n\nAna delivered a strong, well-rounded review that demonstrated ownership, resilience, and a clear ability to stabilize and improve complex accounts. Her transparency around challenges and willingness to course-correct are real strengths. The opportunity ahead is sharpening outcome-based framing and clearly distinguishing delivered impact from proposed initiatives to consistently operate at a 5 level."
          },
          "totalScore": 32.0
        }
      ]
    },
    {
      "accountDirector": "Taylor Wattenberg",
      "account": "Microsoft",
      "vertical": "Technology",
      "tier": "Tier 6",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 4.333333333333333,
        "Value Adds & Cost Avoidance": 4.333333333333333,
        "Cost Savings Delivered": 3.6666666666666665,
        "Innovation & Continuous Improvement": 4.666666666666667,
        "Issues, Challenges & Accountability": 3.6666666666666665,
        "2026 Forward Strategy & Vision": 4.666666666666667,
        "Personal Goals & Role Maturity": 4.333333333333333,
        "Executive Presence & Presentation Skills": 4.333333333333333
      },
      "avgTotalScore": 34.0,
      "reviews": [
        {
          "accountDirector": "Taylor Wattenberg",
          "account": "Microsoft",
          "reviewerName": "Shane Follmann",
          "reviewerEmail": "sfollmann@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "I think the first two points were well explained and clear, but the sustainability was a little confusing from exactly what was being communicated on the reduction and volume side.",
            "Value Adds & Cost Avoidance": "Value add section was clearly articulated all categories had values tied to them and there was a good explanation of strategy in 2025 on how cost savings vs increase to ATB.",
            "Cost Savings Delivered": "Cost savings got a little folded into Value adds and cost avoidance. I think it would have been helpful to differentiate this section just a little more.",
            "Innovation & Continuous Improvement": "This section was very well developed with 3 clear innovations and articulations on why they are being perused.",
            "Issues, Challenges & Accountability": "This sectioned suffered a little from some blurring in the different challenges. I would have appreciated some additional differentiation on each topic.",
            "2026 Forward Strategy & Vision": "I thought all of the goals were clear with attached timelines and achievable results. Each goal had a key impact to the account success.",
            "Personal Goals & Role Maturity": "No feedback provided",
            "Executive Presence & Presentation Skills": "Overall, the presentation was well put together, and you demonstrated a strong understanding of the account and the ongoing operations. There were a few moments where things got a little muddled and you had to work your way out."
          },
          "totalScore": 33.0
        },
        {
          "accountDirector": "Taylor Wattenberg",
          "account": "Microsoft",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 5.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Major initiatives were clear with why they mattered and demonstrated impact awareness and how it all impacts the revenue!",
            "Value Adds & Cost Avoidance": "Despite growth you still used a key supplier approach with cost avoidance. You still created value with actual revenue captured great work!",
            "Cost Savings Delivered": "Paper towel length is a huge dollar figure. Love that you have actual findings.",
            "Innovation & Continuous Improvement": "You easily have the longest list of innovations so far. Clear outcomes and lessons learned! Using co-pilot vs 4i how can you work it together.",
            "Issues, Challenges & Accountability": "No feedback provided",
            "2026 Forward Strategy & Vision": "Being a trusted provider an expert a point of authority for sustainability is important. Also important is relationship strategy, how are you connecting and with whom.",
            "Personal Goals & Role Maturity": "Financial understanding comes by both doing and digesting. Put in the time you can overcome that insecurity. Great job making them\nSMART goals!",
            "Executive Presence & Presentation Skills": "You lead this discussion with confidence and presented clearly with structured content. You responded well to the questions asked!"
          },
          "totalScore": 39.0
        },
        {
          "accountDirector": "Taylor Wattenberg",
          "account": "Microsoft",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Taylor clearly articulated several material 2025 initiatives tied directly to Microsoft’s evolving needs, including campus expansion, return-to-office reoccupancy, and sustainability pilots. The scope, scale, and outcomes were well defined, particularly where initiatives translated into incremental square footage, FTE growth, and meaningful revenue impact. To reach a 5, future reviews should more explicitly separate initiatives delivered versus in-flight and tighten the narrative around what specifically changed for Microsoft as a result of each decision.",
            "Value Adds & Cost Avoidance": "Taylor demonstrated strong value creation beyond base contract requirements, particularly through proactive support of Microsoft’s return-to-office strategy and sustainability initiatives. These efforts clearly positioned SBM as a strategic partner rather than a reactive vendor. While the value narrative was compelling, translating more of these efforts into clearer financial, operational, or risk-avoidance framing would further strengthen the impact.",
            "Cost Savings Delivered": "Cost efficiency was discussed primarily through right-sizing, productivity alignment, and sustainability outcomes rather than direct cost savings. While this is appropriate given the growth-oriented nature of the account, this section would benefit from clearer articulation of where savings were achieved, avoided, or structurally embedded into the operating model. Even directional estimates or examples of sustained efficiencies would elevate this score.",
            "Innovation & Continuous Improvement": "Taylor showed strong leadership in innovation, most notably through the biodigester pilot and sustainability efforts. These initiatives demonstrated a willingness to test, learn, and iterate while aligning with Microsoft’s broader ESG priorities. Clear outcomes and lessons learned were shared. Continued focus on scaling these innovations across the portfolio or formalizing them into repeatable playbooks would move this to an exceptional rating.",
            "Issues, Challenges & Accountability": "Challenges were acknowledged, particularly around rapid scale, reoccupancy complexity, and execution pressure tied to Microsoft’s mandates. While ownership was evident, this section would benefit from deeper reflection on what was hardest, what could have been done differently, and what corrective actions are being put in place with timelines. More explicit self-assessment would strengthen accountability signaling.",
            "2026 Forward Strategy & Vision": "Taylor articulated a clear forward-looking strategy focused on growth, retention, sustainability expansion, and positioning for future renewal. The linkage between 2025 initiatives and 2026 priorities was logical and credible. To reach a 5, future articulation should include clearer sequencing, defined milestones, and how SBM will continue to differentiate itself as Microsoft’s needs evolve.",
            "Personal Goals & Role Maturity": "Taylor demonstrated strong role maturity and readiness, particularly in managing large-scale growth, complex stakeholder environments, and innovation-driven initiatives. Personal goals were implied through ownership of major programs and forward planning. Making those goals more explicit and measurable would further reinforce leadership development and accountability.",
            "Executive Presence & Presentation Skills": "Taylor communicated confidently at an executive level, handled complex topics well, and demonstrated command of both the account and the data. The narrative was logical and outcome-oriented, though occasionally dense. Sharpening concision and prioritization of the “so what” for executives would further elevate presence and impact.\n\nTaylor is operating at a high level on a complex, high-visibility account and is clearly trusted by the client to support growth, transformation, and innovation. His strongest strengths are scale management, commercial impact, and alignment to client strategy. The next step is tightening executive storytelling, sharpening accountability reflection, and translating innovation into repeatable enterprise value. Taylor is on a strong trajectory and is delivering at a level consistent with top-tier Account Director performance."
          },
          "totalScore": 30.0
        }
      ]
    },
    {
      "accountDirector": "Jack Thornton",
      "account": "Nike Distribution",
      "vertical": "Distribution",
      "tier": "Tier 4",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 3.6666666666666665,
        "Value Adds & Cost Avoidance": 4.333333333333333,
        "Cost Savings Delivered": 4.0,
        "Innovation & Continuous Improvement": 4.0,
        "Issues, Challenges & Accountability": 3.3333333333333335,
        "2026 Forward Strategy & Vision": 3.3333333333333335,
        "Personal Goals & Role Maturity": 3.0,
        "Executive Presence & Presentation Skills": 3.0
      },
      "avgTotalScore": 28.666666666666668,
      "reviews": [
        {
          "accountDirector": "Jack Thornton",
          "account": "Nike Distribution",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 5.0,
            "Cost Savings Delivered": 5.0,
            "Innovation & Continuous Improvement": 5.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "I’d like to understand projects outside of renewal more. Important to track these in 2026",
            "Value Adds & Cost Avoidance": "It’s great to have the financial support of what’s been avoided and value adds make sure you’re communicating with the customer these dollars!",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "Love that you implemented a process improvement. Have you don’t any discovery on robots? Reach out to Nvidia AD Stuart Kelloff and Shane would be a great contact for you.",
            "Issues, Challenges & Accountability": "How can we help Nike do better with their own programs? Consultation to execution lean on Nick Viskovich to help strategize this he has the skills to help solution this with you.",
            "2026 Forward Strategy & Vision": "I’d like to hear how the account will be elevated. More planned initiatives with timelines. Who are you mentoring? I heard you say Cole, he is existing and knows ops who is he then mentoring.",
            "Personal Goals & Role Maturity": "Being self aware or able to receive feedback. I want to lean into how we can support you outside of SBM.",
            "Executive Presence & Presentation Skills": "You’re confident, with a decent flow. Minor gaps in timelines and teeth around the goals. Focus on what impacts we can have and how we can reinvent ourselves. Winning GXO will put us in the big leagues! If you chose to improve your presentation skills try toast masters!"
          },
          "totalScore": 32.0
        },
        {
          "accountDirector": "Jack Thornton",
          "account": "Nike Distribution",
          "reviewerName": "Shane Follmann",
          "reviewerEmail": "sfollmann@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "There was a clear explanation of what was a focus for the year, but I think you could have Impact to those projects",
            "Value Adds & Cost Avoidance": "Each topic was identified and had a clear cost tied to it. Keep a focus on the impact to the customer and what they are receiving from these items.",
            "Cost Savings Delivered": "This section got a little clumped into Value adds. It would have been beneficial to give it a little more of a standalone treatment so it didn't feel like it was getting lost.",
            "Innovation & Continuous Improvement": "I appreciated the walk through of the process and that fact that you gave credit to Cole for his work on it. Again, just drive home the impact to each item",
            "Issues, Challenges & Accountability": "This section was just a little rushed, but you did a strong job responding to the questions and adding more context. It would be good to include some of that information in your initial talk track.",
            "2026 Forward Strategy & Vision": "There is a lot of potential growth on the table for Nike and GXO for this year it would have been helpful to preemptively highlight what we are doing to position and prepare for these opportunities.",
            "Personal Goals & Role Maturity": "I agree with all of the goals presented but they need some more explanation on what you were going to implement to achieve them and when.",
            "Executive Presence & Presentation Skills": "I think you managed the presentation well I have seen the progress you have made in presenting over the last 6-8 months. Keep leaning on your deep knowledge of the account no one can speak to Nike like you can. The beginning of the presentation was a little stiff but think you got more comfortable as you went along."
          },
          "totalScore": 28.0
        },
        {
          "accountDirector": "Jack Thornton",
          "account": "Nike Distribution",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Jack highlighted several important wins in 2025, particularly contract renewals and account expansion driven by long-standing relationships with Nike and GXO. The strength and longevity of those relationships are real and clearly matter. That said, the review leaned heavily on relationship history rather than clearly articulated initiatives delivered in 2025. To strengthen this section, Jack should more explicitly frame what was intentionally done in 2025, why those actions mattered, and what changed for the client as a result beyond continued continuity.",
            "Value Adds & Cost Avoidance": "Jack demonstrated a strong service mindset and clear intent to deliver value beyond the contract, particularly through deep cleanings during down days, preventive maintenance support, and discretionary work performed without incremental charges. These examples reflect trust, partnership, and good judgment. To elevate further, this section would benefit from clearer structure around how value-add decisions are made and more explicit translation of these efforts into operational or risk-based impact for the client.",
            "Cost Savings Delivered": "Jack articulated meaningful cost savings and avoidance delivered in 2025, with reasonable estimates tied to deep cleanings, preventive maintenance, and efficiency improvements. The fact that the account has remained consistently green is a strong signal of financial stewardship. This section could be strengthened further by clearly distinguishing which savings are repeatable versus opportunistic and tying them more directly to sustainable operating practices.",
            "Innovation & Continuous Improvement": "Jack demonstrated practical continuous improvement through proactive use of downtime, efficient deployment of labor, and willingness to go beyond minimum scope. However, innovation was framed more as situational execution than intentional process change. To elevate this area, I would expect clearer examples of new processes, tools, or playbooks introduced in 2025 that can be replicated across other accounts.",
            "Issues, Challenges & Accountability": "Challenges and risks were not deeply explored in this review. While the account is performing well, a stronger executive-level review would include reflection on where friction exists, what trade-offs were made, or where future risk may emerge. Surfacing those areas proactively, even when performance is strong, is an important leadership signal.",
            "2026 Forward Strategy & Vision": "The review did not clearly articulate a forward-looking 2026 strategy beyond continued strong execution and partnership. Given the maturity and scale of the account, I would expect a more explicit roadmap outlining how the relationship will be further strengthened, expanded, or differentiated in 2026.",
            "Personal Goals & Role Maturity": "Jack clearly demonstrates role maturity through consistency, discipline, and relationship stewardship. Personal development goals, however, were not explicitly articulated. As expectations rise, clearer articulation of leadership goals and how Jack plans to evolve his impact would strengthen this section.",
            "Executive Presence & Presentation Skills": "Jack communicated comfortably and confidently and clearly knows his accounts well. The presentation relied more on conversational explanation than a structured executive narrative. Tightening the storyline around initiatives, outcomes, and forward strategy would strengthen executive presence and ensure the full impact of the work is clearly conveyed.\n\nJack runs a very stable, high-performing account with exceptional client trust and consistent financial results. That foundation is strong and should not be understated. The opportunity ahead is elevating how that performance is framed and articulated at an executive level—moving from “we do a great job and the client trusts us” to clearly documenting initiatives, outcomes, risks, and forward strategy. With that shift, Jack’s reviews will better reflect the true strength of the account and his leadership."
          },
          "totalScore": 26.0
        }
      ]
    },
    {
      "accountDirector": "Isaac Calderon",
      "account": "Bayer/J&J/Kenvue/Millipore Sigma",
      "vertical": "Life Science",
      "tier": "Tier 6",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 3.6666666666666665,
        "Value Adds & Cost Avoidance": 3.6666666666666665,
        "Cost Savings Delivered": 3.6666666666666665,
        "Innovation & Continuous Improvement": 3.3333333333333335,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 4.333333333333333,
        "Personal Goals & Role Maturity": 3.3333333333333335,
        "Executive Presence & Presentation Skills": 4.0
      },
      "avgTotalScore": 30.0,
      "reviews": [
        {
          "accountDirector": "Isaac Calderon",
          "account": "Bayer/J&J/Kenvue/Millipore Sigma",
          "reviewerName": "mike jedan",
          "reviewerEmail": "mjedan@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Good examples. Would like to hear more on client impact.",
            "Value Adds & Cost Avoidance": "Good examples, would like to hear more about the client's perception of the value of these.",
            "Cost Savings Delivered": "Focus more on customer value as a result of cost savings.",
            "Innovation & Continuous Improvement": "I think you have good stuff here.  I want to hear more about what we actually did and how it added value to the client.",
            "Issues, Challenges & Accountability": "Great job taking ownership.  Feedback given during the presentation.",
            "2026 Forward Strategy & Vision": "You had me at \"Service with Purpose\".  I am very interested and excited in the details as this initiative develops.",
            "Personal Goals & Role Maturity": "I think you covered some of this during the course of the presentation, however I would like to have heard some specific information about this topic.",
            "Executive Presence & Presentation Skills": "Very creative approach to how you manage your business.  I think attaching those ideas to concrete examples and results would be a next step.  Thanks Alex!  (isaac gets that last comment)."
          },
          "totalScore": 31.0
        },
        {
          "accountDirector": "Isaac Calderon",
          "account": "Bayer/J&J/Kenvue/Millipore Sigma",
          "reviewerName": "Marvin Owens",
          "reviewerEmail": "mowens@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 5.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Good job articulating and telling the story on projects and initiatives.",
            "Value Adds & Cost Avoidance": "Good job, lots of value adds and cost avoidance efforts. Good knowledge of operational challenges and solutioning communicated.",
            "Cost Savings Delivered": "Good story and able to articulate the savings delivery. Would have been good to show the actual savings dollars.",
            "Innovation & Continuous Improvement": "Took ownership of the fact that this is an area of improvement but was able to articulate efforts in this area.",
            "Issues, Challenges & Accountability": "Very transparent regarding this topic. Clearly articulated specific challenges and where there were missed opportunities and key learnings.",
            "2026 Forward Strategy & Vision": "Great job communication his vision and implementation timeline. Clear vision on paths that he needs to take to promote and get more growth with his accounts.",
            "Personal Goals & Role Maturity": "Really good job overall. Clearly took the time to think through this and great job connect all accounts into the presentation. Lots of good ideas and really good baseline for 2026 initiatives.",
            "Executive Presence & Presentation Skills": "Check all of the boxes above from my perspective. Vert confident, well structured, good content to supplement his story, good acknowledgment of his team and the role that the play. Good presence as well."
          },
          "totalScore": 35.0
        },
        {
          "accountDirector": "Isaac Calderon",
          "account": "Bayer/J&J/Kenvue/Millipore Sigma",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Isaac demonstrated a solid understanding of the breadth and complexity of his portfolio and clearly articulated the scope of clients supported across multiple geographies and operating models. He framed the year around portfolio-level performance, including quality, safety, and financial results. That said, the review leaned more toward aggregated performance and context than clearly defined initiatives that Isaac personally drove in 2025. To elevate this section, I would expect clearer articulation of 2–3 specific initiatives he owned end-to-end, why they mattered, and what changed for the client as a result.",
            "Value Adds & Cost Avoidance": "Isaac showed awareness of where value is created across the portfolio and referenced financial and operational highlights at a high level. However, value adds and cost avoidance efforts were primarily discussed in aggregate rather than as intentional, decision-driven actions. To strengthen this section, future reviews should highlight concrete examples of value delivered beyond the contract and clearly translate those efforts into operational, financial, or risk-based impact.",
            "Cost Savings Delivered": "Cost performance and financial discipline were referenced, particularly in the context of portfolio growth and integration of new business. However, cost savings were not clearly broken down in terms of ownership, execution, or sustainability. To raise this score, Isaac should explicitly call out savings achieved in 2025, explain how they were driven, and distinguish between one-time and repeatable improvements.",
            "Innovation & Continuous Improvement": "Isaac demonstrated a continuous improvement mindset by reviewing trends in KPIs, safety, and quality across the portfolio and using data to inform discussion. However, innovation was framed more as analysis and monitoring than as leadership of new processes, tools, or changes in how the business operates. To elevate this section, I would expect clearer examples of initiatives tested, improvements implemented, and lessons learned that can be scaled.",
            "Issues, Challenges & Accountability": "Isaac acknowledged the challenges associated with portfolio growth, new client onboarding, and variability in performance metrics. There was openness to discussing the data and its implications. This section would be stronger with more explicit reflection on what did not go as planned, what Isaac would approach differently, and what corrective actions were taken or are planned, with clearer ownership and timelines.",
            "2026 Forward Strategy & Vision": "Isaac articulated general forward-looking intent around continued stabilization, performance improvement, and leveraging the expanded portfolio. The direction is sound, but the strategy would benefit from sharper definition. Going forward, I would expect a clearer 2026 roadmap outlining priorities, sequencing, and how the portfolio will be elevated through retention, growth, and differentiation.",
            "Personal Goals & Role Maturity": "Isaac demonstrated confidence, comfort with complexity, and strong command of his portfolio, which reflects role maturity. Personal development goals, however, were not clearly articulated or measurable. As expectations increase, I would expect clearer leadership goals tied to execution discipline, team development, and client impact.",
            "Executive Presence & Presentation Skills": "Isaac communicated clearly and confidently and engaged well with senior leaders. The presentation was conversational and collaborative, which helped encourage dialogue. To elevate executive presence further, tightening structure and leading more explicitly with outcomes, decisions, and impact would strengthen the overall account narrative.\n\nIsaac is managing a complex, multi-client portfolio and demonstrates solid fundamentals in analysis, engagement, and accountability. The primary opportunity moving forward is sharpening ownership and outcome-based storytelling—moving from aggregated performance to clearly articulated initiatives, decisions, and impact. With more explicit framing around what he drives personally and how it changes outcomes, Isaac can strengthen his positioning relative to peers and raise his overall effectiveness."
          },
          "totalScore": 24.0
        }
      ]
    },
    {
      "accountDirector": "Patrick Murtha",
      "account": "Cardinal/IQVIA/McKesson",
      "vertical": "Life Science",
      "tier": "",
      "reviewCount": 4,
      "avgScores": {
        "Key Projects & Initiatives": 3.75,
        "Value Adds & Cost Avoidance": 3.5,
        "Cost Savings Delivered": 3.5,
        "Innovation & Continuous Improvement": 3.0,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 2.75,
        "Personal Goals & Role Maturity": 2.75,
        "Executive Presence & Presentation Skills": 3.5
      },
      "avgTotalScore": 26.75,
      "reviews": [
        {
          "accountDirector": "Patrick Murtha",
          "account": "Cardinal/IQVIA/McKesson",
          "reviewerName": "Valarie Barnett",
          "reviewerEmail": "vbarnett@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 2.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "For this I would like to understand more of the value statements to the customer. Why did this matter?",
            "Value Adds & Cost Avoidance": "No feedback provided",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "While you were able to show an innovation for Cardinal, I would like to see more in this category. Process improvement proposed technology etc this can be a goal for 2026.",
            "Issues, Challenges & Accountability": "Strong delivery of how we own gaps and corrective action only thing missing is our timelines to success. When will the issues be resolved by what does success look like.",
            "2026 Forward Strategy & Vision": "Overall good ideas but a lack of specificity around how you will retain Cardinal. What actions will you take? By what date? How will you improve CSATs? McKesson how will you do these things?",
            "Personal Goals & Role Maturity": "Translate your tactic into strategy",
            "Executive Presence & Presentation Skills": "The details are what I’m looking for please flush this out."
          },
          "totalScore": 27.0
        },
        {
          "accountDirector": "Patrick Murtha",
          "account": "Cardinal/IQVIA/McKesson",
          "reviewerName": "Mike Jedan",
          "reviewerEmail": "mjedan@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 3.0,
            "2026 Forward Strategy & Vision": 2.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "What was presented was mainly results.  I want to understand the strategy and initiatives that created the results.",
            "Value Adds & Cost Avoidance": "Cost avoidance/savings information was presented.  I want to hear more about how this translated to value to the client.  What is next?",
            "Cost Savings Delivered": "Need to link cost savings to overall strategy.",
            "Innovation & Continuous Improvement": "Gave real examples of actions and impact.",
            "Issues, Challenges & Accountability": "Not sure this was covered.",
            "2026 Forward Strategy & Vision": "We can improve this score relatively quickly.  You have the base information, need to work on translating that into strategic vision.",
            "Personal Goals & Role Maturity": "Provided goals for the accounts.  I want to understand what your goals are and how, by meeting those goals, it translates to value to the client and SBM.",
            "Executive Presence & Presentation Skills": "I would like to work with you on doing this presentation again, perhaps mid-February as I know the Lonza transition is the priority right now for both of us.  You have good information, I would like to explore how we can turn that information into strategic initiatives."
          },
          "totalScore": 23.0
        },
        {
          "accountDirector": "Patrick Murtha",
          "account": "Cardinal/IQVIA/McKesson",
          "reviewerName": "Zach Shock",
          "reviewerEmail": "zshock@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 5.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "I thought Pat did a great job delivering the major initiatives for 2025. He was able to work with Ryan to keep McKesson from going to RFP while also placing SBM in a great place to grow the portfolio. \nHe also was able work with the CAH subbed sites and close that financial gaps that have plagued this portfolio for years. He was also able to increase revenue and wages at the Greenwood site for CAH.",
            "Value Adds & Cost Avoidance": "It is hard to find cost avoidance at small sites as their budgets are usually very tight but Pat was able to work with C&W and their events team at the McKesson Irving site to assistance with the set ups. This has saved the client roughly $8800 since August.",
            "Cost Savings Delivered": "Pat was able help navigate the McKesson RFP without losing a site and was able to save the client 8%.",
            "Innovation & Continuous Improvement": "Pat also was able to work with the site manager at CAH Dublin to change the routes and frequencies to better align with client needs, instead of adding to the headcount.\n\nHe has a challenging POC at IQVIA Marietta that he has been able to work with and increase SBMs relationship at the site.",
            "Issues, Challenges & Accountability": "Pat is fully transparent about issues and he attacks them head on. We meet and discuss the plans and come up with corrective actions and timelines together.",
            "2026 Forward Strategy & Vision": "Base information is there but need a more strategic vision and plan for 2026.\nSet up meetings with Zach, Mike, Dan, Marvin to discuss and we can formulize a plan by Feb. to present to Val by end of March/April",
            "Personal Goals & Role Maturity": "Pat is always looking for growth opportunities. I know this as I have been on calls with him and the client. He has been able to establish a very good relationship at all of the portfolios and SBM is the first call when a change of their current provided is needed. \n\nNeed to flush out his personal goals with dates and measurables.",
            "Executive Presence & Presentation Skills": "Executive presence - Leading with a clear message and communicating with confidence are hallmarks of strong executive impact. That's exactly what you want to see at that level.\nDeep business knowledge - The fact that his understanding came through clearly suggests he's not just skimming the surface but really owns his domain.\nNo gaps - This is particularly telling. When someone can field questions and drive discussion without obvious weak spots, it shows thorough preparation and genuine command of the material."
          },
          "totalScore": 33.0
        },
        {
          "accountDirector": "Patrick Murtha",
          "account": "Cardinal/IQVIA/McKesson",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 2.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 3.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Patrick covered the major portfolio events from the time he assumed ownership, including the McKesson renewal, expansion within IQVIA, and pursuit of new Cardinal Health opportunities. The overview demonstrated awareness of account dynamics and an understanding of where momentum and friction exist. That said, many of the initiatives were framed as inherited or collaborative efforts rather than clearly articulated initiatives Patrick personally drove. Going forward, I would expect clearer framing around what Patrick owned end-to-end, why those initiatives mattered, and what changed for the client as a result.",
            "Value Adds & Cost Avoidance": "Patrick demonstrated an understanding of value creation through proactive engagement, particularly in navigating renewals, pricing discussions, and absorption planning following revenue reductions. However, value-add efforts were largely described as responses to external pressures rather than deliberate, proactive decisions that delivered incremental value. This section would be stronger with clearer examples of value delivered beyond contract scope and more explicit translation into financial, operational, or risk-based impact.",
            "Cost Savings Delivered": "Patrick clearly articulated the financial impact of the McKesson renewal and showed ownership in working with site leadership to absorb revenue reductions while maintaining service levels. The discussion reflected financial awareness and discipline. To elevate this further, I would expect clearer articulation of cost savings actually delivered, how those savings were executed, and whether they are repeatable or one-time measures tied to long-term sustainability.",
            "Innovation & Continuous Improvement": "While Patrick demonstrated effort in stabilizing challenged sites and working through transitions, innovation and continuous improvement were primarily framed around remediation rather than intentional process or model changes. This is understandable given the timing and complexity of the portfolio. Moving into 2026, I would expect clearer leadership in identifying improvements to staffing models, subcontractor strategy, or operating cadence that can be scaled beyond individual sites.",
            "Issues, Challenges & Accountability": "Patrick was transparent and detailed in outlining challenges across Cardinal Health, IQVIA, and McKesson, including subcontractor economics, CSAT issues, turnover, and partner transitions. He demonstrated ownership of these challenges without deflection and clearly articulated contributing factors. This is a strength. To elevate further, future reviews should include clearer corrective action plans with timelines and success criteria to show forward momentum, not just diagnosis.",
            "2026 Forward Strategy & Vision": "Patrick articulated a general forward-looking intent around stabilization, margin recovery, and continued engagement with key clients. The direction is sound, but the strategy would benefit from sharper definition. As Patrick enters a full planning cycle, I would expect a clearer 2026 roadmap outlining priorities, sequencing, and how the portfolio will be elevated through retention, growth, and operational discipline.",
            "Personal Goals & Role Maturity": "Patrick demonstrated self-awareness around his learning curve and the complexity of stepping into multiple challenged accounts. Role maturity is developing, particularly in financial and operational understanding. Personal leadership goals, however, were not clearly articulated. Going forward, clearer development objectives tied to execution rigor, communication effectiveness, and portfolio stabilization would strengthen this section.",
            "Executive Presence & Presentation Skills": "Patrick communicated clearly and candidly and demonstrated comfort discussing difficult topics with senior leadership. The presentation leaned more toward detailed operational reporting than a structured executive narrative. Tightening the storyline around priorities, decisions, and outcomes would strengthen executive presence and ensure the most important messages land clearly.\n\nPatrick stepped into a complex, mixed-performance portfolio mid-year and demonstrated transparency, effort, and accountability in addressing real challenges. His strongest signal is willingness to surface issues and engage directly with difficult realities. The opportunity ahead is shifting from reactive stabilization to proactive leadership—clearly defining owned initiatives, driving repeatable improvements, and sharpening outcome-based storytelling. With a full year ahead, expectations will rise, and Patrick has a clear path to strengthening his impact."
          },
          "totalScore": 24.0
        }
      ]
    },
    {
      "accountDirector": "Aaron Simpson",
      "account": "Mars/3M",
      "vertical": "Manufacturing",
      "tier": "Tier 5",
      "reviewCount": 2,
      "avgScores": {
        "Key Projects & Initiatives": 3.5,
        "Value Adds & Cost Avoidance": 3.5,
        "Cost Savings Delivered": 2.5,
        "Innovation & Continuous Improvement": 2.5,
        "Issues, Challenges & Accountability": 4.0,
        "2026 Forward Strategy & Vision": 4.0,
        "Personal Goals & Role Maturity": 3.5,
        "Executive Presence & Presentation Skills": 4.0
      },
      "avgTotalScore": 27.5,
      "reviews": [
        {
          "accountDirector": "Aaron Simpson",
          "account": "Mars/3M",
          "reviewerName": "Nick Viskovich",
          "reviewerEmail": "nviskovich@sbmcorp.com",
          "scores": {
            "Key Projects & Initiatives": 3.0,
            "Value Adds & Cost Avoidance": 3.0,
            "Cost Savings Delivered": 3.0,
            "Innovation & Continuous Improvement": 2.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Aaron clearly articulated the operating model and outcomes for the 3M account, with a strong emphasis on stability, safety, and consistency. While there were no major transformational initiatives delivered in 2025, Aaron demonstrated sound judgment in prioritizing operational discipline and reliability given the size and scope of the account. To elevate this section, future reviews should more explicitly frame initiatives as deliberate leadership decisions, including why maintaining a “model site” was strategically important and how that approach could translate into broader client or portfolio impact.",
            "Value Adds & Cost Avoidance": "Aaron effectively highlighted cost avoidance through recordable-free operations, low turnover, and a lean staffing model, all of which contribute to reduced risk and operational noise for the client. The value narrative is directionally strong, particularly around avoided incidents and stability. To strengthen this further, Aaron should more consistently quantify value adds and clearly distinguish between baseline performance and intentional value delivered beyond contract expectations.",
            "Cost Savings Delivered": "Aaron demonstrated an understanding of indirect cost savings through incident avoidance, reduced overtime, and minimized retraining costs. While these savings were not formally tracked or deeply quantified, the rationale was credible and aligned to the operating model. This section would benefit from clearer articulation of how savings are measured, sustained, and repeatable, particularly if the 3M model is intended to be scaled to more complex accounts.",
            "Innovation & Continuous Improvement": "The 3M account was intentionally managed with a “no surprises” mindset, which is appropriate given its scope and revenue profile. However, innovation and continuous improvement were largely framed as maintaining discipline rather than testing or implementing new processes. Looking ahead, Aaron has an opportunity to demonstrate leadership by extracting learnings from this model site and actively applying them to higher-complexity accounts or broader portfolio improvements.",
            "Issues, Challenges & Accountability": "Aaron was transparent in acknowledging the primary limitation of the 3M account: constrained growth and limited opportunity for value expansion. He demonstrated clear ownership of those realities without deflection and showed thoughtful reflection on what the account is and is not designed to deliver. This level of clarity and accountability is a strength and reflects sound leadership maturity.",
            "2026 Forward Strategy & Vision": "Aaron articulated a clear and appropriate forward strategy for 2026, positioning 3M as a benchmark or model account rather than forcing artificial growth. His plan to leverage the account as a governance, safety, and operational playbook for more complex portfolios shows strong judgment. To reach a top score, future plans should include more explicit sequencing and examples of how insights from 3M will be operationalized elsewhere.",
            "Personal Goals & Role Maturity": "Aaron defined clear personal goals tied to account performance, including maintaining zero reportables, improving audit performance, and formally showcasing the account as a best-practice example. These goals demonstrate role maturity, accountability, and a growth mindset. Continued focus on expanding impact beyond individual sites will further strengthen leadership readiness.",
            "Executive Presence & Presentation Skills": "Aaron led the discussion with clarity, confidence, and a structured narrative. He demonstrated strong command of the data and consistently tied operational details back to outcomes that matter to executive stakeholders. With continued refinement around concise storytelling and sharper framing of strategic decisions, Aaron’s executive presence will continue to strengthen."
          },
          "totalScore": 27.0
        },
        {
          "accountDirector": "Aaron Simpson",
          "account": "Mars, Ball, 3M",
          "reviewerName": "nan",
          "reviewerEmail": "anonymous",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 2.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "I appreciated the safety result presented but would have liked to see an example or 2. I thought the conversation across the board around Data integrity was a strong point of the presentation. You clearly identified the issues talked through the response and how you were addressing it head on and showed the results of that work.",
            "Value Adds & Cost Avoidance": "This section was hard to track in 4i during the presentation but was much better supported in the word document. I apricated the numbers associated with each line item to help contextualize the information.",
            "Cost Savings Delivered": "Again, limited ability to show this through 4i I think this is where it would have been helpful to have some preprepared content outside the tool to help better tell the full story.",
            "Innovation & Continuous Improvement": "While opportunities are limited at these accounts I think you could have cast a wider net on exploring what process were implemented. The supplemental word doc helped expand this section, but I think you should have incorporated the RedZone tool into the presentation!",
            "Issues, Challenges & Accountability": "Issues and challenges was another strong section I think you did a good job of not avoiding or sugar coating the problems but staying focused on the solution side of the topic.",
            "2026 Forward Strategy & Vision": "All of the goals were good but there needed to be more discussion around how and by when these were going to be achieved. Supplemental word doc provided additional clarification on timelines and planning.",
            "Personal Goals & Role Maturity": "Same with the account goals. These goals are good but need to be done using the SMART method.",
            "Executive Presence & Presentation Skills": "Doing 3 account in 30 min is a big challenge. I thought you knew the data points you wanted to hit and had a story to accompany it. You have a strong presentation style can smoothly move between topics, sites, and accounts. I think some of the points ended up only being surface level and lacked some additional depth and impact explanation. Some of this was due to time and covering 3 accounts but some of it was just a need to explain the impact of the item."
          },
          "totalScore": 28.0
        }
      ]
    },
    {
      "accountDirector": "Justin Dallavis",
      "account": "Boeing",
      "vertical": "Manufacturing",
      "tier": "",
      "reviewCount": 3,
      "avgScores": {
        "Key Projects & Initiatives": 4.0,
        "Value Adds & Cost Avoidance": 4.0,
        "Cost Savings Delivered": 4.0,
        "Innovation & Continuous Improvement": 3.3333333333333335,
        "Issues, Challenges & Accountability": 4.666666666666667,
        "2026 Forward Strategy & Vision": 3.3333333333333335,
        "Personal Goals & Role Maturity": 3.6666666666666665,
        "Executive Presence & Presentation Skills": 4.333333333333333
      },
      "avgTotalScore": 31.333333333333332,
      "reviews": [
        {
          "accountDirector": "Justin Dallavis",
          "account": "Boeing",
          "reviewerName": "nan",
          "reviewerEmail": "anonymous",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 3.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Although you’re hitting the points required I’m concerned about you reading.",
            "Value Adds & Cost Avoidance": "You’ve shown that you can articulate the value estimate the financial, operational and risk input but again I can totally tell you’re reading and I want you to be able to present to executives at all level based on what you know. In the future have notes not a script. You did well pivoting and answering questions which supports my theory you have all the knowledge needed to deliver a successful presentation!",
            "Cost Savings Delivered": "No feedback provided",
            "Innovation & Continuous Improvement": "Always demonstrate the value. Even if you cannot do tech you can innovate a process and be able to discuss the value.",
            "Issues, Challenges & Accountability": "You provided clear explanation of the challenges and discussed your improvements and some actions. I would like to understand what success looks like and your timelines for correction / resolve. Weekly leadership meetings for alignment are great but more details on the actions taken would be better. Which you answered when asked so good job there!",
            "2026 Forward Strategy & Vision": "Gap in timelines where critical for roll out. Not an actual plan. Reach out Melissa Hampton regarding JLL escalation. The path forward lacked the strategy to achieve the results you want and timelines.",
            "Personal Goals & Role Maturity": "Great results. Like that you used some 4i. Your personal goals felt made up on the fly. Want you to use SMART goals. I would have to have heard the timelines roadmaps and strategy.",
            "Executive Presence & Presentation Skills": "I cannot give you a 5.0 based on reading a script. Overall good presentation well thought out. When communicating why something is good for a customer always think how are we providing value to them and communicate that. I also gave you credit for being able to answer the question off script and really clearly."
          },
          "totalScore": 30.0
        },
        {
          "accountDirector": "Justin Dallavis",
          "account": "Boeing",
          "reviewerName": "nan",
          "reviewerEmail": "anonymous",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 3.0,
            "Issues, Challenges & Accountability": 5.0,
            "2026 Forward Strategy & Vision": 3.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 5.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Great job articulating the 2025 initiatives; however, more desire for client impact.  Why were these initiatives important to the client and what feedback was received?",
            "Value Adds & Cost Avoidance": "Exceptional explanation and itemization of cost savings related items/initiatives; however, lacked that WOW! moment with quantitative value - example: total portfolio cost savings $40k through A,B,C initiatives",
            "Cost Savings Delivered": "Excellent job articulating initiatives and actions; however, lacking that client impact piece and potential mic-drop moment of quantified cost savings dollar i.e. $1M cost savings!",
            "Innovation & Continuous Improvement": "Items in work, but still requiring development.  Strategy, implementation, and due dates still WIP",
            "Issues, Challenges & Accountability": "Proactively owned shortcomings on management issues, even implementing an Internal CAP on Huntsville and OKC.",
            "2026 Forward Strategy & Vision": "Time limited.",
            "Personal Goals & Role Maturity": "Time limited - Clearly communicated measurable, tangible goals and expectations.",
            "Executive Presence & Presentation Skills": "Justin articulates very well and has really immersed himself into an extremely challenging Boeing portfolio.  Clearly demonstrates his knowledge of KPIs, client connection, and Ops, but also has positioned SBM for future growth!"
          },
          "totalScore": 32.0
        },
        {
          "accountDirector": "Justin Dallavis",
          "account": "Boeing",
          "reviewerName": "nan",
          "reviewerEmail": "anonymous",
          "scores": {
            "Key Projects & Initiatives": 4.0,
            "Value Adds & Cost Avoidance": 4.0,
            "Cost Savings Delivered": 4.0,
            "Innovation & Continuous Improvement": 4.0,
            "Issues, Challenges & Accountability": 4.0,
            "2026 Forward Strategy & Vision": 4.0,
            "Personal Goals & Role Maturity": 4.0,
            "Executive Presence & Presentation Skills": 4.0
          },
          "feedback": {
            "Key Projects & Initiatives": "Justin clearly articulated several major 2025 initiatives across the Boeing portfolio, including significant site expansions, onboarding of new facilities, and stabilization of previously underperforming locations. The scope and complexity of these initiatives were evident, particularly in Mascoutah, Huntsville, Fort Walton Beach, and Swansea. Justin demonstrated strong ownership and execution. To reach a 5, future reviews should further tighten the narrative around why each initiative mattered most to Boeing and more explicitly connect each effort to measurable client outcomes.",
            "Value Adds & Cost Avoidance": "Justin presented a strong set of value-add examples delivered beyond contract scope, including absorbed wage increases, expanded floor care, restroom deep cleaning, route restructuring, and in-housing of window washing. These efforts clearly reinforced SBM’s position as a proactive partner rather than a reactive vendor. To strengthen this section further, Justin should consistently translate these initiatives into estimated financial, operational, or risk-based impact to make the value more tangible at an executive level.",
            "Cost Savings Delivered": "Justin effectively highlighted several credible cost savings and cost avoidance measures, including reduced reliance on third-party services, improved labor efficiency through equipment investments, and lifecycle extension of flooring and carpet assets. The examples were concrete and relevant to Boeing’s operating environment. Elevation to a 5 would require clearer quantification and documentation of savings over time and how these practices are sustained and replicated across sites.",
            "Innovation & Continuous Improvement": "Justin demonstrated strong leadership in introducing new tools, equipment, and methods, including Kaivac systems, rideable equipment, in-house window washing, and Whittaker carpet spotters. These initiatives showed a willingness to test, adopt, and scale improvements that directly enhance efficiency and service quality. Continued focus on standardizing these innovations into formal playbooks and measuring outcomes consistently would further elevate this area.",
            "Issues, Challenges & Accountability": "Justin was transparent and accountable in addressing challenges, particularly around leadership transitions and historically underperforming sites such as Huntsville. He clearly owned the turnaround efforts and highlighted the decisive actions taken, including leadership redeployment and internal talent development. This section was a strength. Further improvement would come from outlining clearer timelines and metrics used to determine when a site is fully stabilized.",
            "2026 Forward Strategy & Vision": "Justin articulated a clear forward strategy focused on continued expansion, standardization of successful service models, and deepening trust with Boeing and JLL. The direction is sound and aligned with both retention and growth. To reach an exceptional rating, future articulation should include clearer prioritization, sequencing, and a sharper view of where differentiation will matter most in 2026.",
            "Personal Goals & Role Maturity": "Justin demonstrated strong role maturity, particularly in managing complex portfolios, developing leaders, and making tough operational decisions. His emphasis on proactive service, talent development, and consistency reflects a growth mindset. Making personal development goals more explicit and measurable would further strengthen this section.",
            "Executive Presence & Presentation Skills": "Justin communicated confidently and professionally, demonstrating strong command of both the portfolio and the details behind his initiatives. His storytelling was clear and engaging, though occasionally dense. Continued refinement toward more concise executive-level framing and sharper quantification of impact will further elevate his presence.\n\nJustin delivered a strong 2025 performance across a complex, high-visibility portfolio. His strengths lie in execution, leadership development, and proactive value creation. The opportunity ahead is to sharpen quantification, standardize innovations, and continue elevating executive storytelling. Justin is operating at a high level and is well positioned for continued growth and increased scope."
          },
          "totalScore": 32.0
        }
      ]
    }
  ],
  "rubrics": {
    "Key Projects & Initiatives": {
      "definition": "Evaluates ability to articulate meaningful work and outcomes",
      "criteria": {
        "5": "Clearly frames the most important 2025 initiatives, why they mattered, and what changed for the client as a result; demonstrates strong judgment, prioritization, and impact awareness",
        "4": "Presents a clear narrative of key initiatives and outcomes, with minor gaps in impact clarity or measurement",
        "3": "Accurately describes initiatives but focuses more on execution than client outcomes or strategic impact",
        "2": "Mentions projects but lacks ownership, prioritization, or clarity on why they mattered",
        "1": "Unable to clearly articulate major initiatives or their relevance"
      }
    },
    "Value Adds & Cost Avoidance": {
      "definition": "Evaluates ability to demonstrate value beyond contract scope",
      "criteria": {
        "5": "Clearly articulates value delivered beyond contract scope and translates it into estimated financial, operational, or risk-based impact",
        "4": "Provides strong examples of value creation with partial or directional financial framing",
        "3": "Describes value adds but does not translate them into financial or business impact",
        "2": "Examples are vague or lack clarity on value delivered",
        "1": "No meaningful value creation discussed"
      }
    },
    "Cost Savings Delivered": {
      "definition": "Evaluates financial stewardship and operational efficiency",
      "criteria": {
        "5": "Clearly explains how cost savings were created, quantified, and sustained; demonstrates strong financial stewardship",
        "4": "Identifies cost savings with reasonable clarity and some indication of sustainability",
        "3": "Mentions cost savings but with limited explanation or primarily one-time impact",
        "2": "Savings referenced without clear understanding, ownership, or credibility",
        "1": "No cost savings articulated"
      }
    },
    "Innovation & Continuous Improvement": {
      "definition": "Evaluates leadership in evolving service delivery",
      "criteria": {
        "5": "Demonstrates intentional innovation or meaningful pivots, with clear outcomes and lessons learned",
        "4": "Introduced improvements or adaptations that positively impacted the account",
        "3": "Participated in improvement efforts but with limited leadership or ownership",
        "2": "Discusses ideas or concepts without execution or demonstrated impact",
        "1": "No evidence of innovation or continuous improvement"
      }
    },
    "Issues, Challenges & Accountability": {
      "definition": "Evaluates self-awareness, ownership, and executive leadership",
      "criteria": {
        "5": "Fully transparent about challenges, clearly owns gaps, and outlines specific corrective actions with timelines",
        "4": "Identifies challenges and discusses improvement actions with reasonable clarity",
        "3": "Acknowledges issues but provides limited reflection, ownership, or follow-through",
        "2": "Defensive, vague, or minimizes challenges without accountability",
        "1": "Avoids or fails to address challenges altogether"
      }
    },
    "2026 Forward Strategy & Vision": {
      "definition": "Evaluates strategic thinking and future readiness",
      "criteria": {
        "5": "Articulates a clear, compelling 2026 account roadmap tied to retention, growth, and differentiation, with defined priorities and sequencing",
        "4": "Presents a strong forward-looking plan with reasonable clarity and timelines",
        "3": "Shares general goals or aspirations without clear execution detail",
        "2": "Strategy is reactive, unclear, or lacks cohesion",
        "1": "No meaningful forward strategy articulated"
      }
    },
    "Personal Goals & Role Maturity": {
      "definition": "Evaluates professional growth and role ownership",
      "criteria": {
        "5": "Clearly defines measurable leadership goals that demonstrate role maturity, accountability, and impact on account performance",
        "4": "Establishes thoughtful goals with progress and clearly articulated next steps",
        "3": "Shares general development intentions without clear measures or ownership",
        "2": "Goals are vague, unclear, or not actionable",
        "1": "No articulated leadership or development goals"
      }
    },
    "Executive Presence & Presentation Skills": {
      "definition": "Evaluates effectiveness in delivering the review to executive leadership",
      "criteria": {
        "5": "Leads the discussion with confidence and authority; presents a clear, structured account narrative and responds effectively to executive questions",
        "4": "Communicates clearly with logical flow; delivers a cohesive account story with minor gaps in executive presence or impact",
        "3": "Communicates key points but relies heavily on prepared material; executive presence is limited",
        "2": "Communication lacks clarity or structure; executive presence is inconsistent",
        "1": "Unable to effectively lead the discussion at an executive level"
      }
    }
  },
  "bestPractices": {
    "Benjamin Ehrenberg": [
      {
        "title": "Quantifying Value-Adds Methodology",
        "category": "Financial Strategy",
        "description": "Repeatable framework for tracking gratuitous services with dollar figures (frequent setups, escort avoidance, out-of-scope work)",
        "impact": "Demonstrates true partnership value; provides retention ammunition during renewals",
        "replicability": "High",
        "status": "2026 Development Goal",
        "leadership_endorsement": "Valarie Barnett explicitly challenged implementation"
      }
    ],
    "Mark Schlerf": [
      {
        "title": "Gap Analysis as Strategic Opportunity Framework",
        "category": "Strategic Thinking & Client Relations",
        "description": "Turn CBRE Lam Research gap analysis (potential minefield showing contract vs. actual performance) into strategic investment opportunities by showing 'what is different by location and what the opportunities are' for client to fund improvements",
        "impact": "Converted potential liability into client investment in scope improvements",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich praised strategic approach"
      },
      {
        "title": "JLL Quarterly Operations Reviews Cadence",
        "category": "Governance & Partnership",
        "description": "Structured quarterly review process with IFM partners to align on performance, innovation, and growth",
        "impact": "Strengthened IFM relationships; secured off-market renewals",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich noted as strong governance model"
      }
    ],
    "Grant Frazier": [
      {
        "title": "Luna's Standard Cadence for Transitions",
        "category": "Operational Excellence",
        "description": "Standardized weekly client update process for transitions; drove all standard processes forward systematically",
        "impact": "Stabilized Fremont in 1.5 months, Sunnyvale in 3 months; Grant: 'I wouldn't have done that without Luna's ability to make those standards'",
        "replicability": "Very High",
        "status": "Proven & Scalable",
        "leadership_endorsement": "Grant explicitly credited Luna; Val/Nick praised execution"
      },
      {
        "title": "Sub-Tenant Day Porter Revenue Model",
        "category": "Business Development",
        "description": "Strategic placement of day porters for sub-tenants in property management buildings; positions SBM as exclusive provider",
        "impact": "$34k revenue from 3.5 FTE; client sees consolidation value",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich praised strategic thinking"
      }
    ],
    "Stuart Kelloff": [
      {
        "title": "12-Month Renewal Planning Strategy",
        "category": "Strategic Planning & Account Management",
        "description": "Plan NVIDIA renewal throughout all of 2025 for April 2026 expiration (not just last 3-4 months); consistent implementation of reinvestment practices throughout the year",
        "impact": "Positioned for early renewal in February; mitigated RFP; going on year 9 with SBM (3rd consecutive renewal)",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett praised; Nick Viskovich gave 5/5"
      },
      {
        "title": "Tiered Wage Rate Structure / Frontline Reinvestment",
        "category": "People & Culture + Financial Strategy",
        "description": "Ground-up wage structure from starting to experienced employees; reinvest margin into team vs client cost reduction",
        "impact": "Retention improved; client sees partnership value; positioned for renewal success",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich gave 5/5 for value-add"
      },
      {
        "title": "Weekly Scorecard Reviews with Client",
        "category": "Governance & Transparency",
        "description": "Structured weekly review cadence with NVIDIA/CBRE on performance metrics, safety, quality",
        "impact": "Proactive issue identification; strengthened trust; reduced surprises",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Leadership noted as governance best practice"
      }
    ],
    "Jacqueline Maravilla": [
      {
        "title": "Non-Routine to ATB Budget Conversion",
        "category": "Financial Strategy & Account Management",
        "description": "Identified non-routine work orders consuming SOW headcount; met with customer and got approval to pull non-routine onto above-the-base",
        "impact": "$6k/month sustained additional revenue; freed up SOW headcount for routine work; resolved budget red status",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich praised; Dan Hartman noted financial impact"
      }
    ],
    "Paul Rhodes": [
      {
        "title": "Holistic Account Strategy (Unifying Silos)",
        "category": "Strategic Thinking & Account Management",
        "description": "Unite siloed regional operations (Bay Area vs Americas) into one holistic view; initiatives flow between regions; Seattle POCs had 'no idea' about Bay Area innovations",
        "impact": "Clearer visibility and alignment; smarter decision-making; fewer surprises; Paul acts as communicator between regions (JLL doesn't communicate internally)",
        "replicability": "Very High",
        "status": "2026 Development Initiative",
        "leadership_endorsement": "Paul explicitly called out as intentional strategy; leadership acknowledged gap"
      }
    ],
    "Kimberly Wittekind": [
      {
        "title": "Leadership Addition Without Client Cost",
        "category": "Financial Strategy & Account Management",
        "description": "Added Andrew Daria as project administrator (functions as account manager) by reallocating budget; no additional cost to client",
        "impact": "$120k/year value-add to GE; huge asset for customer relationships and New Orleans transition support",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich praised; Val noted creative constraint management"
      }
    ],
    "Ana Sabater": [
      {
        "title": "Tiered Cost Initiatives (Platinum/Gold/Silver)",
        "category": "Financial Strategy & Client Relations",
        "description": "Delivered detailed cost optimization proposal to CBRE with tiered service models (Platinum, Gold, Silver) showing savings options",
        "impact": "Portable pricing flexibility model; client sees partnership value; positions for renewal",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick/Val praised strategic thinking"
      }
    ],
    "Taylor Wattenberg": [],
    "Jack Thornton": [],
    "Isaac Calderon": [
      {
        "title": "J&J Error Tracker (Log Book Quality Tool)",
        "category": "Innovation & Quality Management",
        "description": "Quality team implemented tracker for log book compliance; targeted corrective actions for misses",
        "impact": "Log books no longer a challenge/target for J&J; quality improvement sustained",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Marvin Owens praised innovation"
      },
      {
        "title": "Cambion Transition Playbook (6-Step Framework)",
        "category": "Transition Management",
        "description": "6-step transition framework: 1) Leadership alignment, 2) Staff retention strategy, 3) Training SOP documentation, 4) Client communication cadence, 5) Quick wins identification, 6) 90-day performance baseline",
        "impact": "Smooth transition; strong client confidence; retained key staff",
        "replicability": "Very High",
        "status": "Proven & Scalable",
        "leadership_endorsement": "Marvin Owens noted strong execution"
      }
    ],
    "Patrick Murtha": [
      {
        "title": "Subcontractor Portfolio Optimization",
        "category": "Financial Strategy & Operational Excellence",
        "description": "Systematic review of Cardinal Health subcontracted sites driving $5k/month red; pricing exercises with multiple contractors; negotiated 5% savings with current providers; switched Tolson AZ provider for 47% savings ($3,400 to $1,810)",
        "impact": "Cardinal portfolio moved from red to green; systematic approach to margin recovery",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Zach Shock praised; systematic methodology"
      },
      {
        "title": "IQVIA Marietta Operational Reset Framework",
        "category": "Operational Excellence & Turnaround",
        "description": "On-site visit to develop routes for AM/PM shifts; created task checklists; established bi-weekly meetings with CBRE and POC; developed action plan (area mgmt on-site for events, phone calls vs email, increased communication)",
        "impact": "POC feedback: 'No issues, things are great'; strong relationship with new area manager",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett acknowledged transparency; Zach Shock praised execution"
      },
      {
        "title": "Cardinal Greenwood Crisis-to-Opportunity",
        "category": "Strategic Partnership & Account Growth",
        "description": "Failed CSAT recovery: identified misalignment between Cardinal and JLL (new business unit, increased headcount); meeting with JLL corporate/regional; site walk with both POCs; updated scope; wage pass-through ($2/hr, 5th to 26th percentile); $7,034/month revenue increase",
        "impact": "Closed gap between JLL and Cardinal; positioned SBM as problem-solver",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Zach Shock gave 5/5 for transparency and execution"
      }
    ],
    "Aaron Simpson": [
      {
        "title": "4insite Live Presentation Model",
        "category": "Innovation & Executive Presence",
        "description": "Aaron presented entirely from 4insite dashboards (no PowerPoint); 'How we actually speak to our customers, what they're seeing and looking at'",
        "impact": "Val: 'I haven't seen anyone perform their review this way... this is exactly the way I would have done it. This is a best practice and an example.'",
        "replicability": "Very High",
        "status": "Proven & Scalable",
        "leadership_endorsement": "Valarie Barnett explicitly called out as best practice"
      },
      {
        "title": "Lean Right-Sized Staffing (3M Model)",
        "category": "Financial Strategy & Workforce Optimization",
        "description": "1 turnover in 2025, 0 after January; low touch, high reliability; no dependency on leadership; 399 days recordable-free; 4.5 internal score; zero failed audits",
        "impact": "Low noise, high margin, high satisfaction; Aaron wants to use 3M as governance benchmark",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Nick Viskovich praised as benchmark model"
      },
      {
        "title": "Data Transparency Reset / Bi-Weekly RFM Reviews",
        "category": "Governance & Process Improvement",
        "description": "Bi-weekly scorecard reviews with RFMs (not just area managers); Aaron now directly captures RFM feedback vs waiting for local leaders to input; addresses complaint logging transparency (Ball: only 14 complaints in 7 months)",
        "impact": "Val: 'Almost like a reset... different level of transparency... really helpful for CBRE'",
        "replicability": "Very High",
        "status": "Active (2026)",
        "leadership_endorsement": "Valarie Barnett noted as helpful for CBRE partnership"
      },
      {
        "title": "Headcount-to-Outcomes Pivot Strategy",
        "category": "Strategic Thinking & Client Relations",
        "description": "Use model sites (Lebanon TN, Cleveland TN, Leipzig OH) to show outcomes achieved without headcount increases; embed local supervisors with Mars sanitation leads (not just CBRE as middleman); reframe from 'position-driven' to 'outcome-driven'",
        "impact": "Changes client success metrics; reduces margin pressure",
        "replicability": "High",
        "status": "Active (2026)",
        "leadership_endorsement": "Valarie Barnett acknowledged strategic reframing"
      }
    ],
    "Brian Davis": [
      {
        "title": "Cross-Portfolio Expert Leverage Model",
        "category": "Strategic Thinking & Resource Optimization",
        "description": "Leverage dedicated resources across Merck portfolio (CBRE, Sodexo, Direct); pull in experts from one account to support another (e.g., Justin from CBRE as pest control expert for Direct sites)",
        "impact": "Scale of account supports problem-solving without additional cost; 'We've got the whole team'",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Marvin Owens noted strategic advantage of portfolio structure"
      },
      {
        "title": "End-of-Year Shutdown Coordination Using Gantt Charts",
        "category": "Operational Excellence & Client Relations",
        "description": "Carlos Estrada led year-end shutdown coordination process using Gantt charts to eliminate friction between multiple service providers (SBM, hard services, Sodexo, Mentor)",
        "impact": "Became top priority deliverable for POC; eliminated past friction; 'real value add for the client'",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Client effusive about response; no extra cost, not in scope"
      },
      {
        "title": "Mouse Problem Engineering Solution",
        "category": "Innovation & Problem Solving",
        "description": "Identified building columns as 'mouse highways'; coordinated with Sodexo, Mentor, and engineers to create permanent access panels for pest control; escalated to president of pest control company",
        "impact": "Solved long-term Boston mouse problem; Michael Gardner's boss tells stories about mice; 'No idea is too big'",
        "replicability": "Medium",
        "status": "Proven & Active",
        "leadership_endorsement": "Augustine Sanchez: 'Try anything. No idea is too big.'"
      },
      {
        "title": "Leading Merck IFM Workplace Experience Community of Practice",
        "category": "Strategic Partnership & Thought Leadership",
        "description": "Took over workplace experience community of practice; presented final survey results to Merck leadership; collaborated with CBRE and Sodexo on contractual protections (e.g., scoring methodology)",
        "impact": "Positioned SBM as IFM thought leader; forced collaboration across IFMs; increased visibility to executive leadership",
        "replicability": "Medium",
        "status": "Proven & Active",
        "leadership_endorsement": "Marvin Owens handed off to Brian; executive-level visibility"
      },
      {
        "title": "Crisis Bypass Direct to SBM (Client Trust)",
        "category": "Client Relations & Partnership",
        "description": "When Sodexo ignored Dave's advice on Orlando animal science and created major blow-up, Merck executive leadership (Michael Gardner, Sharon Rose) bypassed Sodexo and came directly to SBM/Marvin to fix",
        "impact": "Demonstrates trust level; 'When it came to a crisis, he was much more willing to come to SBM directly than to count on Sodexo'",
        "replicability": "Low (relationship-driven)",
        "status": "Proven & Active",
        "leadership_endorsement": "Marvin Owens noted as strategic relationship indicator"
      },
      {
        "title": "MYO (Multi-Year Optimization) Custodial SLA Leadership",
        "category": "Strategic Planning & Thought Leadership",
        "description": "Leading custodial SLA optimization for Merck's $3B savings initiative (patent cliff); using education sector 4-level service model; Merck already positioning SBM to lead",
        "impact": "Positions SBM as optimization leader across all IFMs; 'If we're looking at optimizing custodial, it's SBM'",
        "replicability": "Medium",
        "status": "Active (2026)",
        "leadership_endorsement": "Michael Gardner, Pierre Leo positioning SBM to lead"
      },
      {
        "title": "Security Optimization (Securitas) Risk Management",
        "category": "Financial Strategy & Vendor Management",
        "description": "Led Securitas optimization at Boston and South San Francisco; worked with global security organization on risk management; achieved $680K savings (target was $275K)",
        "impact": "247% of target; carryover sets up 2026 success; avoids contractual dollar-for-dollar penalty",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Contractual success; Valarie Barnett noted strong performance"
      },
      {
        "title": "Information Management & SharePoint Continuity",
        "category": "Process Improvement & Risk Management",
        "description": "Established SharePoint processes so critical documents (savings trackers, etc.) are accessible to whole team, not dependent on single person; mitigates unexpected personnel changes",
        "impact": "Reduces single points of failure; enables team continuity; 'Are we prepared for unexpected changes?'",
        "replicability": "Very High",
        "status": "In Progress (2026)",
        "leadership_endorsement": "Valarie Barnett emphasized importance of succession planning"
      }
    ],
    "Justin Homa": [
      {
        "title": "Lab Cleaning Optimization Through Time Studies",
        "category": "Financial Strategy & Operational Excellence",
        "description": "Conducted detailed time study including cleaning times AND travel times across 60 buildings covering 154 labs; reduced lab cleaning frequency from weekly to bi-weekly",
        "impact": "$190k/year savings (2.8%) + avoided $44k in new construction labor costs; CBRE's 'huge success story for savings for 2025'",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett praised; CBRE leadership highlighted as success story"
      },
      {
        "title": "Colo Dispenser Program for Waste Reduction",
        "category": "Innovation & Sustainability",
        "description": "Installed Colo dispensers at non-production sites; set progressive goals (13% → 10% → 8% → 5%); monthly meetings with Colo team to review dashboard data",
        "impact": "Reduced consumable waste from 33% to under 5%; CBRE funded $100k+ equipment investment",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett: 'Extra credit in 2026 if you put together a white paper on this'; Praised like John Mann's white paper success"
      },
      {
        "title": "ForSight Asset Management Program Integration",
        "category": "Technology & Process Improvement",
        "description": "Streamlined multiple paper programs (equipment inspections, JSAs for safety hazards) into ForSight asset management; testing Jan 2026, full rollout Feb 2026 across ALL sites",
        "impact": "Eliminated paper documents; centralized safety compliance; consolidates multiple programs into one SBM platform",
        "replicability": "Very High",
        "status": "In Rollout (2026)",
        "leadership_endorsement": "Leadership noted as tech adoption best practice"
      },
      {
        "title": "Service Validation with Photo Upload",
        "category": "Technology & Quality Management",
        "description": "New service validation where associates scan QR codes, take photos, and upload work documentation; deployed at Springhouse site for full year",
        "impact": "Centralized documentation for non-GMP lab cleanings; self-auditing culture; usable data for client",
        "replicability": "Very High",
        "status": "Proven & Expanding",
        "leadership_endorsement": "Valarie Barnett encouraged expansion to controlled cleaning environments"
      },
      {
        "title": "QR Code Material Tracking System",
        "category": "Innovation & Cost Management",
        "description": "Track consumables via QR codes using Smartsheet; tracks materials by janitor closet, employee, and supervisor; re-establishing in 2026 after CBRE took consumables",
        "impact": "Previously cut base supply usage significantly; consolidates material usage; data-driven optimization",
        "replicability": "Very High",
        "status": "Re-Establishing (2026)",
        "leadership_endorsement": "Valarie Barnett wants more depth on execution strategy"
      },
      {
        "title": "Always Audit-Ready Culture",
        "category": "Operational Excellence & Compliance",
        "description": "Zero observations/findings across ALL SBM managed services (janitorial, pest control, uniforms, waste) in all internal and external agency audits; continuous audit readiness vs. cramming",
        "impact": "Zero findings in 2024 AND 2025; 'A lot of praise from Merck and CBRE as a partner'",
        "replicability": "High",
        "status": "Proven & Sustained",
        "leadership_endorsement": "Merck and CBRE partnership praise; sets industry standard"
      }
    ],
    "Justin Dallavis": [
      {
        "title": "Cafe Services Billing Model Optimization",
        "category": "Financial Strategy & Service Delivery",
        "description": "Rolled cafe cleaning services into monthly billing instead of ATB rates at Mesa and Everett; improving outcomes and reducing costs; expanding model to Huntsville in 2026",
        "impact": "Cost reduction for client; predictable billing; improved service consistency",
        "replicability": "Very High",
        "status": "Proven & Expanding",
        "leadership_endorsement": "Client praised operational improvement and cost management"
      },
      {
        "title": "Over-Hiring Strategy for Market Stabilization",
        "category": "People & Culture + Operational Excellence",
        "description": "Implemented over-hiring strategy to stabilize turnover in difficult markets (Huntsville, OKC); 'In hindsight we would have implemented this strategy sooner'",
        "impact": "Stabilized both markets; stronger leadership; stronger staff; 'we have learned from our mistakes'",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett noted proactive approach to staffing challenges"
      },
      {
        "title": "Angel's Huntsville Turnaround (Leadership Volunteerism)",
        "category": "People & Culture + Turnaround Management",
        "description": "Angel (Chicago SM) volunteered to move to Huntsville for turnaround; 'knew exactly what he was walking into'; failing CSATs/audits to perfect CSAT scores; identified successor (Robert Brimmer, 30yr Chicago lead) before leaving",
        "impact": "'Complete transformation'; JLL: 'They no longer have any janitorial concerns'",
        "replicability": "Medium (requires right talent)",
        "status": "Proven & Active",
        "leadership_endorsement": "Client effusive about transformation; leadership praised Angel's commitment"
      },
      {
        "title": "Self-Imposed 90-Day CAP Process",
        "category": "Governance & Process Improvement",
        "description": "Justin put Huntsville and OKC on internal 90-day CAP with specific actions: communication improvement (to leadership, safety, HR), route rebuilding, ForSight reporting accuracy; 'I want you to over-communicate with HR'",
        "impact": "Proactive accountability; sites corrected but staying on watch list; weekly meetings with Justin",
        "replicability": "Very High",
        "status": "Active (2026)",
        "leadership_endorsement": "Valarie Barnett praised proactive approach; 'encourage your team to be transparent'"
      },
      {
        "title": "Equipment Investment for Time Efficiency",
        "category": "Innovation & Operational Excellence",
        "description": "Kaivax (all-in-one restroom cleaner: power washer, chemical spray, toilet brush, shop vac, floor scrub in one); Viper riding scrubbers; Tenant ride-on vacuums; Whittaker carpet spotters (crystallization, no extraction/blowers needed)",
        "impact": "Cut cleaning times in half; extended carpet life; created capacity for additional routes (e.g., OKC daytime recycle tech at no cost); ~$6K savings per window clean",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "James Peate noted when asked to quantify value"
      },
      {
        "title": "ForSight Compliance Tracking System",
        "category": "Technology & Quality Management",
        "description": "Implemented compliance tracking system and weekly coaching sessions with teams to drive ForSight adoption; significantly improved usage and data quality",
        "impact": "1875 audits completed in 2025; 4.5 average score; 99% on-time response, 99% on-time closure, 100% satisfaction, 100% invoice accuracy",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett: 'I'm comfortable with your ForSight skills'; James Peate praised diligence"
      },
      {
        "title": "Fort Walton Beach Rapid Launch Excellence",
        "category": "Transition Management",
        "description": "Successfully launched Fort Walton Beach with very short turnaround between award and start; quickly stabilized operations; 'now performing at an exceptional level and far exceeding the quality previously achieved through self-performed cleaning'",
        "impact": "Quality far exceeds previous self-performed baseline; rapid client confidence",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Client recognized exceptional quality improvement"
      },
      {
        "title": "Window Washing In-House",
        "category": "Financial Strategy & Service Expansion",
        "description": "Brought window washing in-house at Daytona, Everett, and Mascouda",
        "impact": "Saving Boeing ~$6,000 per clean",
        "replicability": "High",
        "status": "Proven & Active",
        "leadership_endorsement": "Cost savings validated by leadership"
      },
      {
        "title": "Audit Frequency Increase for At-Risk Sites",
        "category": "Quality Management & Risk Mitigation",
        "description": "Increased audit expectations and frequency at Huntsville and OKC above other sites; 'They need to know where their weaknesses are more so than anybody else'",
        "impact": "Faster identification of issues; targeted improvement; sites moved from failing to passing",
        "replicability": "Very High",
        "status": "Proven & Active",
        "leadership_endorsement": "Valarie Barnett noted proactive quality management"
      }
    ],
    "Peggy Shum": []
  }
}