{
  "Jacqueline Maravilla": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Develop Growth Strategy for New Alonza Sites",
      "quote": "Path forward grow opportunities for 2026 for Vacaville. JLL has let me know that they are expanding.",
      "action": "Create growth plan for Vacaville expansion and 4 new Alonza accounts; document retention strategy",
      "source": "Transcript"
    }
  ],
  "Peggy Shum": [],
  "Kimberly Wittekind": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Kyle Wallace",
      "title": "Define Action Plan for Data Integrity Goals",
      "quote": "Additional understanding desired for how we plan to achieve goals - actionable, measurable, and tangible plan.",
      "action": "Create specific action plan with milestones for 4insite data cleanup and expectation realignment",
      "source": "Transcript"
    }
  ],
  "Paul Rhodes": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Melissa Hampton",
      "title": "Define Value Creation Strategy with Specifics",
      "quote": "How do you plan to increase engagement? What will you do with the account clarity? How will you create value?",
      "action": "Develop specific action plans with timelines for engagement, clarity, and value creation initiatives",
      "source": "Transcript"
    },
    {
      "category": "Key Projects & Initiatives",
      "reviewer": "Yousef Abbasi",
      "title": "Articulate Client Perspective on Projects",
      "quote": "I'd like deeper insight into the client's perspective and how these projects have influenced overall performance and strengthened/impacted the partnership.",
      "action": "Gather and document client feedback on project impact; incorporate client voice into future presentations",
      "source": "Transcript"
    }
  ],
  "Mark Schlerf": [
    {
      "category": "Strategic Planning",
      "reviewer": "Ryan Blackwood",
      "title": "Define Actual Plan for LAM Transition",
      "quote": "I would have liked to have seen your actual plan around LAM transition and increase. How will you use the dollars? What's the schedule and rollout for that increase?",
      "action": "Develop detailed LAM transition roadmap with budget allocation, timeline, and rollout schedule",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Ryan Blackwood",
      "title": "Articulate Personal AD Role Goals",
      "quote": "I would have liked to have understood your goals you have for yourself that aligns to the AD role.",
      "action": "Define measurable personal development goals specific to Account Director leadership growth",
      "source": "Transcript"
    }
  ],
  "Ana Sabater": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Shane Follmann",
      "title": "Add Personal Career Growth Goal",
      "quote": "I would have appreciated hearing about something you wanted to work on for your own career growth.",
      "action": "Identify one personal skill or capability to develop beyond account-level objectives",
      "source": "Transcript"
    }
  ],
  "Patrick Murtha": [
    {
      "category": "Leadership & Communication",
      "reviewer": "Valarie Barnett",
      "title": "Don't Sit on Problems - Proactively Ask for Help",
      "quote": "I challenge you to, even if you can't solve it, you're saying I need help with this... Everybody's too busy. Like, no, we we want to solve the problems because if you don't solve it, then it becomes our problem anyway.",
      "action": "Develop escalation plan for CW communication gaps; proactively engage Mike Jedan and Marvin for support on relationship challenges",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to 2026 Goals",
      "quote": "Any goal without a date attached to it is a wish... when will you have all of these things done?",
      "action": "Assign specific completion dates to all 2026 goals (Cardinal retention strategy, IQVIA CSAT improvement, McKesson contract alignment)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Specific Actions for Goals (Not Just Wishes)",
      "quote": "What are you hoping to achieve under it? Yes, we want an agreed contract, but the deliverables are to them... what are the issues and the root causes?",
      "action": "Define specific actions, root causes, and success metrics for each 2026 goal (KPI alignment, governance expectations, technology roadmap)",
      "source": "Transcript"
    }
  ],
  "Aaron Simpson": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Nicole Ouimet",
      "title": "Define 3M Growth Strategy to Compete with Compass",
      "quote": "How do those things differentiate from what Compass is delivering today to gain momentum, to gain the growth of three M? ... I think the the goal that you should be looking at is how do, how do we get them [the full portfolio]?",
      "action": "Develop specific initiatives with deliverables and dates to differentiate from Compass and win full 3M portfolio; focus on sustainable growth vs ATB",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to ALL Goals",
      "quote": "A goal without a date is a wish... By what day will you have executed your first cross portfolio sync? By what day will you have for insight where you can 100% rely on the data?",
      "action": "Assign specific dates to all 2026 goals (cross-portfolio sync, ForSight data integrity, Mars heat map implementation)",
      "source": "Transcript"
    },
    {
      "category": "Operational Excellence",
      "reviewer": "Valarie Barnett",
      "title": "Challenge Team on Data Transparency (No Osmosis)",
      "quote": "I challenge you to... Tell the regional team nobody's getting in trouble for the failures or the misses. We just want to capture all of the information accurately.",
      "action": "Implement data transparency reset with regional teams; create safe environment for honest reporting; validate ForSight accuracy",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Implement Mars Heat Map with Timeline",
      "quote": "Figuring out... we can be more proactive instead of reactive... I think you'll be able to solve for that [with heat map].",
      "action": "Create Mars portfolio heat map combining audits, complaints, and staff status; define rollout timeline and proactive intervention triggers",
      "source": "Transcript"
    }
  ],
  "Taylor Wattenberg": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Relationship Strategy",
      "quote": "Being a trusted provider, an expert, a point of authority for sustainability is important. Also important is relationship strategy - how are you connecting and with whom?",
      "action": "Map key stakeholders and define engagement strategy with specific touchpoints and objectives",
      "source": "Transcript"
    }
  ],
  "Jack Thornton": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Account Elevation Plan with Timelines",
      "quote": "I'd like to hear how the account will be elevated. More planned initiatives with timelines. Who are you mentoring?",
      "action": "Create 2026 account elevation roadmap with specific initiatives, dates, and mentorship plan",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Shane Follmann",
      "title": "Add Personal Skills Development Goals with Timeline",
      "quote": "I agree with all of the goals presented but they need some more explanation on what you were going to implement to achieve them and when.",
      "action": "Define how goals will be achieved with specific actions and target dates",
      "source": "Transcript"
    }
  ],
  "Brian Davis": [
    {
      "category": "Storytelling & Presentation",
      "reviewer": "Valarie Barnett & Dan Hartman",
      "title": "Transform Data Dump to Compelling Story with Passion",
      "quote": "Valarie: 'I felt like there was missed opportunity to tell your story in way supported by customer that differentiates us from everybody else. You have amazing story to tell. It just doesn't come across that way where it's kind of like a data dump instead of like, look at all these amazing things we've done for you, Merck. I almost felt like you were just giving me data dump, dump, dump as if somebody else told you information and you gave it back to me. Less than being involved and part of story and having that passion for it.' Dan: 'Merck is our largest dollar amount contract in life sciences, extremely complex. I was hoping I would come away feeling like I know a lot more. What you presented was lacking informing somebody who doesn't know complexities and value we bring. There's something missing.'",
      "action": "Storytelling transformation for 2026: (1) Structure as narrative: Merck presented these challenges → here's how we overcame them → this is what we were able to do for you, (2) Add passion and personal ownership vs reciting inherited facts, (3) Explain complexities in way that engages people who don't know details, (4) Differentiate SBM from Sodexo/CBRE through story, not just data, (5) Practice: this was practice run for how you'd present to Merck executives, (6) Show involvement and investment in story, not third-party reporting",
      "source": "Transcript"
    },
    {
      "category": "Timelines & Accountability",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to ALL 2026 Strategy Items",
      "quote": "From timing perspective on your issues and challenges, do you know when you will have any of these things completed by or a road map to get them done? If you don't have strategic plans with dates, you are not going to be able to get things done. Hold yourself accountable, hold your team accountable. You got to have the dates. Adding dates - I would like to have seen a little bit more depth in timeline.",
      "action": "Add specific dates/timelines to all 2026 initiatives: (1) MYO process - June 2026 decision already stated, add Q1-Q2 milestone checkpoints, (2) Succession planning completion date, (3) Asset management pilot - Q3 2026 stated for CBRE lessons learned, when for direct sites?, (4) Leadership development milestones, (5) Vendor management SLA completion - Q1 2026 stated for remaining waste contracts, (6) Q1/Q2/Q3/Q4 breakdowns for all major initiatives",
      "source": "Transcript"
    },
    {
      "category": "Succession Planning - URGENT",
      "reviewer": "Brian Davis (Self-Identified)",
      "title": "Complete Succession Plans for All Key Roles (Cambridge, South SF, Boston)",
      "quote": "Focus on leadership development. We've had some key changes both within direct sites and across portfolio. At Cambridge changed out - I lost critical lab leader, but we're able to replace with someone on site. But what that took away is that change our succession plan for our site leader Griselda if she were to change. Also changed site manager at South San Francisco, but it also identified that we did not have right succession plans. While we had other leaders on site, we did not really have a plan to replace that person even for short time.",
      "action": "Succession planning completion: (1) Cambridge - develop succession plan for Griselda (site leader) after losing lab leader backup, (2) South San Francisco - create succession plan for new site manager position, (3) Boston - assess succession depth, (4) Identify single points of failure across all direct sites, (5) Develop 'ready now' and 'ready in 6-12 months' candidates for each critical role, (6) Set completion date (Valarie: 'You'll have that completed by what day?'), (7) This also impacts portfolio-wide: 'We've got more capability to lead with Merck and these IFM programs if we free up or provide some more bandwidth within our leaders who frankly sometimes doing more of site manager's role than they should be.'",
      "source": "Transcript"
    },
    {
      "category": "Leadership Development - #2 Person",
      "reviewer": "Valarie Barnett",
      "title": "Develop Strong #2 to Free Up Strategic Bandwidth",
      "quote": "Valarie: 'Who's your #2, Mike?' Brian: 'That's a great segue into my looking forward - develop strong #2 to support some of my current responsibilities. That would create ability for me to expand my scope and take on some additional strategic items.'",
      "action": "Number 2 development: (1) Identify candidate who can take over day-to-day operational management across direct sites, (2) Free up Brian's bandwidth for: MYO leadership, strategic IFM positioning, growth opportunities (Elkton GMP, West Point GMP), cross-vendor coordination, (3) Timeline: when will #2 be identified? When operational? What specific responsibilities transfer?, (4) Brian's vision: expand scope to additional strategic items beyond current portfolio management",
      "source": "Transcript"
    },
    {
      "category": "Vendor Management SLAs",
      "reviewer": "Brian Davis (Self-Identified)",
      "title": "Complete Remaining Service Agreements by Q1 2026 (Focus: Waste Contracts)",
      "quote": "For pest control and vendor management, getting remaining service agreements is highlight here. Focus is to have that complete by end of this first quarter. The last remaining are waste contracts which have been most challenging as far as scope identifying that because they're bespoke at each one of sites.",
      "action": "Q1 2026 vendor SLA completion: (1) Complete remaining waste contracts - most challenging due to bespoke scope at each site, (2) Ensure contracts and SLAs in place to effectively manage suppliers, (3) Create contingency suppliers especially for gases - 'We've had challenges in past where our single suppliers cannot meet demand for something like medical grade oxygen and we've had to scramble to get that additional,' (4) Process improvement with account team and procurement to address service concerns, (5) Create redundancy and resiliency within supplier process; vendor management (pest control, gases, security) dominates site conversation as 'their top risks'",
      "source": "Transcript"
    },
    {
      "category": "Asset Management Pilot",
      "reviewer": "Valarie Barnett",
      "title": "Complete Asset Management Pilot Rollout by Q3 2026",
      "quote": "Asset management? When will you roll out that pilot 2026? Is it Q1? You're going to do what? Q2, you're going to do what? Brian: 'We're piloting that in CBRE account now. Targeting that for third quarter in 2026 and that's based on completing it and taking lessons learned out of CBRE accounts.'",
      "action": "Asset management rollout: (1) Q1-Q2: Complete CBRE pilot and capture lessons learned, (2) Q3 2026: Roll out to direct sites based on CBRE learnings, (3) Document: what worked, what didn't, implementation process, change management approach, (4) Train teams on ForSight asset management features, (5) Measure: asset tracking accuracy, maintenance optimization, cost impact",
      "source": "Transcript"
    },
    {
      "category": "Value-Add Quantification",
      "reviewer": "Brian Davis (Self-Identified)",
      "title": "Put Dollar Amounts Against Extra Cleaning Services",
      "quote": "There is some stuff that we and I we probably need. We focus on doing better job of actually putting dollar amount against it such as extra cleaning of coffee stations in Cambridge and also tables and water. We do events, we've been doing that and I think we can capture that and look for more opportunity in future to identify those amounts and possibly bring them in scope.",
      "action": "Quantify value-adds: (1) Extra coffee station cleaning at Cambridge, (2) Tables and water areas, (3) Event support across portfolio, (4) Other above-scope activities currently being absorbed, (5) Create tracking system similar to what Valarie recommended to other ADs, (6) Use quantified value to: demonstrate partnership, support retention conversations, potentially bring into contracted scope for revenue growth",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals - Reply to Invite",
      "reviewer": "Valarie Barnett",
      "title": "Submit SMART Personal Goals via Email to Avoid Zero Score",
      "quote": "I don't want to give you zero on your personal goals. Right now you're scoring so high that I feel like I'll wait. We want to be able to give you points. Reply to the invite with your goals that would be most helpful.",
      "action": "URGENT: Submit SMART personal goals via email reply: (1) Tie personal goals to 2026 forward strategy and Q1/Q2 initiatives, (2) Specific, Measurable, Achievable, Relevant, Time-bound format, (3) Examples: 96% Merck scorecard by Q4 ($30K profit fee), #2 person developed by Q2, MYO custodial SLA leadership delivered by June, succession plans complete by Q2, ForSight asset management rolled out by Q3, (4) Marvin referenced these would be performance review metrics",
      "source": "Transcript"
    },
    {
      "category": "MYO Risk Assessment",
      "reviewer": "Valarie Barnett",
      "title": "Document Risks of 15% Multi-Year Optimization Implementation",
      "quote": "This is an automatic win from portfolio requirements, however it still has to be executed so good work. I would like to understand the risks here more. Because this isn't self initiated, what risks are there when implementing all of this savings?",
      "action": "MYO risk documentation: (1) Brian showed worst-case scenario chart of cost impact if 15% reduction fully implemented, (2) Document specific risks: service quality degradation, employee morale, safety impacts, customer satisfaction decline, competitive vulnerability, (3) Mitigation strategies for each risk, (4) Phased approach vs big bang implementation, (5) How will SBM protect margins while delivering 15% customer savings?, (6) What's negotiable vs non-negotiable in SLA changes?, (7) Timeline: data calls done pre-Christmas 2025, decision June 2026, enacting late 2026 or 2027 budget",
      "source": "Transcript"
    },
    {
      "category": "Communication & Depth",
      "reviewer": "Valarie Barnett",
      "title": "Add More Depth to Client Impact and Why Initiatives Mattered",
      "quote": "Clearly framed the most major projects or initiatives. I would like to have understood the client impacts more. I would like to have seen a little bit more depth in some of the things that you have to do or that you have planned for this year.",
      "action": "Enhanced depth in future presentations: (1) Don't just say what was done - explain why it mattered to Merck specifically, (2) Client impact beyond numbers - how did it make their lives easier? What problems solved? What risks mitigated?, (3) Connect initiatives to Merck's business objectives, not just IFM operational goals, (4) Valarie: 'Much better than last presentation' - continue improving, (5) Practice presenting with deeper context that engages people unfamiliar with account complexity",
      "source": "Transcript"
    }
  ],
  "Isaac Calderon": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Mike Jedan",
      "title": "Define Specific Personal Development Information",
      "quote": "I think you covered some of this during the course of the presentation, however I would like to have heard some specific information about this topic.",
      "action": "Articulate specific personal development objectives with measurable outcomes",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence",
      "reviewer": "Mike Jedan",
      "title": "Attach Ideas to Concrete Examples & Results",
      "quote": "I think attaching those ideas to concrete examples and results would be a next step.",
      "action": "Support strategic ideas with specific account examples and measurable results",
      "source": "Transcript"
    }
  ],
  "Benjamin Ehrenberg": [
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Quantify Value-Adds with Dollar Figures (2026 Challenge)",
      "quote": "I challenge you in 2026 to tabulate the value-add and cost avoidance. Show them what we could have billed them for.",
      "action": "Track quarterly dollar value of gratuitous services (frequent setups, escort avoidance, out-of-scope work)",
      "source": "Transcript"
    },
    {
      "category": "Operational Excellence",
      "reviewer": "James Peate",
      "title": "Establish CSAT Benchmarks & YoY Comparisons",
      "quote": "Do we have a benchmark or target or year-over-year comparisons for the CSAT scores?",
      "action": "Develop baseline CSAT metrics and establish quarterly tracking with year-over-year trend analysis",
      "source": "Transcript"
    }
  ],
  "Stuart Kelloff": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Specific Dates and Actions to 2026 Goals",
      "quote": "Flush this section out a little more on when you want to have it done... Any goal without a date attached to it is a wish.",
      "action": "Assign specific completion dates and milestones to NVIDIA renewal goals, tiered wage structure sustainability, and service validation expansion",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Lean Into Technology Goals for 2026",
      "quote": "One of the specific goals that I don't see... are around technology... lean into the SBM service like our validation verification scans.",
      "action": "Create specific technology adoption goals for NVIDIA (service validation, mobile tools, ForSight capabilities) with rollout timeline",
      "source": "Transcript"
    }
  ],
  "Grant Frazier": [
    {
      "category": "Value-Add & Cost Avoidance",
      "reviewer": "Anonymous Reviewer",
      "title": "Add Quantified Dollars to Value-Adds",
      "quote": "There was quantified dollars to Cost Avoidance but not for the Value adds. Even if the exact dollar amount isn't known or tracked it would have been good to at least get a ball park amount.",
      "action": "Estimate and track dollar values for all value-add activities, even if directional",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Anonymous Reviewer",
      "title": "Add Personal Development Goals",
      "quote": "All of the goals were account focused and it would have been beneficial to hear what you Grant want to be better at or develop for yourself.",
      "action": "Define at least one self-reflective goal focused on personal skill development or growth area",
      "source": "Transcript"
    }
  ],
  "Justin Homa": [
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Send Multi-Year Optimization Plan to Leadership",
      "quote": "Can you send that to me? [15%/9% savings plan]",
      "action": "Forward the mid-December multi-year optimization plan (15% MMD, 9% West) to Valarie for review",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Create Colo White Paper (Extra Credit 2026)",
      "quote": "Extra credit in 2026 if you put together a white paper on this. At the three-month mark, the six-month mark, the nine-month mark, the one-year mark [document lessons learned]",
      "action": "Document Colo implementation lessons learned with ROI data at quarterly milestones; publish white paper for enterprise use",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to ALL 2026 Goals",
      "quote": "A goal without a date is a wish.",
      "action": "Review all 2026 strategic goals and assign specific completion dates and milestone checkpoints",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Flesh Out Consumable Tracking Strategy with Depth",
      "quote": "I would like to see that a little bit more fleshed out. I in concept, obviously I know what you're saying, but I'd like to understand more depth around how you intend to do that. What is your actual strategy there?",
      "action": "Document detailed implementation plan for QR code material tracking system with rollout timeline and KPIs",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define 'Agreed Contract with Clear Deliverables'",
      "quote": "What does that mean? What are you hoping to achieve? [Deliverables are] KPIs and expectations, governance, technology implementation road map and timeline.",
      "action": "Specify exact contract deliverables: KPI alignment, governance structure, technology roadmap with dates",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Add Technology Goals for 2026",
      "quote": "One of the specific goals that I don't see you having you or Brian, actually I don't think are around technology... lean into the SBM service like our validation verification scans.",
      "action": "Create specific 2026 goals for technology adoption (service validation, mobile tools, ForSight capabilities)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Asset Management Rollout Timeline by Location",
      "quote": "Put some deadlines to it... I'd like to understand more depth around... what location is first, second, third?",
      "action": "Create phased rollout plan for ForSight asset management with specific site order and completion dates",
      "source": "Transcript"
    },
    {
      "category": "Financial Impact & ROI",
      "reviewer": "Valarie Barnett",
      "title": "Complete AMR Vacuum ROI Analysis Before Client Proposal",
      "quote": "[You need] ROI # to sell this to people. [February 2026 proposal deadline]",
      "action": "Calculate ROI for AMR vacuum program (comparing 4 Wiz to 2 Tasky/Nilfisk) before February client presentation",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add More Teeth to Goals 6 & 7 for Workday Transfer",
      "quote": "Just flush this out a little bit more, six and seven, just put some more teeth to it... you should be able to transfer these goals right into Workday.",
      "action": "Enhance baseline revenue growth goal and contract deliverables goal with specific metrics, dates, and success criteria",
      "source": "Transcript"
    }
  ],
  "Justin Dallavis": [
    {
      "category": "Financial Impact & ROI",
      "reviewer": "James Peate",
      "title": "Quantify Value-Adds with Dollar Figures in Presentations",
      "quote": "Add in the quantification to the presentations... things like the challenges, corrective actions, what was the impact... the specific actions that were taken... and the improvements made",
      "action": "Add dollar figures and quantified impact to all value-add activities, corrective actions, and innovations in future presentations",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Define Timeline for Reported/Carrigo Integration",
      "quote": "When? [for Carrigo/Reported integration]",
      "action": "Establish specific rollout timeline for Carrigo and Reported integration; clarify dependencies and current status with JLL IT team",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Roll Out AI Verify with Melissa Hampton's Support",
      "quote": "I'm gonna have you reach out to Melissa Hampton... We're past the beginning stages. We're live across multiple sites.",
      "action": "Contact Melissa Hampton to accelerate AI Verify rollout at Saint Louis sites (Swansea, Cortex, O'Fallon) and Mesa; target completion within 3 months",
      "source": "Transcript"
    },
    {
      "category": "Operational Excellence",
      "reviewer": "Valarie Barnett",
      "title": "Validate Data Transparency Directly with Customers",
      "quote": "I challenge you to go directly to your customers and ask them, do they have any more complaints than what we have. What we don't want to ever have happen is for our data integrity to be in [question].",
      "action": "Implement regular validation with JLL/Boeing POCs to ensure ForSight complaint data matches their actual complaint count; address data integrity gaps",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Process Innovation Goal for 2026",
      "quote": "I'm going to challenge you in 2026 on the record. My challenge to you... will be to innovate a process or something that we do on a regular basis that could be being done better for Boeing. And what the value of that? What value creation is there in it?",
      "action": "Identify and implement one major process innovation for Boeing in 2026; document value creation and impact",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add SMART Goals with Dates and Measurement Criteria",
      "quote": "SMART goals... They're measurable. How will we measure success?... Are they time bound? So we're missing time bound and how you'll measure yourself specifically.",
      "action": "Document all 2026 goals with specific dates, milestones, and measurement criteria for Workday system (Saint Louis growth by November, Colorado June/July, $250K/month growth target, 0 recordables, 5.0 CSAT/audit scores)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Success Timeline for CAP Sites (Huntsville/OKC)",
      "quote": "It sounds like they're still on kind of like the issues and challenges tracker... they're kind of on your watch list I guess. What's your timeline to say like these things are corrected?",
      "action": "Document specific criteria and timeline for Huntsville and OKC to move from 'watch list' to 'fully corrected' status; clarify 90-day CAP milestones",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence",
      "reviewer": "Kyle Wallace",
      "title": "Add Mic Drop Moments to Presentations",
      "quote": "I was looking for... your mic drop moment... I know there's a significant amount of dollars that you've saved... you positioned yourself so well for Saint Louis, which has been remarkable by the way. That's a mic drop moment.",
      "action": "Identify and prominently feature major wins and differentiators in presentations (e.g., Saint Louis positioning, cost savings, Fort Walton Beach transformation, Huntsville turnaround)",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Document Path Forward with Specific Timelines",
      "quote": "Clean up goals, add dates/targets/actions for workday system.",
      "action": "Create formal documentation of Saint Louis growth strategy ($250K/month), MIT development program expansion (Mesa, Mascouda), Brian's leadership role transition, and pricing plan collaboration with Strategic Pricing team and Nick Viskovich",
      "source": "Transcript"
    }
  ],
  "Dave Pergola": [
    {
      "category": "Strategic Communication & Partnership",
      "reviewer": "Valarie Barnett",
      "title": "Overcome Client Objection to 4insite GMP Scorecard",
      "quote": "We're not in the business of like blaming the customer. So that sounds like there's an objection that we need to overcome... Your 2026 goal is to provide her with as much information as possible. I see an objection to anything that we do as an opportunity for us to better communicate.",
      "action": "Collaborate with new Sodexo director to overcome objection; provide detailed compliance documentation showing 4insite meets FDA standards (not claiming certification, just compliance); schedule dedicated call to explain scoring methodology",
      "source": "Transcript"
    },
    {
      "category": "Leadership Development & Succession Planning",
      "reviewer": "Valarie Barnett",
      "title": "MIT Program - Mentoring at All Times",
      "quote": "You guys need at a site your size or with this level of complexity, you should always have somebody waiting and ready to go. And so now you're feeling the impacts of what that's like... My another goal for you for 2026 is to be mentoring and training someone at all times.",
      "action": "Implement continuous MIT training; always have successor ready for Site Manager and Area Manager roles; conduct regular one-on-ones and developmental training",
      "source": "Transcript"
    },
    {
      "category": "Contract Management",
      "reviewer": "Marvin Owens",
      "title": "Execute Work Releases (Q1 2026 Priority)",
      "quote": "Part of his goal is to get those work releases executed... that has to be the number one priority... that's got to be a Q1 goal.",
      "action": "Execute site-specific work releases by Q1 2026 with clearly defined terms, expectations, KPIs, SLAs; incorporate $69K/month executive space cleaning into base",
      "source": "Transcript"
    },
    {
      "category": "Strategic Planning & Accountability",
      "reviewer": "Valarie Barnett",
      "title": "Define Measurable 2026 Goals with Tracking Metrics",
      "quote": "Clearly, uh, defined, measurable... We want to be able to, you want to be able to meet with Marvin on your touch bases and go over those things and where you're tracking and progressing in the action items",
      "action": "Develop detailed 2026 goals with action items, timelines, and tracking metrics for quarterly check-ins with Marvin; ensure goals are clearly defined and measurable",
      "source": "Transcript"
    },
    {
      "category": "Financial Planning & Communication",
      "reviewer": "Valarie Barnett",
      "title": "Document MYO Proposal Details",
      "quote": "The one thing that's I think is missing here is just could you do me a favor in that 1.6 million? What are those projects? How will we... What will we do in order to get there? I know cut 22 heads, but from what programs?",
      "action": "Document detailed breakdown: 14 custodial FTEs, 2 lab FTEs + 1 supervisor, vehicle fleet reductions, consumable savings; provide written proposal with program-specific impact analysis",
      "source": "Transcript"
    }
  ],
  "Thomas Mahoney": [
    {
      "category": "Value Adds & Cost Avoidance",
      "reviewer": "Valarie Barnett",
      "title": "Quantify Value Adds with Dollar Figures",
      "quote": "I'm gonna challenge you. I don't see any dollar figures tied to this.",
      "action": "Add specific dollar amounts to all value-add initiatives (day cleaning redesign, water feature improvements, GMP training, site expansions) to demonstrate financial impact",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Personal Goals",
      "reviewer": "Valarie Barnett",
      "title": "Define Measurable Goals with Timelines and Success Metrics",
      "quote": "How will we measure success against your goals? And then can we do that with some timelines? Can you add those things before you send this out?",
      "action": "Document specific timelines for: leveraging Arianna as SME, $2M revenue goal milestones, ANC/AMA transition dates, building expansion schedules; create tracking framework for monthly Dan sync-ups",
      "source": "Transcript"
    },
    {
      "category": "Financial Performance",
      "reviewer": "Valarie Barnett",
      "title": "Budget Performance Goal - Get Account On Budget",
      "quote": "Your goal from a financial perspective for me will be how will you get all this on budget in addition to the savings?",
      "action": "Develop detailed plan to eliminate remaining $34K negative margin and achieve full budget compliance while delivering required $500K annual savings",
      "source": "Transcript"
    },
    {
      "category": "Presentation Structure",
      "reviewer": "Thomas Mahoney (Self-Identified)",
      "title": "Align Presentation to Rubric Categories",
      "quote": "I will adhere to the structure of this type of presentation a little bit more closely next time. That was my biggest takeaway from today.",
      "action": "Restructure future presentations to clearly separate: Key Projects, Value Adds, Cost Savings, Innovation, Challenges, 2026 Strategy, Personal Goals, rather than blending categories",
      "source": "Transcript"
    }
  ],
  "Giselle Langelier": [
    {
      "category": "Value Adds & Financial Tracking",
      "reviewer": "Valarie Barnett",
      "title": "Quantify All Value-Add Services with Dollar Figures",
      "quote": "Just try to track them throughout the year, the occurrence, how much would you charge per occurrence so that at the end of every quarter in your QBR, you can tell them exactly the value add.",
      "action": "Track all event setups, IPA wipe removal, and other value-add services throughout 2026 with occurrence count and market rate pricing; report in quarterly business reviews with total dollar value",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Goals",
      "reviewer": "Valarie Barnett",
      "title": "Define Measurable Goals with Milestones and Tracking",
      "quote": "Which things are you tying to your goals and how will you measure them? Where are your goals with the measurements?",
      "action": "Document specific goals: (1) $40K monthly revenue growth through ATB, (2) expand service lines (coffee/vending, compost program), (3) HEPA vacuum rollout timeline, (4) Colorado sites acquisition; add milestones and monthly tracking for Dan/Josh sync-ups",
      "source": "Transcript"
    },
    {
      "category": "Succession Planning & Development",
      "reviewer": "Valarie Barnett",
      "title": "Develop a Number Two / Successor",
      "quote": "What we're missing from you is developing the next account manager. If you pull somebody under your wing and get them developed up... what does that mean for you? You get to take the next step.",
      "action": "Identify and develop a potential successor/number two for Medtronic account; mentor them, introduce to clients, tag along on site visits; position for promotion when ready to take on additional accounts",
      "source": "Transcript"
    },
    {
      "category": "Financial Planning",
      "reviewer": "Valarie Barnett (Implied)",
      "title": "Monthly Goal Tracking with Dan/Josh",
      "quote": "When you sit down with Dan or Josh or whoever you're reporting into, you want to be able to open up what your 2026 goals are and each month, what action are we taking to get it completed by whatever deadline you set.",
      "action": "Create structured monthly check-in format with reporting manager to review 2026 goals progress, action items completed, next steps, and deadline adherence",
      "source": "Transcript"
    }
  ],
  "Rade Kukobat": [
    {
      "category": "Financial Strategy - Cost Savings vs Avoidance",
      "reviewer": "Valarie Barnett",
      "title": "Develop 2026 Client Cost Savings Initiatives",
      "quote": "2026 goal will be to initiate some cost savings... that's how you differentiate yourself. Because ABM or anybody else would walk in and say they could do your contract for cheaper. You just always want to be in every QBR innovating, bringing a new idea, offering cost savings.",
      "action": "Develop quarterly cost savings proposals for CBRE/Lilly: identify scope reductions, efficiency opportunities, or contract modifications that permanently reduce client billing; present in QBRs and let client say no; proactive vs reactive positioning against competitors",
      "source": "Transcript"
    },
    {
      "category": "Strategic Planning & Goal Tracking",
      "reviewer": "Valarie Barnett",
      "title": "Add Specific Dates to All 2026 Goals",
      "quote": "Put the dates on here and every time you meet in your monthly meeting, where are you to goals 1-2-3? Are you marching there? I want updates when we accomplished each one.",
      "action": "Add completion dates to all 2026 goals (cost effectiveness, client transparency, talent development); track progress in monthly meetings with Melissa/Sean/Chad; report milestone completions as achieved",
      "source": "Transcript"
    },
    {
      "category": "Innovation Roadmap",
      "reviewer": "Valarie Barnett",
      "title": "Create Quarterly Innovation Rollout Plan for 2026",
      "quote": "What you're seeing as innovation is SBM standard and expectations. You've created the baseline. Now in 2026, my challenge to you is to actually get innovative. What is your roadmap to innovation? What are you rolling out each quarter?",
      "action": "Develop 2026 quarterly innovation roadmap beyond operational baseline (Q1: QR supply system, Q2-Q4: TBD); identify emerging tech, sustainability initiatives, automation opportunities; present innovations in QBRs",
      "source": "Transcript"
    },
    {
      "category": "Presentation & Tool Usage",
      "reviewer": "Sean Henderson",
      "title": "Lead with Product - Present Through For Insight Platform",
      "quote": "Lead with product. I would love to see this presentation all done directly out of For Insight through the story of messaging within the tool... as you grow in the organization, that's going to be the expectation.",
      "action": "Future presentations to be delivered directly through For Insight platform (scorecard, analytics, messaging) rather than extracting to PowerPoint; learn click-path and talk track for executive presentations",
      "source": "Transcript"
    },
    {
      "category": "Leadership Development Focus",
      "reviewer": "Sean Henderson",
      "title": "Lean Into Team Building and Process Standards",
      "quote": "Your jobs 1-2-3-4 is holding a standard from a process standpoint and building your team from managers, supervisors. Lean in on who's performing, where's the opportunity, what are you doing to continually build that team?",
      "action": "Focus monthly reviews on: (1) individual manager/supervisor performance assessment, (2) development opportunities identified, (3) coaching/training initiatives in progress, (4) process adherence metrics; showcase team building in future presentations",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunities",
      "reviewer": "Nick Viskovich",
      "title": "Quantify Total Addressable Market and Growth Strategy at Indy",
      "quote": "What's the growth opportunity with Lilly outside of where we're at today? What's the total addressable market as you see it? What are the forward-looking strategies to unlock that?",
      "action": "Work with Melissa to quantify Indy growth opportunities: GMP spaces opening, Event Center (April), total addressable market; develop capture strategy with timelines and revenue projections",
      "source": "Transcript"
    },
    {
      "category": "Audience Awareness",
      "reviewer": "Dan Hartman",
      "title": "Know Your Audience and Tee Up Gaps Proactively",
      "quote": "Knowing the audience of who you're presenting to is key. Even if you don't have a deliverable met, you can lead with that too. 'We focused on quality, getting everything up to par, and now we're going to look at cost savings moving forward.'",
      "action": "In future presentations, proactively acknowledge gaps or unmet deliverables and frame them as 'focused on X in 2025, now pivoting to Y in 2026' to control narrative and demonstrate strategic prioritization",
      "source": "Transcript"
    }
  ],
  "Gregory DeMedio": [
    {
      "category": "Strategic Planning & Goal Setting",
      "reviewer": "Valarie Barnett",
      "title": "Add Specific Dates and Actions to All 2026 Goals",
      "quote": "A goal without a date is just a wish. I see a lot of things that are strategy and ideation. I really would like to see what actions are you going to take and by when so that when you meet with Dan or Marvin you can say I'm holding myself accountable.",
      "action": "Convert all 2026 strategy items into actionable goals with completion dates: (1) Latam key contact meeting - by Q1, (2) High-value QBR revamp - specific date, (3) Succession plan - timeline, (4) All sites periodical calendars - Q2 end, (5) Growth opportunities (Westford, St. Paul) - decision by Feb; track in monthly leadership meetings",
      "source": "Transcript"
    },
    {
      "category": "Client Impact & Value Demonstration",
      "reviewer": "Valarie Barnett",
      "title": "Develop Client-Facing Projects and Initiatives with Measurable Impact",
      "quote": "These are important for us, but I see those as a part of your job. I don't see where at a particular site you had scope impact. What did we do for Abbott last year? I felt like you kind of pulled out some straws in order to fill something up on the page.",
      "action": "2026 goal: identify and execute client-facing initiatives that deliver measurable value Abbott would recognize (not just internal operational improvements); focus on results over activities; differentiate between job expectations and value creation; track impact metrics",
      "source": "Transcript"
    },
    {
      "category": "Presentation & Storytelling",
      "reviewer": "Valarie Barnett",
      "title": "Improve Storytelling with Impact, Dates, and Actions",
      "quote": "In 2026, maybe working on your storytelling. I felt like some of the gaps were the impact, the dates, no actions. I think that also help you with your time management.",
      "action": "Develop narrative structure for future presentations that clearly articulates: (1) What was done (activity), (2) Why it mattered (impact), (3) When it was completed (dates), (4) What client value was created (results); practice storytelling to convey complexity and effort effectively",
      "source": "Transcript"
    },
    {
      "category": "Documentation & Tracking",
      "reviewer": "Valarie Barnett & Tony Garcia (Abbott POC)",
      "title": "Track Accomplishments Throughout Year to 'Brag Better'",
      "quote": "Get better with tracking some of these things. Even Tony said about just tracking and sharing information. You do great things, but when you look back 12 months ago, it's like 'I don't know what I did.' You need to brag on yourself a little.",
      "action": "Implement quarterly or monthly accomplishment tracking system; document client wins, operational improvements, cost savings, relationship milestones as they happen; share with Tony regularly; maintain for year-end review to demonstrate full scope of work and value delivered",
      "source": "Transcript"
    },
    {
      "category": "QBR Enhancement",
      "reviewer": "Gregory DeMedio (Self-Identified) & Nick Viskovich",
      "title": "Revamp QBR to Be High-Value and Expand Audience",
      "quote": "QBR is very stale, just going over data. I do that with Tony almost every week, so it's redundant. Trying to come up with fresh ideas: voice of customer, site spotlights, driving more into value of SBM.",
      "action": "Redesign QBR format to: (1) Highlight SBM GMP capabilities and regulatory audit success, (2) Add site spotlights showcasing specific value, (3) Include voice of customer feedback, (4) Invite site-level executives or broader Abbott audiences, (5) Differentiate SBM vs competitors (what can't ABM do?); work with Tony to expand attendee list",
      "source": "Transcript"
    },
    {
      "category": "Relationship Expansion",
      "reviewer": "Gregory DeMedio (Self-Identified) & Nick Viskovich",
      "title": "Strengthen Relationships Beyond Tony Garcia to Key Stakeholders",
      "quote": "I have a great relationship with Tony, but where's that Latin America key contact or site-level senior executives? Bringing them more to the fold so they can understand the value we bring.",
      "action": "Identify and engage: (1) Latam key decision maker, (2) Site-level senior executives (met a few, expand relationships), (3) Abbott corporate stakeholders beyond procurement; loop them into portfolio conversations, year-end reviews, and value demonstrations",
      "source": "Transcript"
    },
    {
      "category": "Leadership Development & Delegation",
      "reviewer": "Gregory DeMedio (Self-Identified)",
      "title": "Improve Time Management by Delegating and Empowering Managers",
      "quote": "I need to get better with time management, prioritizing, delegating and empowering managers. I get more into the weeds than I probably should instead of delegating. It's my nature, but I need to focus on higher-end things.",
      "action": "Shift from 'in the weeds' to strategic focus: delegate operational tasks to site/area managers; continue weekly training programs for newer managers but empower them to execute; prioritize high-impact activities (senior relationships, growth, innovation); develop succession plan (already in discussion)",
      "source": "Transcript"
    },
    {
      "category": "Account Complexity Communication",
      "reviewer": "Marvin Owens & Dan Hartman",
      "title": "Better Articulate Account Complexity in Presentations",
      "quote": "There is an opportunity for folks on this call to understand the amount of complexity on your account - 26 sites, unique things you have to do. The efforts and how hard you work didn't come across. Complexities should be mentioned in presentations.",
      "action": "In future presentations, explicitly communicate: (1) Managing 26 different site relationships, (2) Annual site-specific contract renewals, (3) Regional/divisional team coordination complexity, (4) Unique Abbott requirements (no formal RFPs, strategic growth only); tell the story of effort and complexity to demonstrate scope of work",
      "source": "Transcript"
    }
  ],
  "Peggy Shum": [
    {
      "category": "Presentation & Communication Skills",
      "reviewer": "Valarie Barnett",
      "title": "Improve Formal Presentation Delivery - Conversational vs Script Reading",
      "quote": "Just talk to us. Don't look at your script. What are you showing me on this slide?",
      "action": "Develop conversational presentation style: (1) Read 'Think Fast and Talk Smart' (Stanford communications professor), (2) Join Toastmasters (local chapter, 3rd Wednesday monthly - starting Feb 2026), (3) Practice with Shane Follmann (offered support), (4) Focus on storytelling vs script reading",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategic Focus",
      "reviewer": "Valarie Barnett",
      "title": "2026: Take It to the Next Level After Stabilization Year",
      "quote": "2025 was the big year of reset, so 2026 should be the big year of take it to the next level.",
      "action": "Shift from defensive stabilization to proactive growth: (1) AI verification pilot (Q1 rollout priority bathrooms), (2) Expand AI to other spaces post-success, (3) Convert 21st floor labor reallocation to permanent scope when floor returns Q3, (4) Drive ATB growth and optimize margins",
      "source": "Transcript"
    },
    {
      "category": "Financial Performance",
      "reviewer": "Peggy Shum (Self-Identified)",
      "title": "Close Financial Gap to Become More Tolerable",
      "quote": "I can't close the financial gap to green, but I want to close the gap to become more tolerable.",
      "action": "Implement payroll by exception (meeting with Val and Janice) to control 8-hour pay without OT overages from late checkout/early check-in on mobile; stabilize ATB and optimize margins through VR labor; continue cost containment discipline",
      "source": "Transcript"
    },
    {
      "category": "Innovation Implementation",
      "reviewer": "Peggy Shum (Self-Identified)",
      "title": "Execute AI Verification Pilot and Expand Post-Success",
      "quote": "I'd like to finally implement the AI verification. Excited to see what other opportunities we have after successful rollout for priority bathrooms, tower usage, and trash volume for trading floors.",
      "action": "Q1 2026: Launch AI verification pilot (24 of 65 restrooms/locker rooms + high-impact shared spaces); designed for existing headcount; proof of service delivery, management oversight, employee protection; expand to trading floor towel/trash volume post-success",
      "source": "Transcript"
    }
  ],
  "Logan Newman": [
    {
      "category": "Strategic Planning & Goal Setting",
      "reviewer": "Valarie Barnett",
      "title": "Set Measurable Goals with Specific Timelines for 2026",
      "quote": "The goals that you set for yourself are measurable, that they're specific, you know that you can measure them. The measuring part is going to be really important. Does it align to your job title expectations?",
      "action": "Define 2026 goals that are: (1) Specific and measurable, (2) Include completion dates/timelines, (3) Track progress quarterly/monthly, (4) Align to AD role expectations; enter into Workday performance system with measurement criteria",
      "source": "Transcript"
    },
    {
      "category": "Professional Development",
      "reviewer": "Valarie Barnett",
      "title": "Proactive Help-Seeking with Measurement Framework",
      "quote": "What will trigger the request for help? How will you do it differently? How will you measure success? I want to challenge you - make sure your goals are measurable.",
      "action": "Shift from retroactive (when stuck) to proactive help-seeking: when presented with new opportunity, immediately call/text/email senior leadership or peers for partnership; measure by: (1) number of proactive requests vs reactive, (2) issues resolved before escalation, (3) account stability metrics",
      "source": "Transcript"
    },
    {
      "category": "Account Retention & Scope Alignment",
      "reviewer": "Valarie Barnett",
      "title": "Achieve 100% Scope Alignment at Greenville to Prevent Termination",
      "quote": "I'd like to take this conversation offline... that gray area could lead to termination. If I'm the customer and I expect you to be doing something you're not doing, I don't care if it's in scope. Let's have office hours... a strategy around that.",
      "action": "Schedule office hours with Valarie to develop strategy for Greenville scope alignment; document all scope items with Omentum and GE; eliminate gray areas where client expectations exceed written scope; proactively absorb reasonable items to protect contract",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Differentiation",
      "reviewer": "Valarie Barnett",
      "title": "Develop 2026 Reinvention Roadmap - 'Fight for Our Lives' Mentality",
      "quote": "I challenge you on the reinvention, put a roadmap together. We're fighting for our lives every time. ABM will call your customer behind your back, offer better solution - it's a lie, but client gets persuaded. How am I going to reinvent myself?",
      "action": "Create quarterly reinvention roadmap for existing accounts: What innovations, process improvements, or value-adds will differentiate SBM? Assume competitor is actively pursuing accounts; proactively offer solutions before client requests; review equipment catalog, sustainability initiatives, technology rollouts",
      "source": "Transcript"
    },
    {
      "category": "Value Tracking & Documentation",
      "reviewer": "Valarie Barnett",
      "title": "Track Everything, Quantify All Year, Brag on Yourself",
      "quote": "Track everything! Quantify everything, track it all year long, then quarterly and annually in your meetings. It's hard to brag on yourself, but we need you to brag on yourself. I didn't process it the way Kyle said it.",
      "action": "Implement continuous tracking system: (1) Monthly log of projects, value-adds, cost savings, innovations, (2) Quantify dollar amounts as they happen, (3) Roll up quarterly for QBRs, (4) Annualize for year-end reviews; create 'mic drop' WOW numbers for presentations",
      "source": "Transcript"
    },
    {
      "category": "Growth Strategy Partnership",
      "reviewer": "Valarie Barnett & Nicole Ouimet",
      "title": "Partner with Solutions/Sales for Strategic Growth Planning",
      "quote": "Partner with a solutions person to help flush out strategy for your growth. You have tactical understanding - partnered with someone who says 'have you thought about it from this perspective' will take this to the next level.",
      "action": "Spend minimum 30 minutes/month with Nicole Ouimet on growth opportunities (Lynn, Rushford Vermont, GE Healthcare Wisconsin, Vernova expansion, international); collaborate on strategic approach vs just tactical execution; use Nicole's relationships and different thinking to close deals",
      "source": "Transcript"
    },
    {
      "category": "Key Projects & Client Impact",
      "reviewer": "Valarie Barnett",
      "title": "2026 Goal - Major Initiatives with Strategic Client Impact",
      "quote": "Contract renewal is a reach to have as key project. I'm looking for major initiative delivered to client that drove value, had impact, showed them we are the best. In 2026, plan your year with more depth and structure around strategic impact.",
      "action": "Plan 2026 with deliberate client-facing projects beyond operational basics: identify initiatives at each site that create measurable value, differentiate from competitors, drive strategic impact; track Greenville projects (hiring, schedules, team walkoff recovery) as valuable initiatives, not just 'doing the job'",
      "source": "Transcript"
    },
    {
      "category": "Customer Advocacy Development",
      "reviewer": "Kyle Wallace",
      "title": "Create Measurable Customer Advocacy Program",
      "quote": "The customer advocacy you've created with Jamie, Eduardo, Gwen, Deborah, Todd at JLL is immeasurable, but we'd like to get it to a point where it is measurable. Use this advocacy as references on new work.",
      "action": "Document customer advocacy metrics: (1) Track reference requests and outcomes, (2) Capture customer testimonials/quotes, (3) Use Jamie Ragg (GM Infrastructure Cincinnati) as reference for new RFPs - he 'talks very highly' about SBM, (4) Formalize advocacy into measurable business development asset",
      "source": "Transcript"
    },
    {
      "category": "GE Vernova Expansion",
      "reviewer": "Nicole Ouimet",
      "title": "Aggressive Pursuit of Lynn, Rushford Vermont, and Vernova Portfolio",
      "quote": "The big one is Lynn. Lynn and Rushford Vermont are the two last large ones we absolutely want. Lynn is the great white Buffalo - $200K+. We're in much stronger position now. They don't want to put mom & pop out of business - thinking caps on, can we give them jobs?",
      "action": "2026 priorities: (1) Lynn MA ($200K+) - coordinate site visit with Gwen, explore carve-out or job placement for incumbent mom & pop to overcome loyalty hurdle, (2) Rushford Vermont ($100K), (3) Partner with Melissa on GE Healthcare Wisconsin with JLL, (4) Map domestic/international Vernova portfolio for JLL expansion",
      "source": "Transcript"
    }
  ],
  "Luis Cabrera": [
    {
      "category": "Professional Development & Independence",
      "reviewer": "Valarie Barnett",
      "title": "Achieve Independence from Julio - Measured by Q1 2026 Performance",
      "quote": "We want to measure your personal goals. I think a clear measurable goal for you is we can measure your independence through your Q1 performance. Julio, you've got to let go. Luis is going to make mistakes. Luis, you have to tell Julio 'I got it, I don't need your help.'",
      "action": "Fly solo as Account Manager by Q1 2026: (1) Make independent decisions and own outcomes, (2) Allow mistakes as learning opportunities (without crashing/burning), (3) Julio must step back and let Luis lead, (4) Measure success through Q1 financial performance and operational results; demonstrate capabilities for Account Director promotion path",
      "source": "Transcript"
    },
    {
      "category": "Financial Performance",
      "reviewer": "Luis Cabrera (Self-Identified) & Valarie Barnett",
      "title": "Close $1M Annual Revenue Gap (Central Square Loss + RFP Reduction)",
      "quote": "It's almost almost $1M per year that I'm going to have to close and make sure we recoup over first probably year or six months.",
      "action": "Close ~$1M annual gap from: (1) Central Square GMP shutdown ($14K Oct, $26K monthly ongoing), (2) RFP reduction ($80K/month); recoup through Brooklyn Park MN growth ($1.7M/year target), 585 building transition, and organic expansion; timeline: 6-12 months",
      "source": "Transcript"
    },
    {
      "category": "Contract Management & Risk Mitigation",
      "reviewer": "Valarie Barnett",
      "title": "Zero KPI Penalties in 2026 (New Fee-at-Risk Contract)",
      "quote": "I would challenge you in #3: a year of no penalties on your new contract against your KPIs.",
      "action": "Achieve zero financial penalties under new fee-at-risk contract structure: (1) Maintain all KPI performance thresholds, (2) Avoid financial component hits, (3) Luis accepted: 'Challenge accepted... SPM has us ready and equipped to achieve that challenge'; leverage strict internal accountability that exceeds client expectations",
      "source": "Transcript"
    },
    {
      "category": "Growth Strategy",
      "reviewer": "Luis Cabrera (Self-Identified)",
      "title": "Secure 585 Kendall Square Building Without RFP",
      "quote": "One of my main goals is to avoid at all cost a potential RFP for this. We want that job awarded to us without need of RFP, and that's definitely a strategy I need to develop.",
      "action": "Develop strategy to secure 585 Kendall Square building transition (from Central Square) through direct award without RFP; leverage existing relationship, demonstrated GMP excellence, and Takeda confidence to position as incumbent advantage",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity",
      "reviewer": "Luis Cabrera & Julio Tejeda",
      "title": "Brooklyn Park MN Acquisition ($1.7M Annual Revenue Target)",
      "quote": "Low-hanging fruit that Julio out of his new trenches is helping me achieve is Brooklyn Park Minnesota. GMP site, about $1.7M per year in revenue. Expect by Q2 2026 better news - we're transitioning this site.",
      "action": "Close Brooklyn Park MN opportunity by Q2 2026: (1) Partner with Julio on strategy, (2) Leverage Takeda relationship and existing footprint, (3) Target $1.7M annual GMP site revenue to offset Central Square and RFP losses, (4) Position as critical growth initiative for financial gap closure",
      "source": "Transcript"
    },
    {
      "category": "Strategic Positioning",
      "reviewer": "Luis Cabrera (Self-Identified)",
      "title": "Strengthen Perception of SBM Support Structure Beyond Luis",
      "quote": "We heard a lot during RFP that 'we know Luis is there, but what else is behind SBM?' We have control environment team, Dan, Marvin, people behind me. We need to portray that... make it so they feel it, they see it. Not just tell them in presentation.",
      "action": "Revamp QBR/engagement strategy to demonstrate SBM depth: (1) Bring senior leadership visibility to Takeda (Marvin, Dan, COO access), (2) Show support structure beyond Luis, (3) Make Takeda 'feel comfortable and supported' by entire organization, (4) Move beyond PowerPoint mentions to tangible leadership presence",
      "source": "Transcript"
    },
    {
      "category": "Goal Development",
      "reviewer": "Valarie Barnett",
      "title": "Flush Out Personal Goals with Timelines and Actionable Data",
      "quote": "I want you to flush those out and develop them just a little bit more with timelines and actionable data so that when you sit down with your management team, you can actually say where am I in the process of achieving what I wanted to this year?",
      "action": "Document personal goals with: (1) Specific timelines (Q1 independence, Q2 Brooklyn Park, 2026 zero penalties, financial gap closure 6-12 months), (2) Measurable milestones for each goal, (3) Progress tracking mechanism for monthly management reviews, (4) Clear success criteria",
      "source": "Transcript"
    },
    {
      "category": "Lessons Learned",
      "reviewer": "Luis Cabrera (Self-Identified)",
      "title": "RFP Lesson Learned - Be More Aggressive, Ask for What You Want",
      "quote": "Another conversation for another time about lessons learned for RFP: be more aggressive, definitely ask for what you want. That's the biggest lesson learned these RFPs left to me.",
      "action": "Apply RFP lessons learned to future opportunities (585 building, Brooklyn Park): (1) Be more aggressive in positioning, (2) Explicitly ask for what SBM wants vs implicit expectations, (3) Don't undervalue capabilities or hesitate on pricing/scope, (4) Document lessons for future reference",
      "source": "Transcript"
    }
  ],
  "Scott Kimball": [
    {
      "category": "Personal Goals - URGENT",
      "reviewer": "Valarie Barnett",
      "title": "Develop SMART Personal Goals for 2026 (Due in 10-15 Minutes)",
      "quote": "Your personal goal was to learn an afterthought. I'm gonna challenge you. Your goal should be specific, measurable, achievable, relevant and time-based. Those goals will transfer into Workday. If you could get that to me in the next 10-15 minutes, I don't want to close out your sheet without giving you full credit.",
      "action": "URGENT: Submit 1-2 SMART personal goals for 2026: (1) Specific - what exactly will you accomplish, (2) Measurable - how will you track progress, (3) Achievable - can be done in 2026, (4) Relevant - aligns to AD role, (5) Time-based - includes deadlines; examples: explosive growth quantified with $ target and timeline, consistency metrics, skill development with milestones",
      "source": "Transcript"
    },
    {
      "category": "Growth Strategy & Differentiation",
      "reviewer": "Valarie Barnett",
      "title": "Articulate Compelling Differentiators for All Growth Opportunities",
      "quote": "Why would they select us in Toronto? Why Swiftwater GMP award? What is compelling them to say SBM is better or different? Why would they take us to Europe? I want to hear those ideas flushed out. It's super critical for myself, Nicole, Nick V - we need to articulate our difference at Sanofi on the spot.",
      "action": "Document specific differentiators for each opportunity: (1) Swiftwater GMP - what makes SBM better than incumbent, (2) Toronto - value proposition vs local competitors, (3) International - capabilities/advantages, (4) Write detailed response to Valarie; ensure sales team can articulate Sanofi-specific differentiation on demand",
      "source": "Transcript"
    },
    {
      "category": "Innovation Monetization",
      "reviewer": "Valarie Barnett",
      "title": "Create Desire for Mobile Everywhere - Monetization Strategy",
      "quote": "We did this as a pilot like a Costco tasting. My hope is you have clear outcomes, meaningful things to share so they say 'we want this everywhere.' If you don't get that response, we aren't doing what we need to do. Work with us to create that desire.",
      "action": "Develop mobile expansion pitch for Feb 2026 QBR: (1) Document Morristown results (3x report-its, operational benefits, data insights), (2) Build business case for portfolio-wide rollout with CBRE funding, (3) Partner with Valarie/Nicole/Sean to craft 'create desire' strategy, (4) Present success story that compels 'we want this everywhere' response",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Data Strategy",
      "reviewer": "Scott Kimball (Self-Identified)",
      "title": "XY Sense Data Value Demonstration Strategy",
      "quote": "They're paying for XY Sense and don't really know what to do with it. Either they'll look at it as waste of money or we'll step in and blow their minds with how we help them get value... solidify our place in their partnership mindset.",
      "action": "Develop XY Sense partnership initiative: (1) Take Morristown 2-3 month data to customer Feb/March, (2) Demonstrate how restroom traffic patterns can optimize cleaning routes/frequencies, (3) Position SBM as data interpretation expert, (4) Expand to Cambridge if successful, (5) Help Sanofi extract value from existing vendor investment",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategic Focus",
      "reviewer": "Valarie Barnett",
      "title": "Year 2 - Consistency and Proactive Initiatives",
      "quote": "Year one's key projects were reactionary. In 2026, your challenge is to look out for key projects and initiatives you can initiate that add value. You'll guide it more than they will this year.",
      "action": "Shift from reactive (Year 1: dealing with crises/problems caused by client or circumstances) to proactive (Year 2: SBM-initiated value creation); 2026 theme: consistency and stability as foundation for explosive growth; plan strategic initiatives vs responding to challenges",
      "source": "Transcript"
    },
    {
      "category": "SME Resource Sharing",
      "reviewer": "Sean Henderson & Valarie Barnett",
      "title": "Document Jacqueline's GMP Best Practices for Enterprise Use",
      "quote": "Sean: 'Do you mind sending that out? Best practice. I have another GMP account taking 6+ months.' Valarie: 'You're going to get Jacqueline pulled into calls where we're bidding GMP because we need efficiencies. She sounds like an expert.'",
      "action": "Work with Jacqueline to document: (1) GMP training program redesign (2 months → 3 weeks process), (2) GMP management structure efficiencies (identified 4 more supervisors to cut), (3) Share with Sean Henderson for other GMP accounts, (4) Prepare Jacqueline for bid team consultations with Valarie/Nicole/Mike/Andy on GMP efficiency finding",
      "source": "Transcript"
    },
    {
      "category": "Growth Pipeline Management",
      "reviewer": "Nicole Ouimet & Valarie Barnett",
      "title": "Aggressive Growth Tracking with Clear Timelines",
      "quote": "Nicole: 'Everything you've outlined has positioned you for growth you have on timeline for 2026.' Valarie: 'How is that being managed and tracked? How are we aggressively going after it?'",
      "action": "Manage 2026 pipeline with clear accountability: (1) Swiftwater GMP - Q1 final award target, (2) Toronto - June 2026 (pending SBM corporate decision), (3) International - clarity by year-end, (4) Existing scope adds - monthly tracking, (5) $1.3M additional monthly revenue target by year-end; track progress in monthly leadership meetings",
      "source": "Transcript"
    }
  ],
  "Nicholas Trenkamp": [
    {
      "category": "Personal Goals - URGENT",
      "reviewer": "Valarie Barnett",
      "title": "Develop SMART Personal Goals for 2026 (Reply All to Meeting Invite)",
      "quote": "I don't want you to get a zero on personal goals cause you're doing well overall on your score. Reply all to the e-mail invite. Take just a couple minutes and get your SMART goals down. These will go into your HR file and be what you're measured against in 2026.",
      "action": "URGENT: Create 1-2 SMART personal goals (Specific, Measurable, Achievable, Relevant, Time-based) and reply all to meeting invite; examples: quantified growth targets, innovation implementation milestones, partnership expansion metrics; will be entered into Workday for 2026 performance tracking",
      "source": "Transcript"
    },
    {
      "category": "Value-Add Quantification",
      "reviewer": "Valarie Barnett",
      "title": "Track Dollar Amounts for All Value-Add Work in 2026",
      "quote": "Do you have dollars associated to the value adds? I would love to see the revenue associated with this. A goal for 2026 will be tracking these dollars.",
      "action": "Implement system to track and quantify dollar value of all value-add activities: (1) Weekly cleaning blitzes, (2) Audit response efforts, (3) Above-and-beyond work, (4) Emergency coverage, (5) Report quarterly to demonstrate partnership value and support retention/growth conversations",
      "source": "Transcript"
    },
    {
      "category": "Strategic Communication",
      "reviewer": "Valarie Barnett",
      "title": "Articulate 2025 Key Projects & Initiatives (Not Just Outcomes)",
      "quote": "Did you have any key projects or initiatives in 2025? I think some of your cost savings or your cost avoidance was part of some key projects, right?",
      "action": "Better frame and articulate key projects/initiatives vs just outcomes: (1) Staffing defense study as project, (2) Financial turnaround initiative, (3) Scope creep reset program, (4) For Insight adoption drive; document these as strategic initiatives with beginning/middle/end, not just results",
      "source": "Transcript"
    },
    {
      "category": "Communication Depth",
      "reviewer": "Valarie Barnett",
      "title": "Add More Depth to Key Sections of Presentations",
      "quote": "There's a couple of places where I requested or I would have liked to hear more depth, but that's what these are about so that we can grow from this.",
      "action": "In future presentations/QBRs, provide deeper context in: (1) Key projects - not just what, but why it mattered, how it was executed, customer impact, (2) Challenges - not just what happened, but corrective actions, timelines, lessons learned, (3) Innovations - fuller story of proposal, customer response, next steps",
      "source": "Transcript"
    },
    {
      "category": "Innovation Implementation",
      "reviewer": "Nick Trenkamp (Self-Identified)",
      "title": "Execute Eco Trash Compactor & V40 Autonomous Cleaning Rollouts",
      "quote": "Q4 timeline: I think it's more than reasonable to have the compactors implemented. V40, I do not know if that will get past P&G again given those parameters and recent events.",
      "action": "Q4 2026: (1) Implement Eco Trash compactor portfolio-wide ($79K annual savings), (2) Navigate V40 autonomous cleaning approval post-fire incident - work with EHS (Evan/Maurice) on battery certifications and safety parameters, (3) Demonstrate ROI at Mason (equivalent to 4 FTEs), (4) Continue innovation pipeline with Sue for new proposals",
      "source": "Transcript"
    },
    {
      "category": "Growth Strategy & Partnership",
      "reviewer": "Nick Trenkamp & Valarie Barnett",
      "title": "Establish Cadence with Nick Viskovich for Service Bundling",
      "quote": "I've been communicating with Nick Viskovich. I would like to continue that partnership and align on strategic stabilization and long term value as far as bundling. He's got a few areas of opportunity I'm looking forward to diving into.",
      "action": "Q1-Q2 2026: Establish regular cadence with Nick Viskovich to: (1) Bundle SBM services with other JLL offerings, (2) Expand product/service lines to reduce single-service vulnerability, (3) Identify scope expansion opportunities across portfolio, (4) Position SBM as multi-line provider vs single custodial vendor to reduce risk of displacement",
      "source": "Transcript"
    },
    {
      "category": "Technology Adoption",
      "reviewer": "Nick Trenkamp (Self-Identified)",
      "title": "Full Portfolio For Insight Mobile Adoption by Q3 2026",
      "quote": "Q3: Having entire team have For Insight shirt up as far as what routes look like and site profiling, building scope of work binders, having schedules reset, resetting customer expectations.",
      "action": "Q3 2026: Complete For Insight mobile rollout portfolio-wide including: (1) All routes documented in system with visible schedules, (2) Site profiling complete for all locations, (3) SOW binders created for every site, (4) Team trained on consistent out-of-scope request capture, (5) Data collection robust enough to drive scope expansion conversations with JLL",
      "source": "Transcript"
    },
    {
      "category": "Revenue Growth & Scope Defense",
      "reviewer": "Nick Trenkamp & Valarie Barnett",
      "title": "Reverse 4-Year Revenue Decline Through Scope Expansion",
      "quote": "7% revenue decline over four-year time. At the end of the day, if we only have one line of service, we're more susceptible to other people coming in and taking business. We need to bundle our programs to show more worth to the customer.",
      "action": "2026 goals: (1) Reverse -4.48% 2025 revenue decline, (2) Target scope expansion at Mason (bi-weekly to weekly/daily based on audit data and workspace reconfigurations), (3) Convert documented out-of-scope requests to contracted scope increases, (4) Pursue additional service lines beyond custodial to create bundled offering, (5) Make SBM impossible to kick out the door through multi-service integration",
      "source": "Transcript"
    },
    {
      "category": "Operational Challenges",
      "reviewer": "Valarie Barnett",
      "title": "Document Operational Challenges with Reflection & Corrective Actions",
      "quote": "On the issues and challenges section, one thing I was looking for was just transparency, ownership of gaps that we had, maybe reflection on corrective actions with timelines.",
      "action": "In future reviews, structure challenges section to include: (1) What went wrong (transparency), (2) Why it went wrong (root cause), (3) What we did about it (corrective actions), (4) When it was fixed (timelines), (5) What we learned (reflection); demonstrate ownership and continuous improvement mindset beyond just identifying problems",
      "source": "Transcript"
    }
  ],
  "Julie Bianchi": [
    {
      "category": "Personal Goals - SMART Framework",
      "reviewer": "Valarie Barnett",
      "title": "Convert All Personal Goals to SMART Goals with Accountability Measures",
      "quote": "You mentioned SMART goals and I'm very familiar with that, but I didn't make these smart goals. You have some great ideas, but I'd like to see your ideas in a way that you hold yourself accountable. When will you have this done by? Let's put more into it.",
      "action": "Rewrite all 2026 personal goals using SMART framework (Specific, Measurable, Achievable, Relevant, Time-bound): (1) For Insight mastery - define specific modules/features to learn, timeline for completion, how to measure proficiency, (2) Revenue growth - quantified targets with monthly/quarterly milestones, (3) Cost savings - specific dollar goals with deadlines, (4) Employee engagement - measurable initiatives with launch dates, (5) All goals need owners, deadlines, and accountability metrics",
      "source": "Transcript"
    },
    {
      "category": "Forward Strategy - Missing Timelines",
      "reviewer": "Valarie Barnett",
      "title": "Add Timelines and Dates to All 2026 Forward Strategy Items",
      "quote": "All of your forward strategy is missing timelines and dates. I could only give you like 3 stars out of 5. In order for it to really be a flushed out strategy, I need the dates. As we continue to meet monthly, we should be closer to getting these things closed out. They're not just wishes on a page.",
      "action": "Add specific timelines to all forward strategy items: (1) Sustainability/waste analysis - completion date, signage implementation timeline, (2) Quarterly survey co-creation - draft review date, pilot timeline, rollout schedule, (3) For Insight deep-dive training - enrollment date, completion target, (4) Employee recognition program - launch date, frequency, metrics, (5) Contract renewal milestones - pre-May 2026 checkpoints; use timelines for monthly accountability in 1-on-1s",
      "source": "Transcript"
    },
    {
      "category": "Cost Savings Strategy Development",
      "reviewer": "Valarie Barnett",
      "title": "Develop Data-Driven Cost Savings Plans for 2026 (Learn from Nick Trenkamp)",
      "quote": "I don't really see this as cost savings to the client. You need to look within the individual sites and come up with strategic plans for 2026 on either cost savings that we can deliver or ways to use data to prove we're giving them more than what they pay for. Nick Trenkamp from P&G just did an excellent job with that.",
      "action": "2026 initiative: Develop site-specific cost savings strategies similar to Nick Trenkamp's industry standards approach: (1) Review Nick's P&G staffing defense methodology (data-driven, industry benchmarks), (2) Identify cost savings opportunities at Bloomfield, Saint Louis, remaining Arizona sites, (3) Use data to demonstrate value delivery vs cost (prove they're getting more than paying for), (4) Present quarterly findings to CBRE/Cigna with quantified impact",
      "source": "Transcript"
    },
    {
      "category": "Value-Add Quantification",
      "reviewer": "Valarie Barnett (Implied)",
      "title": "Quantify Dollar Value of All Value-Add Services",
      "quote": "Value-added services provided at no cost: large events, confidential shred bins, consumables management.",
      "action": "2026 tracking system: Assign dollar values to all gratuitous services: (1) Event setups - estimate hours, labor cost, compare to vendor pricing, (2) Confidential shred bin management - quantify time investment, market rate comparison, (3) Consumables management - administrative time value, (4) Emergency/short-notice work - premium rate avoidance, (5) Report quarterly to demonstrate partnership value for retention/renewal conversations",
      "source": "Transcript"
    },
    {
      "category": "Operational Challenge Resolution",
      "reviewer": "Valarie Barnett",
      "title": "Close Out Arizona Issues with Clear Resolution Documentation",
      "quote": "Some of the information around the challenges and issues, I don't necessarily know that those are over yet. Where is the resolve or is it still floating out there? Is it closed out? Where are we with it?",
      "action": "Document Arizona challenge resolution: (1) 18 medical locations, 11 sold by Cigna - what's current status?, (2) Site manager change - how has new SM improved responsiveness/relationships, metrics?, (3) Joint audits/surveys - current scores vs 2025 failures, corrective actions completed?, (4) Lesson learned (should have requested night supervisor earlier) - how applied to other sites?, (5) Provide closure narrative with before/after data, timelines, current state",
      "source": "Transcript"
    },
    {
      "category": "For Insight Training & Mastery",
      "reviewer": "Julie Bianchi (Self-Identified) & Valarie Barnett",
      "title": "Complete Comprehensive For Insight Training with Measurable Outcomes",
      "quote": "For Insight is amazing, but I'm being very honest with myself. I use it, but nowhere near to the extent of what it can provide. Gain more in-depth knowledge on all the different things I can get so I've got better reporting, identify trends, ultimately impact business decisions. Val: What steps have you taken to get there?",
      "action": "For Insight mastery plan with accountability: (1) Schedule training sessions with For Insight team or expert users - specific dates, (2) Identify 5-10 specific features/reports to master (trend analysis, predictive analytics, custom dashboards, etc.), (3) Set milestone dates for each module completion, (4) Create sample reports demonstrating new capabilities, (5) Present findings to Mario/CBRE showing data-driven insights for business decisions, (6) Measure: # of new reports generated, trends identified, business decisions influenced",
      "source": "Transcript"
    },
    {
      "category": "Idea Execution & Follow-Through",
      "reviewer": "Julie Bianchi (Self-Identified)",
      "title": "Transform Ideas into Action - Stop Talking, Start Doing",
      "quote": "When we're meeting with our customer, interactions be more detailed. We talk about ideas and then they seem to go nowhere. I take responsibility for that too. I'd really like to, I will work with them: let's generate ideas, when we're saying hey it would be great if, all right so what is it going to take to do that? Let's not just talk about it. Let's do it.",
      "action": "Implement idea-to-action framework: (1) During customer meetings, capture ideas in real-time, (2) Before meeting ends, assign owners, deadlines, resource needs for each idea, (3) Next meeting agenda: review action items from previous meeting, report progress, (4) Track idea-to-implementation conversion rate, (5) Examples: sustainability signage (waste analysis → signage design → approval → installation with dates), quarterly survey (draft → pilot → rollout with milestones), (6) Demonstrate follow-through that builds customer confidence",
      "source": "Transcript"
    },
    {
      "category": "Sustainability Initiative Execution",
      "reviewer": "Julie Bianchi & Valarie Barnett",
      "title": "Complete Waste Analysis and Recycling Signage Implementation",
      "quote": "Really focusing on driving this forward. Common theme for Mario and Saint Louis is managing waste, in particular recycling efforts. Bags of trash go out with empty bottles, cans because people don't pay attention or not clear. Signage is very poor. We had call Tuesday with Sue Beats Atkinson. Next steps: waste analysis, then signage solutions.",
      "action": "Sustainability project with timelines: (1) Complete waste analysis with Sue Beats Atkinson - target completion date, (2) Design signage recommendations (clear, visible, color-coded) - draft date, (3) Present to Mario and Cigna for approval - meeting date, (4) Implement at Bloomfield pilot - installation date, (5) Measure: contamination rate reduction, recycling volume increase, cost impact, (6) Expand to Saint Louis based on results - rollout timeline, (7) Follow up on call commitments to prevent initiative from 'going nowhere'",
      "source": "Transcript"
    },
    {
      "category": "Employee Engagement & Recognition",
      "reviewer": "Julie Bianchi (Self-Identified)",
      "title": "Launch Employee Recognition Program with Measurable Engagement",
      "quote": "Creating increased visibility. Seeking ideas from them, getting their opinions. What would make something better? What would make their job easier? Making sure they have opportunity to be heard. One employee mentioned: hey, how come we don't have employee of the month? That can go a long way.",
      "action": "Employee engagement initiative: (1) Launch employee of the month program - criteria, selection process, recognition method, start date, (2) Quarterly town halls or feedback sessions - schedule, agenda, action item tracking, (3) Idea submission process - how employees submit suggestions, review timeline, implementation tracking, (4) Recognition doesn't require money - spotlight in communications, peer recognition, leadership shout-outs, (5) Measure: participation rate, ideas submitted/implemented, employee satisfaction, retention improvement",
      "source": "Transcript"
    },
    {
      "category": "Lessons Learned - Arizona Supervision",
      "reviewer": "Julie Bianchi (Self-Identified)",
      "title": "Apply Arizona Lesson: Request Supervision Funding Early When Issues Arise",
      "quote": "18 locations, some over an hour/almost two hour drive. No night supervision. I believe that was not sufficient management level to assist with reaching required results. Lesson learned: obtaining funding for needed supervision should have been requested when we saw these issues happening.",
      "action": "Operational governance: (1) Establish early warning system for quality/audit issues requiring supervision intervention, (2) When issues emerge, immediately assess if supervision gap exists, (3) Build business case with data (travel distances, coverage gaps, audit failures) before problems compound, (4) Present to customer proactively vs reactively, (5) Don't wait for perfect timing - address supervision needs when identified, not when convenient, (6) Document ROI of supervision investment (quality improvement, audit scores, customer satisfaction)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Communication - Impact Articulation",
      "reviewer": "Valarie Barnett",
      "title": "Articulate Why Key Initiatives Matter to Customer (Not Just What Was Done)",
      "quote": "Good summary of key projects across account in 2025. Through this exercise I have more visibility and understanding to your impacts. Only thing I would have added was why these key initiatives mattered to Cigna.",
      "action": "Enhanced storytelling framework: When presenting projects/initiatives, structure as: (1) What we did (the action), (2) Why it mattered to customer (business impact, risk mitigation, strategic alignment), (3) How we executed (process, challenges overcome), (4) Results achieved (quantified when possible), (5) What's next (sustainability, expansion); Examples: 3M floors - why world headquarters image matters to Cigna brand, Union increases - why cost recovery matters to margin protection, Contract renewal - why structure change reduces Cigna administrative burden",
      "source": "Transcript"
    },
    {
      "category": "Communication Depth",
      "reviewer": "Valarie Barnett",
      "title": "Add More Depth with Timelines, Execution Plans, and Accountability",
      "quote": "I feel like there was some executive presence, but you would have to work on fleshing out your ideas to be executable and what's been executed or where you are in your timelines. It's more the teeth and depth to each item.",
      "action": "Communication enhancement: (1) Every project/initiative should include: current status (%), timeline (start/expected completion), owner, next milestone, blockers if any, (2) Challenges should include: issue identified (when), root cause, corrective action taken, timeline for resolution, current status (open/closed), lessons learned, (3) Forward strategy needs: specific goal, why it matters, how we'll achieve it, who owns it, by when, how we'll measure success, (4) Practice presenting with this depth for monthly 1-on-1s to build habit",
      "source": "Transcript"
    }
  ],
  "Rafaed Ortiz": [
    {
      "category": "Forward Strategy - Add Timelines",
      "reviewer": "Valarie Barnett",
      "title": "Add Specific Timelines to Forward Strategy (Q1, Q2, Q3 Milestones)",
      "quote": "Your vision is clear for me. What's not clear is how you plan to get there and then what by when? So like I'm a really heavy stickler on this one about the dates. By Q1 I want to do these things, by Q2... Your specific goals are tied to your vision. OK, look at you.",
      "action": "Enhance forward strategy with specific quarter-by-quarter timelines: (1) Q1 goals - daily huddles with managers, weekly supervisor meetings (already scheduled), consumable reduction targets, (2) Q2 goals - workforce engagement improvement, issue reduction across both sites/programs, Cambridge expansion once SM returns from leave, (3) Q3 goals - stabilize KPI performance, eliminate repeat failures/complaints, protect at-risk fees under new contract, (4) Long-term - I-mop rollout, For Insight expansion, equipment replacement; add dates to each initiative for accountability in monthly check-ins",
      "source": "Transcript"
    },
    {
      "category": "Technology Implementation",
      "reviewer": "Rafaed Ortiz (Self-Identified)",
      "title": "Roll Out I-Mops That Have Never Been Used",
      "quote": "I was recently informed that we have some I-mops that they have never been used. I've been asking around and the feedback is that they have not been used. I want to expand on those tools.",
      "action": "I-mop implementation project: (1) Investigate why I-mops never deployed (training gap? equipment location? resistance?), (2) Assess condition and functionality of existing I-mops, (3) Develop training program for operators, (4) Create pilot deployment plan for high-traffic areas, (5) Measure productivity/quality improvement vs traditional methods, (6) Expand based on pilot results; coordinate with financial team on equipment replacement budget for old scrubbers that aren't worth fixing",
      "source": "Transcript"
    },
    {
      "category": "For Insight Expansion",
      "reviewer": "Rafaed Ortiz (Self-Identified)",
      "title": "Expand For Insight Use to Full Potential",
      "quote": "I want to expand on the use of For Insight, which again great tool, awesome tool. But I feel that it has not been used to its full potential at site.",
      "action": "For Insight maximization initiative: (1) Audit current For Insight usage vs available features (reporting, analytics, trends, predictive insights), (2) Identify 5-10 underutilized features that could drive value, (3) Training for managers/supervisors on advanced capabilities, (4) Integrate For Insight data into weekly KPI meetings for real-time trend analysis, (5) Use For Insight to track: audit/complaint closure within 24 hours, root cause documentation, preventive actions, repeat issues, (6) Present insights to Tim O'Donnell in biweekly meetings to demonstrate data-driven management",
      "source": "Transcript"
    },
    {
      "category": "Cambridge Site Expansion",
      "reviewer": "Rafaed Ortiz (Self-Identified)",
      "title": "Expand Responsibilities to Cambridge Site Once SM Returns from Leave",
      "quote": "I want to expand my responsibilities to the Cambridge side, which overall I know what's going on but I haven't been able to be there. I believe once the site manager returns from her leave, which I believe is beginning of Q2, and then after that I'm going to schedule regular visits throughout the year.",
      "action": "Cambridge integration plan: (1) Confirm site manager return date (beginning Q2), (2) Schedule transition meetings with returning SM to align on expectations, current issues, opportunities, (3) Establish regular visit cadence (weekly? biweekly?) post-return, (4) Apply RTP learnings to Cambridge: ATB tracking, daily pass-downs, uniform compliance, three-tier GMP review if applicable, (5) Build relationship with Cambridge CBRE contacts similar to RTP model, (6) Track: Do Cambridge issues decrease with increased oversight? Does consistency improve across portfolio?",
      "source": "Transcript"
    },
    {
      "category": "KPI Performance & At-Risk Fees",
      "reviewer": "Rafaed Ortiz (Self-Identified)",
      "title": "Stabilize KPI Performance by Q3 to Protect At-Risk Fees",
      "quote": "I want to achieve consistent KPI performance and now more than ever to protect the at risk fees which the new extension contract has some fees. By Q3 I want to stabilize KPI performance and eliminate any repeat failures, complaints.",
      "action": "KPI stabilization roadmap: (1) Assign KPI ownership to specific managers/supervisors (already planning this), (2) Launch weekly KPI meetings to track progress and address gaps (already scheduled with GMP team), (3) Ensure audits and complaints are: recorded, closed within 24 hours, completed with preventive action and root cause (wasn't happening early 2025), (4) Eliminate repeat failures/complaints through systematic root cause analysis, (5) By Q3: achieve consistent passing scores without volatility, (6) Protect at-risk fees in new 5-year contract extension; document KPI performance trends to show improvement trajectory",
      "source": "Transcript"
    },
    {
      "category": "Candidate Selection & Hiring",
      "reviewer": "Rafaed Ortiz (Self-Identified)",
      "title": "Improve Selection Process - Professional Demeanor Over Experience Alone",
      "quote": "I want to work more closely with supervisors and managers to improve the selection of candidates. I don't expect a person to be a superstar, but yes, a person with professional demeanor, an honest, hardworking person. And of course if they have experience, awesome.",
      "action": "Hiring criteria enhancement: (1) Define 'professional demeanor' standards for interviewers - what does this mean specifically? (communication, appearance, attitude, reliability indicators), (2) Train supervisors/managers on behavioral interview techniques to assess honesty, work ethic, cultural fit, (3) Balance experience vs character - prioritize character/teachability for entry-level roles, (4) Create screening questions that reveal work ethic and professionalism, (5) Review new hire performance at 30/60/90 days to validate selection improvements, (6) Goal: reduce bad hires, continue 60% turnover reduction momentum",
      "source": "Transcript"
    },
    {
      "category": "Equipment Assessment & Replacement",
      "reviewer": "Rafaed Ortiz (Self-Identified)",
      "title": "Complete Equipment Assessment and Replacement Plan with Financial Team",
      "quote": "I have already started conversations with financial to kind of look at how many hours do I need to say, for example, if we need to replace the equipment that we have because some of the equipment is kind of old. So I don't think it's worth it to fix it. It might be better just to get a new scrubber.",
      "action": "Equipment capital planning: (1) Complete equipment inventory and condition assessment - what's old, unreliable, not worth fixing?, (2) Quantify: downtime hours, repair costs, productivity loss from old equipment, (3) Build business case with financial team: ROI on replacement vs continued repairs, (4) Prioritize replacements by impact (scrubbers, I-mops already on-site, etc.), (5) Tie to preventive maintenance schedule reinforcement - 'we have reinforced preventive maintenance schedule' to reduce breakdowns, (6) Timeline: Long-term initiative but start Q1-Q2 assessment and approval process",
      "source": "Transcript"
    },
    {
      "category": "Presentation Confidence & English Fluency",
      "reviewer": "Valarie Barnett & Self-Identified",
      "title": "Build Presentation Confidence - English Language Comfort",
      "quote": "Valarie: 'The minute you get more comfortable with your English, you're gonna give everybody else a run for their money. I guarantee it.' Rafaed: 'It's the language... I'm self-aware that I kind of forget maybe words... As long as you guys can understand me, we're good.'",
      "action": "Professional development: (1) Recognize current performance - Valarie: 'One of strongest presentations in life sciences. Second to Luis Cabrera... earmarking you as someone to watch,' (2) Luis Cabrera example - 'He doesn't give a damn if his Spanish word comes out, he's going to keep talking,' (3) Build confidence through: practice presentations, leadership visibility (Dan wants to tap you for growth opportunities), continued strong execution building credibility, (4) Valarie suggestion: 'You should get up to Boston. You and Luis should hang out.' Consider networking with other bilingual leaders, (5) Focus on substance over perfection - your content, data, and results speak louder than occasional word searches",
      "source": "Transcript"
    },
    {
      "category": "Value Tracking - Customer-Facing",
      "reviewer": "Valarie Barnett",
      "title": "Track Value Created or Added to Customer in 2026 Initiatives",
      "quote": "For 2026 as you start your own initiatives make sure you constantly track the value we created or added to the customer.",
      "action": "Value quantification discipline: (1) For each 2026 initiative, document: what value it creates for Biogen/CBRE (cost savings, risk reduction, quality improvement, responsiveness), (2) Quantify where possible: Cambridge restroom adjustment ($30K annual savings), leadership reorganization ($13K quarterly savings), emergency leak responses (cost avoidance), consumable reduction (9% decrease), (3) Build portfolio of value-adds for contract discussions and scorecard reviews, (4) Present value narrative to Tim O'Donnell in biweekly meetings, (5) Use to position for scope expansion or rate discussions",
      "source": "Transcript"
    },
    {
      "category": "Leadership Recognition",
      "reviewer": "Valarie Barnett, Dan Hartman, Julio Tejeda, Marvin Owens",
      "title": "Continue Trajectory - High Potential Leader Pipeline",
      "quote": "Valarie: 'I'm literally earmarking you as someone to watch. One of strongest presentations in life sciences. Second to Luis Cabrera.' Dan: 'Super happy to have you on team... sense of comfort... I'll pick your brain on growth we have.' Julio: 'Finally first week December I was able to wake up peacefully and not think about Biogen.' Marvin: 'Feedback about Rafael on campus has been really, really great.'",
      "action": "Career development trajectory: (1) Dan's comment about 'growth we have' - be ready for expansion opportunities in market, (2) Valarie's suggestion to connect with Luis Cabrera in Boston - pursue this mentorship/networking opportunity, (3) Continue execution excellence - 4 months to turn around at-risk account is exceptional, (4) Document and share best practices: weekly ATB tracker, holiday policy correction, three-tier GMP review, culture transformation methodology, (5) Build on credibility: Tim/Sonia/Emily relationships, Lee Johnson recognition, contract extension secured, (6) 2026 focus: stabilize Cambridge, protect at-risk fees, continue cost discipline, grow in presentation confidence",
      "source": "Transcript"
    }
  ],
  "Ayesha Nasir": [
    {
      "category": "Personal Goals - SMART Framework",
      "reviewer": "Valarie Barnett",
      "title": "Rework All Goals into SMART Goal Format with Measurement Criteria",
      "quote": "I would like to see your goals reworked into the SMART goal format. Your goals are specific, you did a good job there, but how will we measure? What does success look like on those goals? Should be uploaded into Workday. This should be our general tracker of how we hold ourselves accountable.",
      "action": "Convert all 2026 goals to SMART framework (Specific, Measurable, Actionable, Relevant, Time-bound): (1) Additional responsibility/higher revenue account - define revenue threshold, by when, what preparation needed, (2) Transitions team building - how many MITs by Q1? Which transitions will include MIT?, (3) Mentor operations/succession plan - specific milestones for Ronnie handover, (4) Better leader/speaker/presenter - what training, by when, how measured (presentations, feedback scores)?, (5) Each goal needs: what success looks like, how measured, accountability checkpoints",
      "source": "Transcript"
    },
    {
      "category": "Career Development & Account Growth",
      "reviewer": "Ayesha Nasir & Valarie Barnett",
      "title": "Ready for Larger Account with Higher Revenue - Westinghouse at Limit",
      "quote": "I feel as I'm ready for additional responsibility and I would love to manage an account with higher revenue. We are kind of at our limit with Westinghouse. The only opportunities I see are just very minute, like $4K here, tiny site there, Canadian stuff we kind of declined.",
      "action": "Career trajectory planning: (1) Valarie: 'I know you are ready for your next challenge... a lot of accounts aren't anywhere near you... we won't go live on big account and put you on one... skills you've gained through transition support are building you up to be strong leader when you do get your home site and it's big, big account,' (2) 10 million in closed business already in Q1 - 'several exciting opportunities,' (3) Account fatigue - 'when you fix something... best thing is fix it and move on and fix something else, continue to build resume, earn stripes,' (4) Valarie's promise: 'You're not going to be without a home,' (5) Likely path: transition a site, fall in love with customer, stay there",
      "source": "Transcript"
    },
    {
      "category": "Transitions Leadership",
      "reviewer": "Ayesha Nasir & Valarie Barnett",
      "title": "Build Successful Transitions Team with Troy - East and West Coast Support",
      "quote": "If transitions is my trajectory, I want to have successful transitions team in East and West Coast. I get feedback that yes we support high-level transitions, but we're missing out smaller accounts and account directors/managers are spread thin. I would like to create path forward for transitions.",
      "action": "Transitions team vision with Troy: (1) Valarie: 'I'll get with Troy about what transitions team leadership looks like and where you fall in on that,' (2) Problem statement: smaller accounts not getting transition support, ADs/AMs spread thin and can't focus on growth/succession, (3) Solution: dedicated transitions support freeing ADs to focus on growth, (4) MIT hiring - Valarie: 'Are you going to bring in MITs? By what day? Is it important you have at least one person junior to you working under you by end of Q1?', (5) Use pipeline: review existing transitions, pull in MIT for hands-on training, (6) Kyle: 'I think you could do something with Troy that probably hasn't been done. Your ability to run through brick walls and get things done.'",
      "source": "Transcript"
    },
    {
      "category": "Succession Planning - Westinghouse",
      "reviewer": "Ayesha Nasir & Valarie Barnett",
      "title": "Complete Handover to Ronnie with Client Introductions",
      "quote": "Ronnie's good, he's fine. I just didn't, my thing was I haven't gotten feedback from anybody. I'm still working on my accounts and doing transitions simultaneously because I don't want to be without a home. I just have to hand it over to him and introduce them to all our clients. I don't want to bring that up to them till I'm confident this is actually happening.",
      "action": "Westinghouse succession execution: (1) Valarie's promise: 'You're not going to be without a home. You have my word,' (2) Once confirmed, introduce Ronnie to all clients at 8 sites, (3) Create formal handover plan: shadow period, solo with Ayesha backup, full ownership, (4) Document VIP hotspot maps, executive preferences, site-specific nuances for Ronnie, (5) Kyle's concern: 'Biggest concern is what is the plan when/if Ayesha moves off account' - this succession plan addresses it, (6) Ensure Ronnie understands boots-on-ground philosophy, 3-4 hour complaint turnaround, VIP area management",
      "source": "Transcript"
    },
    {
      "category": "Presentation Skills Development",
      "reviewer": "Valarie Barnett & Kyle Wallace",
      "title": "Slow Down Presentation Pace and Develop Key Points",
      "quote": "Valarie: 'You talk so fast.' Kyle: 'You went through your presentation extremely fast. You're a fast talker and you really punched up, delivered haymakers. There wasn't a whole lot of small talk that did afford you opportunity to maybe develop some of those points.'",
      "action": "Presentation enhancement: (1) Slow down speaking pace - practice with recording/timing, (2) Develop points - don't just deliver haymakers, explain process and client impact, (3) Add context and storytelling vs just results, (4) Kyle: 'May have lacked developmental steps to support those topics,' (5) Personal goal: 'I just want to be better leader, speaker, presenter,' (6) Practice presentations with peers for feedback, (7) Balance speed/efficiency with depth/development",
      "source": "Transcript"
    },
    {
      "category": "Growth Path Forward",
      "reviewer": "Ayesha Nasir (Self-Identified)",
      "title": "Q1: Assess CSAT/Audit Scores and Optimize Operations Efficiency",
      "quote": "Obviously Q1 I wanted to, my plan is assessing CSAT audit scores, understanding the operations deliverables or to operations efficiency. I do assess my data from survey scores and joint audits and whatever feedback client gives to us, I want to make sure we're optimizing our operations with that feedback.",
      "action": "Q1 2026 operational optimization: (1) Systematic review of CSAT scores, joint audit results across all 8 Westinghouse sites, (2) Identify patterns - which sites performing well, which need attention, (3) Use client feedback to drive operational improvements, (4) Document operational deliverables vs expectations, (5) Create efficiency improvements based on data, (6) Share learnings across portfolio",
      "source": "Transcript"
    },
    {
      "category": "Expansion Strategy",
      "reviewer": "Ayesha Nasir (Self-Identified)",
      "title": "Q3-Q4: Focus on Expansion Opportunities",
      "quote": "Q3 and Q4, focusing on expansion.",
      "action": "Expansion planning: (1) While Westinghouse 'at our limit' with only 'minute opportunities like $4K here, tiny site there,' continue exploring, (2) Canadian opportunities previously declined - reassess if circumstances changed, (3) More likely: transition support leading to new large account ownership, (4) Valarie: 'I think what will happen is you will transition a site, fall in love with customer, say these are my people, I want to stay here. Guaranteed,' (5) Be ready when big account opportunity arises - skills built through transitions are preparation",
      "source": "Transcript"
    },
    {
      "category": "Transitions Support - 2025 Learning",
      "reviewer": "Ayesha Nasir (Self-Identified)",
      "title": "Apply 2025 Transition Learnings (Logan, Kim, Justin, Lanza)",
      "quote": "Last year I supported Logan's account. I supported Kim's account at Leslie. I supported in operations the account for Boeing for Justin. So I learned a lot and I used a lot of stuff I've learned in 2025 into every area that I go. We're having successful Lanza transition, go live is Monday, February 2nd.",
      "action": "Transition excellence documentation: (1) Document lessons learned from supporting Logan (account transitions), Kim (Leslie operations), Justin (Boeing operations), Lanza (transition go-live Feb 2, 2026), (2) What worked well? What would you do differently?, (3) Create transition playbook based on 2025 experiences, (4) Use this to train MITs when hired, (5) Demonstrate to Troy what successful transitions team could look like based on real examples",
      "source": "Transcript"
    },
    {
      "category": "Leadership Recognition & Future Potential",
      "reviewer": "Kyle Wallace & Valarie Barnett",
      "title": "Leverage Strengths - Run Through Brick Walls Mentality",
      "quote": "Kyle: 'Your ability to get things done is really impressive for your tenure. Way you're able to get through doors and get past admins and get to right people and talk to right people and deliver information is uncanny. You could be very successful in transitions... do something with Troy probably never been done... your ability to run through brick walls and get things done. Absolute pleasure to work with you and mentor you.'",
      "action": "Career development focus: (1) Kyle's identified strengths: gets things done, willingness to do plus 20%, solves problems before asked, gets past gatekeepers, talks to right people, runs through brick walls, (2) Valarie: 'Every time - what's she doing? What big account is she on? Has she relocated yet?', (3) Mike Prettyman foundation: 'Exceptional on the ground training from Mike Prettyman. Really got you quickly through crawling stage,' (4) Career trajectory: transitions → big account → continued growth, (5) Mentorship: pay it forward - 'Bring somebody in, Ayesha. Can we hire somebody else? You have friend like you? We'll take them. Goal is to continue to pay it forward,' (6) Kyle's vision: 'Really good, promising future ahead of you'",
      "source": "Transcript"
    },
    {
      "category": "Personal Philosophy",
      "reviewer": "Ayesha Nasir (Self-Identified)",
      "title": "Maintain Failure Is Not An Option Mindset",
      "quote": "Personal goals: I just want to be a better leader, speaker, presenter and for me failure is not an option.",
      "action": "Continue growth mindset: (1) 'Failure is not an option' attitude that saved Columbia SC site, (2) Kyle's test: 'Do you want to have that conversation with Val that you're losing this account?' Response: 'Absolutely not,' (3) This mentality drove 3-month boots-on-ground blitz, creative problem-solving, and account save, (4) Balance: high standards for self while being realistic about challenges, (5) Continue learning - Ayesha: 'Level of learning curve and stuff I've learned, I could have never imagined in another position in another company. I do appreciate you guys a lot'",
      "source": "Transcript"
    }
  ],
  "Michael Barry": [
    {
      "category": "Personal Goals - URGENT: SMART Framework",
      "reviewer": "Valarie Barnett",
      "title": "Reply to Meeting Invite with SMART Personal Goals to Avoid Zero Credit",
      "quote": "I don't want to give you zero on your personal goals. Right now you're scoring so high that I feel like I'll wait, but I don't want you to not get the credit. Reply to the invite with your goals. Your bullet points in looking forward are great initiatives, but I need specific, measurable, achievable, relevant, and time-bound personal goals. When will you achieve something by? How is it impactful?",
      "action": "URGENT: Create and submit SMART personal goals via email reply: (1) Specific - what exactly will you accomplish, (2) Measurable - how will you track progress/success, (3) Achievable - realistic within 2026, (4) Relevant - ties to AD role, (5) Time-bound - Q1/Q2/Q3/Q4 deadlines; Examples: Develop #2 person to specified capability by Q2, maintain KPI performance at 2025 levels through Q4, expand autonomous equipment pilots by Q3, secure additional Novartis service lines by Q2",
      "source": "Transcript"
    },
    {
      "category": "Succession Planning - #2 Development",
      "reviewer": "Valarie Barnett",
      "title": "Develop Strong #2 Person - Passionate Problem Solver Like Mike",
      "quote": "Valarie: 'Who's your #2, Mike?' Mike: 'That's a great segue into my looking forward once we get there - develop strong #2 to support some of my current responsibilities.' Valarie: 'My challenge to you is that number two person. When will you have your number two person trained up by and they've got to be passionate and excited and a problem solver like you. They may have to work under you for six to nine months, right?'",
      "action": "Number 2 development plan with timeline: (1) Identify candidate - passionate, problem solver, excited to learn Mike's approach, (2) 6-9 month training period under Mike's direct mentorship, (3) Gradual responsibility transfer: shadow phase, supported autonomy, independent execution, (4) Document Mike's methodologies: 18-month RFP prep, outcome-based model implementation, union negotiation approach, customer relationship management, (5) Goal: Mike freed up for additional strategic responsibilities or new accounts, (6) Include in SMART goals with specific timeline; Valarie: 'Novartis and BMS are not the end all be all for you. You can do more. You're fully capable and you've proven that.'",
      "source": "Transcript"
    },
    {
      "category": "Mentorship Expansion",
      "reviewer": "Dan Hartman, Valarie Barnett & Marvin Owens",
      "title": "Formalize Mentorship Program - Always Have 1-2 People in Development",
      "quote": "Dan: 'Your bullet point on personal growth #3. That's Tom right now. I'm gonna kick him over to you. Start mentoring him for me.' Valarie: 'You should always have a group of one to two people that you're constantly mentoring, one existing and one brand new. When we want somebody to be great site manager, we send them to Scott. Same holds true with you. Everyone should understand this is what it looks like.'",
      "action": "Structured mentorship program: (1) Always have 1-2 people in active mentorship: one existing (mid-development), one brand new (foundation building), (2) Tom (Amgen) - Dan's request to help with challenging savings targets and JLL performance, leverage Mike's BMS/Novartis experience, (3) Corey - Marvin mentioned rolling up through Mike's structure before Geico move, (4) Melissa's request: 'Why am I struggling to find MIT for Eli Lilly when we have someone who can just create one for me, Mike?', (5) Document mentorship approach: Mike: 'I feel like I've been able to expedite their growth in pretty short window. That's where my skill set and experience lends itself as well as overcoming challenging savings targets,' (6) Create pipeline: identify high-potential managers, rotate them through Mike's portfolio for training",
      "source": "Transcript"
    },
    {
      "category": "Tom Amgen Support",
      "reviewer": "Dan Hartman",
      "title": "Engage with Tom on Amgen - Challenging Savings Targets with JLL",
      "quote": "Dan: 'I'd really like to leverage you and get you engaged with Tom on Amgen. I'm a little too jaded by the thing I've been attached to for too long. He's going to be up against some really challenging savings targets with JLL and performance. We could schedule a visit because you are doing great stuff here. I roll my eyes when I say savings at this point, which isn't good.'",
      "action": "Amgen savings support: (1) Schedule site visit with Tom and Dan to review Amgen challenges, (2) Share BMS/Novartis playbook: outcome-based model, equipment innovation, union negotiation, consumable takeover, centralized trashing expansion, (3) Conduct operational review: where are efficiencies?, what's scalable?, financial model validation, (4) Mike: 'There are additional savings expectations for Novartis for 27 and 28. So I'm already thinking about what we're going to end up doing. Happy to discuss with Tom. I'm sure it's something I've seen at some point,' (5) Provide Dan fresh perspective vs his jaded view, (6) Timeline: Q1 visit and assessment",
      "source": "Transcript"
    },
    {
      "category": "Novartis Direct Relationship Development",
      "reviewer": "Mike Barry (Self-Identified)",
      "title": "Strengthen Novartis Direct Relationship & Expand Service Lines",
      "quote": "Establish strong rapport with new Novartis Direct customers, that's something we went live with January 1st to really strengthen overall relationship. Work with new Novartis Direct model to see if there's additional service lines we can get that we can take on.",
      "action": "Novartis relationship building: (1) Q1-Q2: Strengthen rapport with new direct contacts at Cambridge and East Hanover (went live Jan 1, 2026), (2) Identify additional service line opportunities beyond custodial + consumables, (3) Critical context: 'CBRE just got put out to bid for hard services... very interesting to see what this account looks like in six months. Novartis anticipates making their award sometime middle of February,' (4) Threat: 'ABM is in running for hard service and I'm sure they're going to try to bundle their services,' (5) Defense strategy: strengthen direct relationship, expand SBM service offerings, position as comprehensive partner vs single-service vendor",
      "source": "Transcript"
    },
    {
      "category": "ABM Bundling Threat",
      "reviewer": "Mike Barry (Self-Identified)",
      "title": "Monitor and Defend Against ABM Bundling at Novartis Hard Services RFP",
      "quote": "CBRE just got put out to bid for hard services at Novartis. ABM is in running and I'm sure they're going to try to bundle their services. Something we'll need to stay aware of. There's still chance CBRE retains it. I think JLL is also down selected. Novartis anticipates making their award sometime middle of February.",
      "action": "Competitive defense strategy: (1) Monitor Novartis hard services RFP - award expected mid-February, (2) ABM threat: likely to bundle custodial with hard services to displace SBM, (3) Best outcomes: CBRE retains (existing relationship), JLL wins (IFM partner), (4) Worst outcome: ABM wins and bundles services, (5) Mitigation: strengthen SBM direct relationship, deliver exceptional Q1 performance, expand service lines to increase switching cost, position as specialized partner vs commodity bundler, (6) Stay close to decision-makers, understand evaluation criteria, (7) If ABM wins: negotiate to retain SBM as specialist vs bundled commodity service",
      "source": "Transcript"
    },
    {
      "category": "Q1 Initiatives",
      "reviewer": "Mike Barry (Self-Identified)",
      "title": "Complete Q1 Scorecard Updates, Route Refinements & Corrigo Integration",
      "quote": "Update site scorecards to reflect new KPIs and their associated weights from RFP. They're both in development on JLL side and Novartis side. Goal would be to create some additional collaboration with scorecard reviews. Refine outcome based cleaning routes and adjust way station locations based off of usage patterns we see on site. Expand For Insight integration with Corrigo for more streamlined operation while creating better analytics.",
      "action": "Q1 operational enhancements: (1) Scorecard updates - complete within 2 weeks per Mike's timeline, align with new KPI weights from RFP, create collaboration opportunities in reviews, (2) Route optimization - refine outcome-based cleaning routes based on actual usage patterns observed, adjust way station locations for efficiency, (3) Corrigo integration - expand For Insight/Corrigo integration (Dan praised this), streamline operations, create better analytics for customer presentations; Mike noted integration 'been a little slower than anticipated, but it's not on our end, it's their end. So I'm OK with that.'",
      "source": "Transcript"
    },
    {
      "category": "Q2 Initiatives",
      "reviewer": "Mike Barry (Self-Identified)",
      "title": "Pilot Autonomous Equipment & Develop Sustainability Programs (Durable Coffee, Lab Recycling)",
      "quote": "Q2: Look to identify opportunities to pilot some autonomous equipment. JLL has hinted that they will need some support in realm of sustainability once they get through their transitional activities. Two items we're potentially looking at would be durable coffee program as well as some additional opportunities within lab space in terms of recycling. Sue already has idea of what they're potentially looking at.",
      "action": "Q2 innovation roadmap: (1) Autonomous equipment pilots - identify opportunities with JLL (continuing equipment innovation success like 50% vacuum labor reduction), (2) Sustainability support - JLL indicated need post-transition phase, work with Sue on: durable coffee program implementation, lab space recycling enhancements, (3) Valarie's note on earlier sustainability slide: 'That's a best practice. Ensure there is monthly JLL meeting on sustainability. Sue probably hosts that meeting. You might want to double check she's recording that value out,' (4) Position SBM as sustainability partner beyond just cleaning",
      "source": "Transcript"
    },
    {
      "category": "Year-End Initiative",
      "reviewer": "Mike Barry (Self-Identified)",
      "title": "Develop Tiered Service Model Framework for Novartis 5% Year-Over-Year Savings",
      "quote": "End of year discussion around implementation of tiered service model for Novartis. There's obligation for us to drive 5% year over year savings for 27 and 28. We agreed during RFP process that we would work with site leads on creating framework of tiered service model towards end of this year. That's one of other items that will get some of our time and attention.",
      "action": "Tiered service model development: (1) Contractual obligation: 5% year-over-year savings for 2027 and 2028 at Novartis, (2) Q3-Q4 2026: Work with site leads to create tiered service framework, (3) Allow customer to choose service levels based on needs vs one-size-fits-all, (4) Balance cost reduction with service quality options, (5) Learn from 2025 outcome-based model success (9% savings with quality improvement), (6) Similar to how Mike anticipated outcome-based model becoming 'the new norm,' position tiered model as next evolution",
      "source": "Transcript"
    },
    {
      "category": "Leadership Recognition",
      "reviewer": "Valarie Barnett, Marvin Owens, Mike Jedan",
      "title": "Continue Excellence - Recognized as Tight Ship Leader",
      "quote": "Valarie: 'Mike, you clearly have executive presence. You speak extremely confidently. You know your account. You tell story effectively. You are organized, detailed, driven. You take on challenges, solve problems. You leave us out of it. Very rarely lean on executive team for support. If you call me and need help, it's truly something probably not possible. If there's a way, I feel like you figure it out. You're fully capable.' Marvin: 'I appreciate how well you take ownership. If it's in your hands we know it's good from cradle to grave. Since you've taken over, we haven't had any noise out of those two accounts.' Valarie: 'Everyone should understand like this is what it looks like. You are organized, structured. You're on tight ship.'",
      "action": "Continue operational excellence: (1) Maintain cradle-to-grave ownership philosophy, (2) Keep accounts 'off the radar' through proactive problem-solving, (3) Document approaches for mentorship replication, (4) Valarie's challenge: 'You can do more. You've proven that. Novartis and BMS are not the end all be all,' (5) Mike Jedan: 'I think opportunity here is for you to identify what you need to go to next level. I would like to see some professional development items identified,' (6) Career trajectory: develop #2, expand mentorship, potentially take on additional strategic accounts when ready",
      "source": "Transcript"
    }
  ],
  "Dustin Smith": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Transition from Problem-Solver to Coaching Leader",
      "quote": "Developing the coaching leadership capabilities. What I really want to try to focus on is moving from being a direct problem solving helper to more of a coaching first leadership style. I find myself in the weeds and really struggling to pull up to that strategic level. By the end of March, I want to have an implemented monthly coaching cadence with direct reports and an individual development plan for each one of my direct reports.",
      "action": "MARCH 2026: (1) Implement monthly coaching cadence with all direct reports, (2) Create individual development plan (IDP) for each direct report, (3) Stop jumping into weeds as first instinct - coach others to solve problems, (4) Valarie: 'I'm gonna hold you to that. Please do because this is where you need to go, Val, because I will quickly jump into the weeds.' (5) Develop next level of leaders vs doing work yourself, (6) Take strategic step up while team takes operational step up",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Dustin Smith (Self-Identified)",
      "title": "Expand Strategic Thinking - 2-3 Year Distribution Roadmap by June",
      "quote": "Expanding strategic thinking and long-term planning. I find myself looking at what's happening this week, next week, towards the end of the year. But really with a brand new vertical, I've got the opportunity to set up a two to three-year plan. By June I'm looking to have a two to three-year distribution road map from a capabilities, from a client targeting perspective and I'll be really working on that with Rebecca as she comes online as well.",
      "action": "JUNE 2026: (1) Develop 2-3 year distribution roadmap with Rebecca, (2) Capabilities planning: what do we need to win?, (3) Client targeting: who do we pursue and when?, (4) Align growth with operations capacity, (5) Move from weekly/monthly thinking to multi-year strategic planning, (6) Set vertical direction vs just managing current accounts",
      "source": "Transcript"
    },
    {
      "category": "Time Management & Prioritization",
      "reviewer": "Dustin Smith (Self-Identified)",
      "title": "Leadership Battle Rhythm Optimization - Own the Calendar",
      "quote": "Leadership battle rhythm optimization is what I'm calling it. That's a fancy way of saying that my calendar owns me. I don't own my calendar. I think the important piece here is to really do the other two things I need to be able to set time aside to focus on strategic initiatives and prioritizing what's important. Keith talked about setting up the 15 minute daily calls that we have with the OPS team. Those are all important, but really taking a look at all of the meetings that we have and everything that we have in front of us and prioritizing and establishing a true leadership guidance for our leadership battle rhythm for the account leaders and making sure we're sticking to it and starting to manage our calendar versus letting the calendar manage us. It's a lofty goal, but I'm gonna try.",
      "action": "Ongoing: (1) Audit all recurring meetings - which are essential vs nice-to-have?, (2) Block strategic thinking time on calendar as protected time, (3) Establish leadership battle rhythm guidance for account leaders, (4) Prioritize based on strategic value vs urgency, (5) Create calendar management discipline, (6) Balance operational touchpoints (15-min daily calls) with strategic work time, (7) This enables other two goals - can't coach or think strategically if calendar-driven",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Technology",
      "reviewer": "Dustin Smith (Self-Identified)",
      "title": "Roll Out Mobile + AI Verification at Phoenix 11 and Tempe",
      "quote": "We're also going to roll out mobile or we have mobile rolled out on the JLL side, but we are going to roll out AI verification. We're going to do that at Phoenix 11 and Tempe marketplace.",
      "action": "Q1 2026: (1) Implement AI verification at Phoenix 11 and Tempe, (2) Document results and lessons learned, (3) Determine scalability across JLL portfolio, (4) Tie to Amazon's data transparency requirements, (5) Measure impact on quality, client visibility, operational efficiency",
      "source": "Transcript"
    },
    {
      "category": "Sustainability & Client Requirements",
      "reviewer": "Valarie Barnett",
      "title": "Green Spend Project - Align to Sue Bea's Requirements by March",
      "quote": "Valarie: 'Does your Green spend March JLL align to Sue Bea's her requirement for Green spend?' Dustin: 'Yes, so the so her green spend analysis piece is due prior to this. The reason I have March on here is because a lot of this is, hey, when we're done with these paper products, we're ordering these. So it's really just through attrition that some of these items will get changed over.'",
      "action": "MARCH 2026: (1) Complete green spend product identification and replacement planning (due before Sue Bea's analysis), (2) Phase out non-green items through depletion/attrition, (3) Order green replacements as current stock depletes, (4) Track green spend percentage improvement, (5) Align to JLL's sustainability goals and Sue Bea's corporate requirements, (6) Document savings/cost impact of green products vs conventional",
      "source": "Transcript"
    },
    {
      "category": "People & Culture",
      "reviewer": "Dustin Smith (Self-Identified)",
      "title": "Management Process Enhancement - Bring Site Managers to SBM Standard",
      "quote": "Management process enhancement and standardization. Like I said previously, we took on a lot of incumbent managers, external hires, nobody with a lot of SBM stink on them. This is really doing a deep dive training and making sure that we're bringing our site managers up to the SBM standard as quickly as possible. This is an ongoing effort. Last month we focused on quality and quantity of audits and I think if you were to go back and look in ForSight, there was a tremendous uptick in late December through January compared to previous months. So really the idea is we're going to take different processes, different focus items or KPIs and really do a push to drive that up to the SBM standard.",
      "action": "Ongoing: (1) Monthly focus areas for site manager development (January = audits - already showed 'tremendous uptick'), (2) Deep dive training on SBM standards vs incumbent practices, (3) Measure improvement month-over-month in ForSight, (4) Rotate through different KPIs/processes each month, (5) Document 'SBM standard' for each process area, (6) Goal: Transform incumbent/external hires into SBM-caliber site managers within 12 months",
      "source": "Transcript"
    },
    {
      "category": "Presentation & Communication",
      "reviewer": "Valarie Barnett",
      "title": "Progressive Actions and Mile Markers for 2026 Vision",
      "quote": "Valarie: 'I want to see you guys flush those out and then like what are our mile markers so Dustin. Every time we meet, you almost should have a separate sheet where all you're talking about is your 2026 vision and your personal goals and how close are we? What are the things that we've done to take strides towards those things?'",
      "action": "Every 1-on-1 with Valarie: (1) Create separate tracking sheet for 2026 vision and personal goals, (2) Report progress on: coaching cadence, 2-3 year roadmap, calendar management, (3) Identify mile markers: what's the next 3 things to do?, (4) Measure: how close are we to each goal?, (5) Document specific actions taken since last meeting, (6) Hold yourself accountable with visible progress tracking",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence",
      "reviewer": "Valarie Barnett, Nicole Ouimet",
      "title": "Continue Excellence in Presentation and Executive Presence",
      "quote": "Valarie: 'Dustin, you do a really good job typically controlling the room, controlling your customer and you come very well prepared with what you're going to say. You're well spoken. You remain calm.' Nicole: 'Dustin, I've worked a whole ton with you over the years. I thought you guys did an excellent job.' Valarie: 'Clear and confident communicator with a structured and logical flow. Able to tell a concise story on your account with an executive presence.'",
      "action": "Continue strengths: (1) Maintain preparation discipline - come ready with structured story, (2) Continue calm, controlled presence in high-pressure situations, (3) Leverage executive presence to support Keith's development in this area, (4) Use these strengths to mentor team on client communication, (5) Apply presentation skills to 2-3 year roadmap development with executives",
      "source": "Transcript"
    }
  ],
  "Keith Deuber": [
    {
      "category": "Equipment Management - URGENT",
      "reviewer": "Keith Deuber (Self-Identified)",
      "title": "Equipment Gap - Wrong Equipment Choice (Scrubbers vs Sweepers)",
      "quote": "Just to say it frankly, we chose the wrong piece of equipment coming into the account. That's no one's fault. As we're moving through Amazon, as we're maturing within Amazon, we're learning more and more what we need is staffing equipment. What we're dealing with with the current sites is the right on equipment. I think that's the biggest challenge we have being that with the amount of dust, cardboard debris, you know, anything you can think of from a warehouse perspective, we really need sweepers. Sweeper scrubbers or sweepers and when we went into this originally we focused on scrubbers. Scrubbers don't necessarily pick up debris which it gets clocked up. It gets there's a lot of issues when it comes to downtime with scrubbers in a warehouse setting. And so it's truly causing a challenge when it comes to operation and we saw it during peak big time.",
      "action": "Q1-Q2 2026: (1) Work with procurement on existing sites + idle asset list, (2) Bill Darlington assessing equipment at warehouse, (3) Swap out scrubbers for sweepers at current sites, (4) Create equipment list for upcoming sites - 'Know which ones we need for which site types,' (5) Ready to order correct equipment when capturing new sites, (6) Lessons learned: warehouse = debris/dust = sweepers; offices = floors = scrubbers, (7) Peak proactive response: had 10+ equipment rental agencies ready, got equipment same/next day - maintain this contingency approach",
      "source": "Transcript"
    },
    {
      "category": "Recruiting & Staffing",
      "reviewer": "Keith Deuber & Dustin Smith (Client's #1 Concern)",
      "title": "Recruiting Delays During High Volume Events - Need Dedicated Recruiters",
      "quote": "Keith: 'Start this off by saying our recruiters are good. They're not bad. I think with the demand during HV high volume events being prime peak, it stretches them extremely thin, which causes a lot of delays in staffing.' Dustin: 'I would say this is his or their biggest concern, right. Like if you had to say the one thing that we need to improve upon, it's the ability to staff up, staff down, whether it's during high volume events or just we've got turnover. I think this is where we can show the best improvement for the client.'",
      "action": "Long-term solution: (1) Dedicated recruiters for Amazon account vs shared resources - 'In order to run this as we grow in order to run during high volume events even scaling up during growth, it's going to be key to take a look at dedicated recruiters that can spend from 6:00 AM their entire day on Amazon rather than being pulled in different directions,' (2) Short-term bridges: bi-weekly recruiting calls with site teams and recruiting (accurate opening count), (3) Centralized faces and spaces document updated weekly, (4) Proactive hiring: identify employees being written up - 'Hire to those positions rather than waiting till they're gone and it takes two or three weeks for a new hire to get in,' (5) CLIENT'S BIGGEST CONCERN per peak debrief with Mark - must show improvement here",
      "source": "Transcript"
    },
    {
      "category": "Quality & Risk Management",
      "reviewer": "Keith Deuber (Self-Identified)",
      "title": "Proactive Site Assessment Gap - High Performers Suddenly Face PIPs",
      "quote": "When I say this, it's based upon feedback and experience over the past year and it's referring to we have sites that are doing really well, 95 plus for months on end and then next thing you know the Amazon changes in SPM, RPM walks the site, VP comes in, does a visit and then we're fending off a pip. What this is stemming from is that once we see a site that's scoring well, we take our foot off the pedal. Oh, it's perfectly fine. It's good. We don't need to worry about it. And then we're playing catch up and being reactive.",
      "action": "Q1 2026 ROLLOUT: (1) Revamped TQM process tailored to Amazon, (2) Monthly assessments: operations, building condition, processes, (3) Account team owns process, R&D team executes, (4) Keith: 'Old TQM process worked now. It's just I don't think we did it enough and I think there was too many lines on it. So this is scaled down version identified and really strategically implemented,' (5) Goal: Identify gaps BEFORE RPM/VP identifies them, (6) Prevent complacency on high-performing sites, (7) Valarie: 'You'll pilot this and then you'll let us know. Specifically me, you'll let me know... this will work'",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Technology",
      "reviewer": "Keith Deuber & Dustin Smith",
      "title": "Mobile Rollout + Service Verification - Amazon Pilot",
      "quote": "Keith: 'Mobile rollout and service verification. I know this was previously approved and we are going and executing the pilot for three sites, two AR sorts which are our largest, probably our toughest implementation sites so we can finalize the process and how to implement this for Amazon and one TNS site. Specifically we're going to focus on bathrooms and break rooms. Ultimately data sharing transparency is what we're going for. They want to see it. They're asking for it.' Dustin: 'We did talk during our lessons learned conversation with Mark specifically about the service verification and he was very excited about this. He actually pushed us into taking on GYR1 in Phoenix and do it at an AR sort as well. So the client is very interested in seeing how this unfolds.'",
      "action": "Q1-Q3 2026: (1) Three-site pilot: 2 AR sorts (largest/toughest) + 1 TNS, (2) Focus: bathrooms and break rooms, (3) Client pushed for GYR1 Phoenix inclusion, (4) Goal: Data sharing transparency - 'They want to see it. They're asking for it,' (5) Amazon's Project Nexus: 4-year project to do this themselves - SBM goal is to beat them to it, (6) Valarie question: 'Will they pay for it?' - Dustin: Not in pilot phase, but potentially at renewal if major differentiation shown, (7) Rob Morrison emphasized data sharing - 'They're OK providing room book uplifts. We just need to show them the data that says we need it,' (8) Pilot → rollout → position as differentiation for renewal",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Technology",
      "reviewer": "Keith Deuber (Self-Identified)",
      "title": "Real-Time Equipment Health and Utilization - QR Code System",
      "quote": "Implementing QR code based check in, check out process for the equipment again challenge there is the downtime for the equipment with with service coming on site. Putting QR codes on the machines, check in, check out, being able to identify yellow and red, meaning if a machine's down or if it needs consumables on it or whatever the case may be, but also tracking downtime is going to be beneficial to both operations and procurement.",
      "action": "2026: (1) QR codes on all equipment for check-in/check-out, (2) Track equipment health: green/yellow/red status, (3) Identify: machine down, needs consumables, maintenance required, (4) Track downtime data for operations decisions, (5) Support procurement with utilization data, (6) Ties to equipment gap challenge - prevent downtime with better tracking, (7) Complements peak strategy of having rental equipment ready",
      "source": "Transcript"
    },
    {
      "category": "People & Culture",
      "reviewer": "Keith Deuber (Self-Identified)",
      "title": "Operational Excellence Workforce Development - MIT University",
      "quote": "Operational excellence to workforce development. We already talked about TQM process, but also creating an Amazon aligned MIT University essentially. We've identified a few sites that we're going to have MIT University. Those would be identified Amazon, Amazon led or Amazon account based people for growth and for other sites if we do a turnover, but then also identifying an Amazon site that we can bring Val's MIT's too and spend 2 weeks there to really understand operations and the processes of which we perform.",
      "action": "2026: (1) Create MIT University at identified Amazon sites, (2) Amazon-specific training for SBM MIT program candidates - 2 weeks on Amazon site, (3) Train Amazon account-based people for growth and backfill, (4) Bring Valarie's MIT candidates to Amazon for 2-week immersion in operations and processes, (5) Build Amazon pipeline for growth, (6) Develop next-gen leaders with Amazon operational DNA from start",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Keith Deuber (Self-Identified with Valarie/Nicole Praise)",
      "title": "Presentation and Executive Storytelling - Drive vs Support by May",
      "quote": "Keith: 'Throughout my career I've been kind of the color commentator where I would partner with an executive like Dustin and we put together a presentation, but he would drive the presentation and putting it together and I would provide the color commentary. By the end of May, I really want to get to a point where I can drive that because I feel like I can do it, but I've not done it yet because I've always been the color commentary.' Valarie: 'Today's presentation was a huge step for you, Keith, in the right direction. You had your own section, which was independent of Dustin's section. You're actively working on it.' Nicole: 'Keith, your personal goals that you laid out is probably the best that I've seen anyone layout.'",
      "action": "MAY 2026: (1) Structure executive story development plan with Dustin as mentor, (2) Lead next presentation instead of supporting, (3) Valarie already noted progress: 'You had your own section today,' (4) Build on strengths: 'Keith, you come really strongly with the operational support. I feel almost every time you talk like if you said it, then it's facts,' (5) Practice driving narrative vs providing color commentary, (6) Leverage Dustin's strengths (controlling room, preparation) through mentorship, (7) Nicole: 'Lots of presentations I'd done with you... where I have led it, but you've been the supporting cast member. If you say it for operations, it's fact. No one's going to question you at the table'",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Keith Deuber (Self-Identified)",
      "title": "Driving Strategic Initiatives to Completion - Stay Out of Weeds",
      "quote": "Keith: 'I'm a visionary in terms of what we need to get done and what we need to implement. But I don't always see it to the end. I think part of that is my deep involvement within operations and getting pulled multiple different directions. There's going to be two things here. One, which is I hire people that can do the job. I need to let them do the job. And it's not so much micromanaging, it's more so I'm in the weeds, which is causing a conflict with my prioritization of the strategic initiatives. The strategic initiatives that we have set are extremely important to put us in position for extreme growth going into 2027 or 2026 2027.'",
      "action": "MARCH 2026: (1) Establish personal prioritization framework with Dustin's mentoring, (2) 'Hire people that can do the job. I need to let them do the job' - delegate operations vs being in weeds, (3) Protect strategic initiative time from operational firefighting, (4) Critical: TQM rollout, mobile/service verification, MIT University, equipment gap - these set up 2026-2027 growth, (5) Trust Bill, Sam, Kathy to handle operations - Keith shifts to strategic, (6) Balance: operational expertise is strength, but can't let it pull from strategic work",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Keith Deuber (Self-Identified)",
      "title": "Build and Evaluate Personal Leadership Brand - Learn to Sell Yourself",
      "quote": "Keith: 'I suck at taking credit for anything that our team does. By the end of April establish a brand plan outlining the key attributes to what I do well throughout SBM. It's something that needs to happen. I feel extremely uncomfortable doing it, but in order to take that next step, I really need to figure out how to and learn how to sell myself in quote unquote.' Valarie: 'Thank you for your vulnerability and transparency. Like I feel like these are really honest goals, really good goals.'",
      "action": "APRIL 2026: (1) Establish brand plan: what are Keith's key attributes?, (2) Document wins and team accomplishments - take credit appropriately, (3) Learn to 'sell myself' despite discomfort, (4) Valarie: 'I appreciate that. You're saying this is what I want to work on, you're actively working on it,' (5) This enables next career step - can't advance if leadership doesn't know what you've accomplished, (6) '11 years and I've been operating... cleaning toilets and really getting my hands dirty. I'm in a space where I need to take the next step to the next level'",
      "source": "Transcript"
    },
    {
      "category": "Communication & Data",
      "reviewer": "James Peate",
      "title": "Add Measurable Impact and Data to Validate Claims in Presentations",
      "quote": "James: 'Two development areas. These aren't, these are ones that were addressed in the voiceover, but I think would have been helpful if there was more measurable impact and data to prove out, prove the outcomes and validate the claims on some of the slides. You did talk through it all, so I didn't have any questions as you went through, but it could be something that comes through in the visuals for people that maybe aren't listening to the narrative.'",
      "action": "Future presentations: (1) Add measurable data to slides (not just voiceover), (2) Quantify outcomes: 93.3% average, zero PIPs, 12-15 racks/day vs 3, 45-min break room cleaning, (3) Make visuals self-explanatory for people not listening to narrative, (4) Validate claims with data on slides themselves, (5) Balance operational detail (strength) with executive-level metrics (development area)",
      "source": "Transcript"
    },
    {
      "category": "Communication & Data",
      "reviewer": "James Peate",
      "title": "Clearly Identify Problem Statements in Innovation Slides",
      "quote": "James: 'The other area which again was addressed in the voiceover and the practical example in the innovation slide. When I first looked at that, I wasn't 100% clear what the problem statement was solving for was. There was some solutions and benefits and outcomes, but no clearly identified problem statement. And again, you said it in the voiceover, but could be something helpful that's in the visuals depending on who's in the room and who we will be looking at these types of presentations after.'",
      "action": "Future presentations: (1) Innovation slides need clear problem statement first, (2) Structure: Problem → Solution → Benefits → Outcomes, (3) Example: Problem = 'Under-rack cleaning taking 3 months, causing failures' → Solution = 'Blowers' → Outcome = '12-15 racks/day, monthly cadence,' (4) Make problem visible on slide (not just voiceover), (5) Helps audience understand context without narration",
      "source": "Transcript"
    },
    {
      "category": "Communication & Data",
      "reviewer": "Nick Viskovich & James Peate",
      "title": "Develop Written Narrative Capability for Amazon (Not Just Slide Decks)",
      "quote": "Nick: 'Key to unlocking executive sponsorship and growth is really being able to effectively tell your data, tell your story, both with data and anecdotes across the portfolio. One thing we're going to want to do to be effective communicators, especially with the audience here, is understand how to pull that into a written narrative with that data and the anecdotes that helps unlock that because that's how everything is digested and shared internally. A good presentation and slide deck is really helpful in this environment and I realize that's really how SBM communicates. Amazon, it's much more about the written narrative. The written narrative is the language of business there. Lean on James and myself to distill the work you're doing into those sound bites that are able to really show your work and educate the Amazon team on why we are a partner that can scale with them.'",
      "action": "Ongoing: (1) Learn Amazon's written narrative communication style (vs SBM's slide deck style), (2) Combine data + anecdotes in written format, (3) Work with Nick V and James to distill work into written sound bites, (4) Written narratives = how Amazon digests and shares information internally, (5) Develop playbooks that scale across portfolio with written narrative format, (6) QBRs coming up: opportunity to practice written narrative with Nick/James support, (7) Goal: 'Educate Amazon team on why we are a partner that can scale with them'",
      "source": "Transcript"
    }
  ],
  "Tiffany Purifoy": [
    {
      "category": "2026 Strategy & Vision - CRITICAL GAP",
      "reviewer": "Valarie Barnett",
      "title": "Add Timelines and Dates to ALL 2026 Forward Strategy Items",
      "quote": "Valarie: 'The only thing that I would change about all of this is I need a road map. How are you gonna get there? What are you gonna do? Where are your dates? By when? So all of those need to be flushed out. If it's for insight management, what specifically and by when? Align for insight to CBRE metrics, I don't know that you're going to be able to do that. Be data-driven. OK, what does that mean? Define it be data-driven. How are you going to review for insight every day to check complaints? Different behavior from the site managers, from the regional team, weekly calls. What are you going to do to be data-driven and by when? Recordable free, obviously, but what are you going to do? So is there a safety plan that you have in play? Are you doing safety rewards across your accounts? How will you do it?' Valarie (later): 'A goal without a date is just a wish. So I don't want you to wish for it. We got to work towards it. In our one-on-ones, we need to be looking at your forward strategy and your personal goals. What will you do? How will you do it? And then when will you do it by? I just want to be able to hold you accountable to what you've committed to.'",
      "action": "URGENT - BEFORE NEXT 1-ON-1: (1) Create detailed road map for all 2026 strategy items with specific dates, (2) ForSight management: Define specific actions and completion dates, (3) Data-driven approach: Define what it means, how to implement (daily ForSight reviews, complaint tracking, site manager behavioral changes, weekly calls), (4) Recordable-free goal: Document safety plan, safety rewards program across accounts, (5) Each goal needs: What? How? By When?, (6) Send in body of email with slide deck, (7) Valarie: 'The hardest area that I had to score you on was the gaps in timelines and how you will execute. That was the main driver in some of those scores.'",
      "source": "Transcript"
    },
    {
      "category": "Scope Alignment - Lesson Learned",
      "reviewer": "Valarie Barnett & Tiffany Purifoy (Self-Identified)",
      "title": "Proactive Scope Alignment from Day 1 of Transition",
      "quote": "Valarie: 'So that's your lesson. That's your lesson learned, right? This is your job as the account director. Like you have to jump in there. You own the scope gaps, you own whatever we negotiated. You're stuck with it. In order to build the best client relationship going in right off of a transition, the first thing I would do is sit down align. Do we 100% agree on scope? Do we agree on frequency? Do we agree on quote unquote the contract headcount? Do we agree on how we're scoring ourselves? Do we agree on taking surveys, walking together? All that stuff is supposed to be the baseline of what happens.' Tiffany: 'If we were aligned on those things from the beginning, I think the moment of I don't want to say tension, but not being in alignment would have dissipated sooner, which would have impacted maybe higher I perform score scoring from Q2 and maybe not taken. While you see a gradual move here from Q2 to Q3, you'll see 2.55 to 2.97 to 3.34. My decision making and adjustments need to occur faster.' Tiffany (on what stopped her): 'In the beginning, well one giving grace for the transition... after that I leaned too heavily on our transition team in the routes and any adjustments that needed to be made when I needed to say no, this isn't working, this is the avenue that we need to take.'",
      "action": "Future transitions: (1) Day 1: Sit down with client to align on scope, frequency, headcount expectations, scoring methodology, survey process, (2) Don't lean on transition team for strategic decisions - own the account from start, (3) Act faster on needed adjustments - don't wait for gradual improvement over quarters, (4) Lesson: Fidelity took Q2 (2.55) → Q3 (2.97) → Q4 (3.34) when faster action could have started higher, (5) Don't give grace for transition - own accountability immediately",
      "source": "Transcript"
    },
    {
      "category": "Presentation Skills & Executive Presence",
      "reviewer": "Valarie Barnett",
      "title": "Rely Less on Prepared Material, Present with Confidence and Authority",
      "quote": "Valarie: 'You don't really sound like yourself to me. I don't know if you put a lot into this as far as pressure on yourself, but this isn't how you sound when we have conversations. You don't sound as confident, which I think you're reading because you don't sound as confident. Do you feel like you didn't rehearse or practice enough? Like why do you sound different today? When you talk one-on-one to me, you know your accounts backwards and forwards. So it was really hard to separate how I know you are to like how you presented today. But I have to judge you based on how you presented today. I want you to rely less on your prepared material on more on what you know. I need you to be able to present in front of me, in front of our CEO, in front of any executive leader, and confidently go through your material backwards and forwards with skill and with ease.' Valarie (in feedback): 'Overall there was a gap in your ability to confidently deliver. This is a lot of pressure but I need you to present with authority over your accounts.'",
      "action": "Ongoing development: (1) Continue Stage Academy communication classes - 'It did not show itself very well today' but keep investing, (2) Practice presenting without reading - know content so well you don't need slides, (3) Goal: Present to CEO, executives with confidence, skill, and ease, (4) Bridge gap between one-on-one confidence (where Tiffany knows accounts backwards/forwards) and presentation delivery, (5) Valarie: 'I definitely know that one of the things you want to work on is your presentation skills. I definitely feel like that's an opportunity for you. Maybe when you're in the room with a customer, you're more comfortable, you're more yourself,' (6) Work toward presenting with authority vs nervous delivery",
      "source": "Transcript"
    },
    {
      "category": "Innovation Depth",
      "reviewer": "Valarie Barnett",
      "title": "Full Assessment of Process, Technology, and Equipment Innovation Opportunities",
      "quote": "Valarie: 'The innovation for me was probably a little bit lacking. I think that we could do a better job of figuring out the value that it brings to the client, what lessons have we learned from innovation and where can we be a little bit more innovative, whether that be a process or a technology or equipment? Have you done a full assessment on that and where you would put that?'",
      "action": "2026 Innovation Assessment: (1) Full evaluation across all accounts: Schwab, Fidelity, TRP, Citibank, (2) Categories: Process innovations (like periodic task calendar, crash cart), Technology innovations (mobile, AI, automation), Equipment innovations (autonomous vacuums, salt-handling equipment demos at Lone Tree), (3) Document value brought to client for each innovation, (4) Capture lessons learned from each innovation attempt, (5) Identify gaps: where can we be more innovative?, (6) Create innovation pipeline: what's next for each account?, (7) Valarie scored innovation area lower - opportunity for improvement",
      "source": "Transcript"
    },
    {
      "category": "ForSight & CBRE Metrics Alignment",
      "reviewer": "Valarie Barnett & Tiffany Purifoy (Challenge)",
      "title": "Resolve CSAT Scoring Discrepancy - Align CBRE to ForSight or Change Approach",
      "quote": "Tiffany: 'Holding myself and my team responsible, including all of the four insight management. I really would like to work with my leaders to align for insight metrics and CBRE metrics. The reason why we need to do this is because we've had quite a few failed CSATS and it's not because we're not performing, it's because they are scoring according to CBRE metrics and not according to SBM. And despite having those conversations over and over again, we do still seem to fall back into that.' Valarie: 'But how can you get them off of that? What's the plan?' Tiffany (explained): 'Since June of last year, we explained the metrics, CADA sent over a chart of what a 1 means versus what a 5 means. Depending on who takes the survey and depending on if SBM has done everything perfect that month, we will get a three, which in their eyes is still passing.' Tiffany (solution that worked): 'I've let them know that failing a CSAT impacts the bonus of our site managers and our operations team and since then their grading scores have been more I'll say lenient. We haven't failed really any since then because they don't want to negatively impact our team.' Valarie: 'You can't change forsight to align forsight to CBRE metrics.'",
      "action": "Ongoing management: (1) Valarie is clear: Cannot change ForSight to match CBRE metrics, (2) Current solution working: Explaining bonus impact made CBRE more lenient - continue this approach, (3) Document CBRE scoring patterns: who takes survey, what triggers 3 vs 4 vs 5, (4) Proactive communication before CSAT: remind them of scoring methodology and bonus impact, (5) Consider: Can we influence who takes the survey at CBRE?, (6) Accept: Some CBRE clients will always score differently - focus on relationship management vs metric alignment, (7) Goal: Maintain current improvement (no failed CSATS since implementing bonus explanation)",
      "source": "Transcript"
    },
    {
      "category": "Executive Relationship Building",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "Deepen Direct Client Relationships While Maintaining IFM Partnerships",
      "quote": "Tiffany (2026 goal): 'Deepening my executive relationships across key customers. This is a lesson that I'm learning as we move and navigate from TRP to direct or excuse me, JLL to direct. And now we're looking at, OK, you've made all these great relationships with the IFM, but you don't have any relationship with the end user. And so now I'm looking at how can I leverage those and still remain in good grace with my current IFM because there is a hindrance there and they do frown upon direct contact and relationship. How do I go about doing that?'",
      "action": "2026 Focus: (1) Build direct relationships with end clients (TRP, Schwab, Fidelity) while managing IFM sensitivities (JLL, CBRE), (2) TRP case study: JLL losing contract - SBM bidding direct; 'I am working directly with T Rowe Price on these small projects' - continue this approach, (3) Strategy: Use project work to build direct relationships without threatening IFM, (4) More in-person client engagements: 'Common thing from our clients is more structured, I don't want to say structured, but more in person engagements. They really appreciate when you make visits out and they always offer to meet with you off-site and those are where the partnerships are strengthened,' (5) Off-site meetings: Fidelity example showed productivity of off-site discussions, (6) Balance: Don't burn IFM bridges while building direct relationships for future opportunities",
      "source": "Transcript"
    },
    {
      "category": "Succession Planning - URGENT",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "Develop #2 at Lone Tree to Eliminate Single Point of Failure Risk",
      "quote": "Tiffany: 'Developing a succession plan and accountable managers is key to any of the revenue that I look to acquire. Right now we spoke to the issue we may have over at Lone Tree and the I wouldn't say leverage that that current site manager has and putting our putting our business at risk like that is obviously not good business.' Tiffany (on Lone Tree opportunity): 'Over at our Lone Tree location, we were able to move from an RD to an AD model. Because of that, we are able to reinvest about 10K a month into our succession planning, which we need to do. We need to have a number two for our site manager that's currently in leadership there.'",
      "action": "URGENT: (1) Lone Tree site manager has leverage that puts business at risk - single point of failure, (2) Good news: RD → AD model freed up $10K/month to reinvest in succession planning, (3) Hire/develop #2 for Lone Tree site manager immediately, (4) Create succession plans across all accounts - not just Lone Tree, (5) Develop accountable managers who can step up, (6) This is prerequisite for growth: 'Key to any of the revenue that I look to acquire,' (7) Eliminate situations where one person's departure creates business risk",
      "source": "Transcript"
    },
    {
      "category": "Cost Control & Financial Management",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "Work with Matt (New Finance Manager) on Proactive Cost Tracking",
      "quote": "Tiffany (2026 goal): 'Understanding new ways to control my costs. Towards the end of Chris's tenure, I was able to see a little bit. We got a little bit more insight of some of the costs that were hitting my account where some sites went red and I couldn't understand why because labor was OK and so then some amortized cost or delayed billing or something like that would occur. So one of the things I've been working with Matt, our new finance manager and he's already put some measures and more ideas, let's say that in place to provide some more proactive communication so that you're not telling me that I'm red at the end of the month, you're able to let me know what those trends are and I can make some real time adjustments to avoid the site being red for that month.'",
      "action": "Ongoing with Matt: (1) Proactive cost communication vs end-of-month surprises, (2) Understand all costs hitting accounts: amortized equipment, delayed billing, not just labor, (3) Real-time trend visibility: identify red flags early, (4) Real-time adjustments: don't wait until month-end to discover red status, (5) Matt implementing new measures and ideas - actively participate in these, (6) Goal: Eliminate surprise red months where 'I couldn't understand why because labor was OK,' (7) Fidelity lesson: Ran red all 2025 - better cost visibility could have accelerated corrective action",
      "source": "Transcript"
    },
    {
      "category": "Sales Process Development",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "Continued Growth in Sales Process Understanding",
      "quote": "Tiffany (2026 goal): 'Continued growth and understanding of the sales process so that I am not a roadblock or hindrance to the sales process.'",
      "action": "2026 Development: (1) Learn sales process deeply enough to support vs hinder, (2) Apply to: Orlando FL pipeline ($150K monthly), TRP direct bid + HQ building, Citibank Tampa/Jacksonville, Argentina/Latin America opportunity, (3) Understand: proposal development, pricing strategy, client decision-making process, competitive positioning, (4) Goal: Be an asset in sales cycles, not a bottleneck, (5) Work with sales team to understand where ADs can add value vs where they create friction, (6) 18% revenue growth goal requires sales process competence",
      "source": "Transcript"
    },
    {
      "category": "Data-Driven Communication",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "Deliver Crisp Data-Driven Communication Tied to Business Outcomes",
      "quote": "Tiffany (2026 goal): 'The ability to deliver crisp data-driven communication and how to tie it to a business impact and business outcomes. Schwab, Fidelity are very, very high in data-driven communication and my ability to deliver that communication has been OK so far, and it's something that I know that I need to be better at. I know the data, I know the information. Delivering it with confidence is something that I need to improve upon. And again, I will continue to take the necessary courses to improve upon that.'",
      "action": "Ongoing development: (1) Schwab and Fidelity demand data-driven communication - current performance 'OK,' needs improvement, (2) Gap: Knows the data and information, struggles with confident delivery, (3) Tie data to business outcomes: not just numbers, but impact on client's business, (4) Continue Stage Academy and other communication courses, (5) Practice: Present data to Valarie in 1-on-1s with confidence, (6) Apply to: scorecards, QBRs, renewal discussions, growth conversations, (7) This connects to presentation skills gap - same root issue of confident delivery",
      "source": "Transcript"
    },
    {
      "category": "Process Optimization",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "Reduce Operational Friction Through Process Improvement",
      "quote": "Tiffany (2026 goal): 'Reducing operational friction by improving internal processes adoption. What I mean by that is there are some things that we rinse and repeat from an operational standpoint and those are the things that again making the decision and holding people accountable to avoid that hamster wheel that we tend to be in in specific processes.' Tiffany (example): 'One thing specifically I will say is our hiring process actually it's improved now that we're moving to workday, the way information is shared. We have our recruiting team that then emails the site manager if there's any updates or anything, we're all email chasing. So what we've done is create a live sheet, a live Excel sheet that we're all sharing and I have recruiting updating in real time so that I don't have to, when I decide to work on a weekend, bug anyone to understand and get the most updated information. Some of the processes that we have are so antiquated when we have tools that will allow us to work smarter.'",
      "action": "2026 Process Review: (1) Identify 'hamster wheel' processes that rinse and repeat without improvement, (2) Hiring process improvement: Live Excel sheet for recruiting updates (already implemented) - replicate this thinking elsewhere, (3) Eliminate email chasing: use real-time shared documents, (4) Leverage available tools: 'We have tools that will allow us to work smarter' - what else is being underutilized?, (5) Hold people accountable to new processes: adoption is key, (6) Areas to evaluate: onboarding, equipment tracking, CSAT follow-up, periodic task management, client communication, (7) Goal: Make smarter decisions faster with better information flow",
      "source": "Transcript"
    },
    {
      "category": "Growth Goals",
      "reviewer": "Tiffany Purifoy (Self-Identified)",
      "title": "18% Revenue Growth Target (Strategic Pipeline Work Only)",
      "quote": "Tiffany (2026 goal): 'My goals for 2026 is to increase my managed revenue by 18%. That number is strategic by the work that I look to win that's open right now. I'm not including the work that is currently looking to shift from JLL to direct. I think that's just retaining work. So I did not include that in the 18%.'",
      "action": "2026 Growth Plan: (1) 18% revenue growth from new work only (not TRP JLL→direct transition), (2) Pipeline opportunities: Orlando FL ($150K monthly), Citibank Tampa/Jacksonville (Tampa is their largest piece), Argentina/Latin America (Citibank POC referred), Schwab floor work at Lone Tree/Austin ($222K annually), TRP HQ building (if won direct), (3) Retention work separate: TRP direct contract, Fidelity DC office work, (4) Track: What's included in 18%? What's the dollar target?, (5) Support requirements: succession planning, sales process competence, executive relationships, (6) Valarie will want to see progress tracking toward 18% in 1-on-1s",
      "source": "Transcript"
    },
    {
      "category": "Personal Development - Books/Courses",
      "reviewer": "Tiffany Purifoy & Valarie Barnett",
      "title": "Continue Communication Training Investment",
      "quote": "Tiffany: 'Continuing to invest in my communication and presentation courses, I did. I did actually invest in. It's called Stage Academy, a communication class. It did not show itself very well today. But that is something that I've invested in and I do have those classes and continue to take them. There are certain books obviously that are that I'm going through as well for that. I know one of the ones that you suggested Val was... it'll come back to me.' Valarie: 'I give you kudos for investing in a communications class and taking the bull by the horns and saying, listen, this might not be my strength when it comes to the things that make me nervous in front of executive leaders.'",
      "action": "Continue development: (1) Stage Academy - continue classes despite today's performance not reflecting training, (2) Valarie-suggested books - identify which book she recommended and complete it, (3) Practice presentations more before delivery, (4) Consider: Is Stage Academy the right program? Are there other options?, (5) Valarie appreciates the investment and self-awareness, (6) Goal: See training translate to confident executive presentations, (7) Don't get discouraged by today's performance - Valarie: 'Stay encouraged because I think that you know your accounts very well'",
      "source": "Transcript"
    },
    {
      "category": "Accountability & Lessons Learned",
      "reviewer": "Valarie Barnett",
      "title": "Continue Transparency and Ownership While Improving Execution Speed",
      "quote": "Valarie: 'I thought you did really well on owning and being accountable for the issues and challenges and I appreciate that... You have the ability to take accountability which I appreciate. We have some opportunities and I'm excited actually to take this year and get through them and to work together through them. I don't want you to be discouraged. Stay encouraged. You also know where growth is possible. And I know that you understand you have a growth mindset. Even like I can grow, I can get better, I can do these things, but you also have a growth mindset.'",
      "action": "Strengths to maintain: (1) Accountability and transparency - Valarie praised this multiple times, (2) Owning gaps: Fidelity transition delays, Citibank passivity, TRP periodic task visibility, (3) Growth mindset: Personal (communication training) and business (18% revenue growth), (4) Improvement area: Execute corrections faster - don't wait quarters for gradual improvement, (5) Citibank example: 'Budget was huge. Really turning the site around from an operational standpoint from a 2.5 to a stable 4. Customer now went from being at risk to we now have an advocate,' (6) Apply lessons learned faster in future situations, (7) Valarie's encouragement: Stay motivated, work together on opportunities",
      "source": "Transcript"
    }
  ],
  "Greyson Wolff": [
    {
      "category": "2026 Goals - SMART Goals Framework",
      "reviewer": "Valarie Barnett",
      "title": "Add Specific, Measurable, Achievable, Relevant, Time-Bound Details to All Goals",
      "quote": "Valarie: 'Your goals. Do you have any other goals outside of these? I want you to look up SMART goals. They got to be specific. They got to be measurable. They have to be achievable, time bound, reasonable, I think is one of the words. So all of those things right in your SMART goals though, I need a little strategy behind how you plan to achieve the goals. Being on budget 12 out of 12 months is great, but like you mentioned hiring people, training them up, mentoring them. OK, what does that mean for you? Does that mean that you guys are going to bring in an additional MIT and that you're going to have them started by February 23rd, March 7th like what are you going to do in order to actually achieve the goal? So that's what's missing. That's gonna ding you on the overall points.' Valarie (later): 'Your path forward is closer to your goals than your goals and your path forward has a little bit more strategy in it. So you're scored on both. I don't know if you just want to take 10 minutes and put the teeth to your goals so that I can give you the highest point. I want to give you the highest points possible. I don't want to ding you like drop you by 2-3 instead of a 5 because of those things, go back to your goals real quick.'",
      "action": "URGENT - Flesh out all 2026 goals with SMART framework: (1) Close HDMA Ohio goal needs strategy: How will you win? Key differentiators? Getting ahead of RFP? What are you doing in advance?, (2) Talent development (Blake/William promotions) needs context: This is about freeing up Greyson to take on 7.5M sq ft growth - explain how they'll run half the business on their own by 4/1, (3) 12/12 green months needs execution plan: hiring, training, mentoring specifics with dates, (4) Add stretch goal: Can you drive 1-2% above green performance while maintaining quality?, (5) New work profitability: Can you get new Ohio work on budget? What will it take?, (6) Valarie: 'I'll hold your scoring open until tomorrow morning' - reply via email with flushed out goals",
      "source": "Transcript"
    },
    {
      "category": "Ohio Management Structure - Growth Preparation",
      "reviewer": "Greyson Wolff & Valarie Barnett",
      "title": "Add Ohio Position by March & Develop Jennifer Swafford for Bundle Leadership",
      "quote": "Greyson: 'When we're talking about growth of four sites across 7.5 million square feet and what would likely be a transition of two sites stacked on two sites in back-to-back months, that's going to require additional support from an operational team located within Ohio that understands our operation, that understands Honda and is poised to take support roles within that growth. So that's really priority number one for me. Early to middle of March is when I'm hoping to have that next position.' Valarie: 'Who will be your main operator in the Ohio market? Do you have a strong person? I saw on your org chart there was Blake and there was somebody beside Blake. Who do you have in Ohio that would be your person?' Greyson: 'Right now we have Jennifer Swafford. She's a transfer over from Stellantis. She's done well with ADC, the site that we have had for five coming up on six years now. I'm really curious to see. I've seen her operate at the site level as far as operating over a bundle in the way that Blake is down South that is still what remains to be seen. I have some confidence there, but I'm not going to put my entire stack of chips on it.' Valarie: 'Don't wait until you have the bundle to challenge her. Challenge her now, OK? Even if you don't promote her, challenge her, OK?'",
      "action": "Q1 2026 Actions: (1) MARCH: Add new Ohio position to support growth preparation (8-9 month runway before RFP), (2) NOW: Challenge Jennifer Swafford to operate at bundle level before Ohio award, (3) Test her with cross-site responsibilities similar to Blake's Southern region role, (4) Develop succession: If Jennifer doesn't step up, market assessment for external hire, (5) Goal: Have 'people in place' and 'trained up to SBM standards and expectations' 8-9 months before potential transition, (6) Blake preparation: Continue exposing him to Ohio sites so he's #1 support for growth transition, (7) Structure must support: Two sites stacked on two sites in back-to-back months (4 sites, 7.5M sq ft)",
      "source": "Transcript"
    },
    {
      "category": "Ohio Close Strategy - RFP Preparation",
      "reviewer": "Valarie Barnett",
      "title": "Define Differentiators and Pre-RFP Stakeholder Strategy",
      "quote": "Valarie: 'Close Honda, the Ohio stuff, how will you close it? There might be a strategy attached in the forward path forward actually, but is it by, are we compromising on anything? Are we hitting all of our KPIs consistently? It sounds like we are, but then what will it take to actually win that bid? What are our key differentiators from who they have today? That's going to be the reason that they would even select us because originally they didn't want to give us so much work. Remember, they didn't think that we could handle all of their work and they didn't want to be kind of tied to a single vendor or whatever the reasons were. How are we overcoming those objections with our differentiators today and by when? There's an RFP coming out. Are we waiting for the RFP? How are we putting ourselves in front of the decision makers that may not necessarily, they may be on the RFP, but how are we getting it ahead of them in advance of the RFP?'",
      "action": "RFP Strategy Development (Q4 2026): (1) Document differentiators: What makes SBM better than current vendor? Address Honda's original concern about single vendor risk, (2) Prove capacity: 4.94/5 scorecard, zero failed joint inspections, Q1 struggles → Q2-Q4 excellence demonstrates improvement capability, (3) Pre-RFP positioning: Craig Lloyd relationship (priority #1 2026), continue business review inclusion of Briggs/Feifel/Strelo, (4) Quality consistency: 90% joint inspection scores for all HDMA sites (non-negotiable), (5) Communication tools: Periodic tracker + QR codes for restrooms (scope visibility), (6) Management depth: Show Blake, William, Jennifer, Christopher team vs flat structure from 2024, (7) Timeline: Don't wait for RFP - get ahead with stakeholders Q1-Q3, (8) Overcome objections: Demonstrate we CAN handle all their work through current performance + management investment",
      "source": "Transcript"
    },
    {
      "category": "Management Accountability - Lesson Learned",
      "reviewer": "Greyson Wolff (Self-Identified)",
      "title": "Earlier Action on Underperforming Managers (Ohio Turnover)",
      "quote": "Greyson: 'Throughout the course of 2025, we actually turned over our entire management team in Ohio. Two of them were decisions that we made internally. One was a site manager that needed to find another industry for himself. However, as far as where the reflections really exist from an internal perspective, two of the folks that ended up moving on from us in 2025 shouldn't have made it into the year in 2025. So that's when I'm looking at this and where we could have managed this better... There's two people that needed to move on sooner and I think that's where it was my responsibility to identify and make that move prior to this taking place.'",
      "action": "Lesson learned for future: (1) Act faster on underperforming managers - don't let them into new year if concerns exist, (2) Two Ohio managers 'shouldn't have made it into 2025' - resulted in complete team turnover mid-year, (3) Greyson owns accountability: 'My responsibility to identify and make that move prior,' (4) Result: Stronger foundation now, but could have avoided roller coaster of 'that many fresh faces and new managers,' (5) Apply lesson: Jennifer Swafford assessment can't wait for Ohio bundle - challenge her NOW (Valarie's advice), (6) Forward practice: Quarterly management evaluations with Spencer; document performance concerns early; act decisively vs hoping for improvement",
      "source": "Transcript"
    },
    {
      "category": "Safety Incident Response",
      "reviewer": "Greyson Wolff (Self-Identified) & Valarie Barnett",
      "title": "Escalate to Plant Manager After False Accusations (TMPG Incidents)",
      "quote": "Greyson: 'TMPG from a safety perspective. There were three incidents in total and the reason that I'm including all three here is the first two were alleged to have been at fault of SBM. After some investigation, after being able to provide some evidence, it was made abundantly clear that SBM was nowhere in the vicinity nor at fault of these issues. However, sometimes when that connotation gets out in the air, it's a little bit more difficult to kick the last one.' Learning: 'Where the opportunity existed is after that first incident took place that was found to not be at SBM's fault. That's when we should have had the opportunity to sit down with that plant management team and be able to make it abundantly clear that that's how the situation unfolded... I think it just really comes back to communication with the folks that are in charge and really making the decisions at those plant levels.' Valarie: 'What would you have done differently?' Greyson: 'We had made the request with our site level POC to have that audience. It kind of fell against deaf ears and I think for me that's where I have the opportunity to meet with my regional POC and I'm pretty confident we would have had the chance to do that. And so I think that's where I let it slide when I shouldn't have.' Valarie: 'So you would have advocated harder to get the meeting.'",
      "action": "Future protocol: (1) After false safety accusation is proven wrong, escalate immediately to plant manager level, (2) Don't accept 'fell against deaf ears' from site POC - go to regional POC, (3) Clear air proactively vs waiting for perception to linger, (4) Third incident: SBM employee was at fault, terminated appropriately, (5) WIN: Got closed-door meeting with plant manager and department leads post-incident - showcased ForSight, quality processes, safety standards, (6) Lesson: Should have had that meeting after FIRST false accusation, not after third incident, (7) Communication with decision-makers is key - don't let site-level communication gaps fester",
      "source": "Transcript"
    },
    {
      "category": "Talent Development - Blake & William",
      "reviewer": "Greyson Wolff & Valarie Barnett",
      "title": "Promote Blake & William by Q1 to Support 7.5M Sq Ft Growth",
      "quote": "Greyson (2026 goal): 'How I evaluate myself, one of the ways and how I'm doing my role and how I'm performing as an account director with the Honda portfolio is how we're building up the people that we have within our management team. The first two people there, Blake, who's now in his third, fourth position within the Honda portfolio is again next up on the list. He's somebody that I want to get across the entirety of the portfolio and William Smith is right there behind him and stepping into the role that Blake's currently performing.' Context: 'When we expand to the growth in Ohio, I need to have a team in place that can support my current responsibilities in order to be able to take on 7.5 million square feet.' Valarie: 'I would think maybe a goal for you at your level talent development would probably be the overarching strategy... it's talent development for growth... How will you achieve that? How can they run the other half of the business on their own, what does that look like?'",
      "action": "Q1 2026 Talent Development: (1) Blake promotion by 4/1: Needs to run Southern region independently while Greyson focuses on Ohio growth, (2) Financial raise complete, title clarification needed (Valarie's call last week provided clarity), (3) William Smith development: Step into Blake's current role, (4) Blake's Ohio exposure: 'Last couple of months, he's had opportunities to see and really get his feet down and put his hands down on some of the Ohio sites. That's where some of that growth continues to exist. Because if we do get these other sites coming into our portfolio, Blake's going to be the number one guy to help kind of support that transition,' (5) Success metrics: Can Blake/William run half the business independently? Can Greyson step away to focus on Ohio transition?, (6) This isn't just promotion - it's preparing to absorb 4 sites, 7.5M sq ft, back-to-back month transitions",
      "source": "Transcript"
    },
    {
      "category": "Financial Performance - Stretch Goals",
      "reviewer": "Valarie Barnett",
      "title": "12/12 Green Months + Drive 1-2% Above Green Performance",
      "quote": "Valarie: 'Your 2026 goals, I'm going to tell you this same thing that I've told everybody. First of all, congratulations on being on budget most of the months, 12 out of 12. I thought you said 11 out of 12.' Greyson: '2025 was 11 out of 12, and that's why 2026 is 12 out of 12.' Valarie: 'Give me a stretch, give me a stretch goal. You know, can you hit, if you're hitting green financial performance, if you can drive it from cost plus what it is today, if you can drive another percent or two, that's your stretch goal. Then can I be above that by this amount and still deliver the happiness and the quality that my contract so desires? And I think you can. And then can you win the new work and get that on budget? That's really going to be the challenge. Can you take the new work if it's not modeled exactly the same and can you get that on budget and what will it take in order to do that? You'll be able to apply all the strategies you have from this particular learning right into the next one.'",
      "action": "Financial goals refinement: (1) BASE GOAL: 12/12 green months (2025 was 11/12 - July shutdown red, December fixed), (2) STRETCH GOAL: Drive 1-2% above green performance while maintaining quality/client happiness, (3) NEW WORK PROFITABILITY: Get Ohio bundle on budget from day 1 - apply learnings from current portfolio (VCT optimization, Sidewinder efficiency, concrete polishing, route maturity), (4) Challenge: New work may not be modeled same as current - how to achieve profitability?, (5) Strategies to apply: $31K investment model (wages + management), outside labor elimination approach, equipment innovation (Sidewinder), management labor profit opportunities (concrete polishing), (6) Document: What made current portfolio profitable? Replicate in Ohio",
      "source": "Transcript"
    },
    {
      "category": "Craig Lloyd Relationship - Priority #1",
      "reviewer": "Greyson Wolff (Self-Identified)",
      "title": "Establish Relationship with Top HDMA Decision-Maker",
      "quote": "Greyson (2026 forward strategy): 'The stakeholders. I've had the opportunity to get pretty deep within HDMA throughout the course of 2025. The next number one on my hit list here is Craig Lloyd, who sits at the top of all of it. So he is priority number one in 2026 as far as establishing a relationship and communication with on the HDMA side of things that would really help support with the growth.'",
      "action": "2026 Priority: (1) Craig Lloyd sits at top of HDMA (above Dave Strelo, who's above Jeremy Briggs/Mark Feifel), (2) Current relationships: Christie Benzman (direct POC, monthly scorecards), Jeremy Briggs (Powertrain), Mark Feifel (Assembly), Dave Strelo (top layer), (3) Craig Lloyd gap: Not yet established - this is the final relationship needed for RFP decision influence, (4) Strategy: Leverage existing business review attendance by Briggs/Feifel/Strelo to get introduction to Craig Lloyd, (5) Timing: Q1-Q2 2026 establishment before Q4 RFP, (6) Approach: Similar to what worked in 2025 - include in business reviews, offer open scorecard invites, possibly standalone meeting on Ohio strategy/capabilities",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence & Presentation",
      "reviewer": "Valarie Barnett",
      "title": "Continue Excellence - Best ForSight Presentation of 34 Reviews",
      "quote": "Valarie: 'I thought overall you did an excellent job. You probably did the best of anyone presenting... I am at 34 I think of these out of 42. You did the best of anyone presenting out of ForSight with your flow, your logic. I trust your QBRs and I probably should have started. I should have emailed you in advance and said you don't have to do a dry run on your QBR because I know that you know those things... Overall, you just told a really cohesive story. I think that you had a presence about you, a confidence. You know your material, you know your account. I could tell that you weren't reading me your story, which is a huge plus in my book. You are positioning us well for growth and you're doing an excellent, excellent job... I feel like you found your home. You know what I mean? Like you're in a really good place.'",
      "action": "Strengths to maintain: (1) Flow and logic in presentations - best of 34 reviews, (2) Not reading material - knows account backwards/forwards, (3) Cohesive storytelling with confidence and presence, (4) Positioning for growth effectively, (5) Valarie trusts Greyson's QBRs - could have skipped dry run, (6) Context: Automotive's first review cycle ('Life sciences first one was a bomb... next three got better... next five were where they needed to be. Spencer didn't really have heads up on template. This was kind of a test of skill'), (7) Technology vertical cheated by creating shared deck, (8) Greyson passed the test: 'You found your home... you're in a really good place,' (9) Continue this level of preparation and presentation for client-facing QBRs and Ohio RFP presentations",
      "source": "Transcript"
    },
    {
      "category": "Alabama Manager Incentives",
      "reviewer": "Valarie Barnett",
      "title": "Kick Back Managers for Cash-Positive Concrete Polishing Work",
      "quote": "Valarie: 'Can you guys get super cash positive on that? When you get cash positive on that service and the managers are actually doing the work, if you're not adding in a management fee and you're just making pure profit on it. If you're over and above your green budget model, start to kick back the managers for the work that they're doing.' Greyson: 'We're fringe in Alabama right now. This helps get us across the line. But that is, there's a couple other things that we're working on and I would love to be able to do exactly that.' Valarie: 'You gotta. I mean, if you're on budget and you're just making money, it's really important.'",
      "action": "Alabama incentive plan: (1) Concrete polishing generating ~$5K pure profit per project with management labor, (2) Blake and Aaron Licciardi leading innovation, (3) Once Alabama is solidly above green budget (currently 'fringe'), implement manager kickbacks, (4) Recognition for cash-positive work above budget model, (5) Incentive structure: TBD, but reward managers doing work that generates pure profit, (6) Expansion: Cascading concrete polishing across manufacturing bundle - set up incentive model for other sites that adopt, (7) Valarie's emphasis: 'You gotta... if you're on budget and you're just making money, it's really important'",
      "source": "Transcript"
    }
  ],
  "Siddarth Shah": [
    {
      "category": "SMART Goals & Timelines",
      "reviewer": "Valarie Barnett",
      "title": "Set Specific Dates for All 2026 Goals - Move from Strategy to Execution Timeline",
      "quote": "Valarie: 'The one detail that I want you to flush out, maybe make it a part of your 2026 goals, which I thought you gave yourself a fair amount of those, just the dates around things. So I would love to see you have by this day I want to accomplish this. So for example, if Singapore and taking over Singapore is on your list, what day will when will you want to, when do you want to get with Nick V and Nicole and James Peate on the call and work on really what your storytelling strategy is? What are you going to say when you get in front of Singapore? So if that is really, truly on your heart and that's your goal that you set for yourself, by what day will you have your whole presentation memorized, locked down? And then by what day do you want to go to Singapore? Do you want to be in Singapore by Q2? When do we want to pull this work away from the competitor who's there? So I'm giving that as one singular example. You have great ideas. You have a lot of strategy behind those ideas, but I want you to set dates for yourself so you can hold yourself accountable to those dates and that we can hold you accountable to those dates as well.'",
      "action": "Create SMART timeline for each 2026 goal with specific dates: (1) SINGAPORE/MALAYSIA: Set date for storytelling strategy call with Nick V/Nicole/James, presentation finalization deadline, memorization deadline, travel date (Q2 target?), competitor displacement timeline, (2) MAC SERVICES & EVENTS: CNW response expected end of Feb 2026 - set pilot launch date if approved, Boise and San Jose implementation dates, staffing plan completion date, (3) ID1 PRODUCTION LAB: Q2 2026 go-live - set pricing resubmission date, CNW partnership discussion date, autonomous equipment demo date with Nilfisk, staffing readiness date, (4) BUILDING 42 (7-story admin): Q2 completion, Q3 go-live - set CNW partnership meeting date, pre-mobilization cleaning proposal date, janitorial services proposal date, (5) ID2 PRODUCTION LAB: Q3/Q4 2026 construction start - set Parth Gandani follow-up dates (meeting next week confirmed), Hoffman continuation agreement date, trailer expansion pricing date, (6) SYRACUSE NY: Set Parth Gandani meeting outcomes date (next week), existing 2-floor opportunity investigation date, construction support proposal date, (7) MANASSAS VA: Jason De Boer outreach date, RFP invitation follow-up date, next RFP estimated timing, (8) AUTONOMOUS EQUIPMENT: Nilfisk demo dates for San Jose and Boise, client presentation dates, pricing proposal dates for ID1/ID2, (9) SPARTAN CHEMICALS: February 2026 rollout confirmed - set implementation date, training completion date, sustainability report date, (10) LONGMONT MAX LAB: Q3 2026 at 100% capacity - set migration completion date, Pike location lease end (February confirmed), equipment delivery dates, staffing ramp-up dates, (11) 8 FTEs WHITE GLOVE SERVICE: $37K/month proposal submitted - set CNW decision date, implementation timeline if approved, (12) HOFFMAN CONTRACT: $116K/month current, potential doubling for ID2 - set expansion negotiation date, trailer setup timeline, (13) CONVERT $35,771 INVESTMENT INTO BILLABLE: Set date to present new programs/scope additions to recover cost-avoidance investment, (14) Valarie's key message: 'You have great ideas, a lot of strategy, but I want you to set dates for yourself so you can hold yourself accountable to those dates and that we can hold you accountable to those dates as well.' This applies to ALL initiatives mentioned.",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence & Language",
      "reviewer": "James Peate",
      "title": "Change Language from 'If We Get Involved' to 'When We Get Involved' - Project Confidence",
      "quote": "James: 'Two comments. One is when you said if we get involved, I would change that language to when we get involved. I'm confident in the plans there.'",
      "action": "Language shift for confidence and positioning: (1) Context: Siddarth said 'if we get involved' when discussing growth opportunities (ID1, ID2, Syracuse, Singapore, Building 42), (2) James correction: Change to 'WHEN we get involved' to project confidence in plans, (3) This applies to all growth conversations: Internal (leadership, operational teams), Client-facing (CNW, Micron POCs), Vendor partnerships (Nilfisk, Hoffman, construction teams), (4) Mental shift: These are not 'maybes' - they are planned outcomes with execution timelines, (5) Aligns with Val's feedback about setting dates: If you're setting dates, you're planning for 'when,' not 'if,' (6) Competitive positioning: 'When' language signals to clients that SBM is the expected partner, not a hopeful bidder, (7) Practice this in: Parth Gandani meeting next week (Syracuse, ID1, ID2), Singapore Director of Facilities conversations, Jason De Boer Manassas outreach, CNW partnership discussions on Building 42 and MAC services",
      "source": "Transcript"
    },
    {
      "category": "Marketing & Communications Strategy",
      "reviewer": "James Peate",
      "title": "Use Every Touch Point as Marketing Opportunity - Not Just RFP Conversations",
      "quote": "James: 'And then the other one is, and my take away here is you're already doing this, but I wanted to reinforce it is that we're making sure that we're having those ongoing conversations and talking about the wins and the success and the progress, whether it's at the site level, the account level or even SBM more broadly as we're leading in innovation and our solutions. So it's not just a conversation that comes up with the upcoming RFPs and so forth that we have. So we're using every touch point as a marketing communications opportunity to deliver messages like you did today.'",
      "action": "Marketing communications at every level - not just during RFPs: (1) SITE LEVEL: Use every interaction with Micron site contacts to share wins, innovations, progress, (2) Examples: Monthly scorecards with Christie Benzman (direct POC) - include innovation highlights, sustainability wins, efficiency improvements; Joint audits - showcase new products (Waxy digester), new processes (work order integration), new equipment; Daily operations - ensure supervisors/site managers communicate proactive solutions and improvements to Micron staff, (3) ACCOUNT LEVEL: Business reviews with growth decision-makers (Jeremy Briggs, Mark Feifel, Dave Strelo) - not just operational updates but SBM innovation leadership, autonomous equipment positioning, sustainability leadership (Curbit Award), cost savings examples ($15K window washing, paper product repurposing); Parth Gandani relationship (ID1, ID2, Syracuse) - position SBM as innovation partner from construction through operations; Craig Lloyd outreach (when he becomes #1 priority) - lead with SBM's technology leadership, international capabilities (Singapore/Malaysia), track record of managing complexity (5.3M sq ft, 201 employees, 6 sites), (4) SBM BROADLY: Share Micron portfolio success across SBM - template for other tech clients, Position Micron relationship as case study for: Technology client capabilities, Autonomous equipment expertise (Nilfisk partnership), International expansion readiness (Singapore/Malaysia), Large-scale cleanroom operations (600K sq ft production labs), Sustainability leadership (Curbit Award, compostable programs), Cost-optimization partnership ($35,771 investment, then billable conversion), (5) TIMING: Not just 'upcoming RFPs' but ongoing - every monthly scorecard, every business review, every site visit, every email, (6) MESSAGE CONSISTENCY: Deliver same quality messaging as today's presentation - wins, success, progress, innovation, leadership, (7) James's note: 'You're already doing this' - so continue and amplify, don't change approach, just ensure EVERY touchpoint includes marketing value",
      "source": "Transcript"
    },
    {
      "category": "Lessons Learned & Continuous Improvement",
      "reviewer": "James Peate",
      "title": "Continue Retrospective Lens - 'How Do We Stop This Happening Again?'",
      "quote": "James: 'On the issues and challenges, I really loved the lessons learned that you put in there. So it wasn't just that we had an issue, we came up with an action plan, we addressed it, but then we turned or you turned around and said so how do we stop this happening again? How do we scale that and make sure that it's not something that just comes up again. I really like that retrospective lessons learned lens that you put on those.'",
      "action": "Maintain and expand retrospective problem-solving approach: (1) CURRENT STRENGTH: Siddarth's approach to issues wasn't just reactive (problem → action plan → resolution) but strategic (problem → action plan → resolution → prevention → scalability), (2) EXAMPLES FROM 2025: San Jose scope misalignment: Not just 'added supervisors' but 'Let's discuss action plan, pricing, incorporate into scope moving forward' to prevent future gray areas, Boise cleanroom out-of-scope activities: Not just 'stopped placing orders' but 'identified all gray areas, realigned responsibilities, created clear scope boundaries' to protect future teams, Work order platform incompatibility: Not just 'we'll handle it manually' but 'created manual integration process with before/after pictures' to establish scalable validation system, (3) 2026 APPLICATION: After every challenge, ask: 'How do we prevent this from happening again?' 'How do we scale this learning across the portfolio?' 'What process/training/documentation prevents recurrence?', (4) SPECIFIC 2026 OPPORTUNITIES: MAC services/events pilot (new program) - document learnings for rollout across portfolio, Autonomous equipment with Nilfisk - capture why Tenant failed, why Nilfisk succeeds, create vendor evaluation criteria, Singapore/Malaysia expansion - document international expansion process for future global opportunities, ID1/ID2 production labs - create playbook for future cleanroom production facilities, Converting $35,771 investment to billable - document value-add to billable-scope conversion process, (5) SCALABILITY MINDSET: Every solution at Micron could benefit other SBM tech clients, Every challenge overcome becomes competitive advantage in next RFP, Every innovation tested becomes portfolio-wide offering, (6) James's emphasis: This retrospective approach is a STRENGTH to continue, not just something done well once",
      "source": "Transcript"
    },
    {
      "category": "Leveraging Vertical Strength",
      "reviewer": "Mark Schlerf",
      "title": "Continue Asking 'Who Does This?' Across SBM - Don't Be an Island",
      "quote": "Mark: 'I love that you're leaning into things like Mac work, things that maybe the playbook isn't as well defined within SBM and we have plenty of sites that we do it at and yet not in Boise, Idaho. And so I love that you're seeing it as an opportunity and not afraid of it and that you're leaning on the vertical, the strength of the vertical. I think I've seen where you've asked questions of hey, who does this? Who does that? I mean, I think you have made Boise not an island because of how you how you leverage the strengths of the people around you to learn from and just gather along the way. I think that is really a strength of yours, just assimilating the learnings from others.'",
      "action": "Maintain and expand collaborative learning approach across SBM: (1) CURRENT STRENGTH: Siddarth doesn't treat Boise as isolated - actively asks 'who does this?' across SBM when facing new opportunities, (2) MAC SERVICES EXAMPLE: Mark noted 'plenty of sites do MAC work' at SBM, just not in Boise/Idaho - Siddarth is pulling from those sites' playbooks, not creating from scratch, (3) 2026 LEVERAGE OPPORTUNITIES: MAC services & events: Which SBM sites do this? What are their staffing models, pricing structures, client communication processes? Get their playbooks BEFORE CNW approval (end of Feb), Autonomous equipment: Which SBM sites use autonomous equipment? What brands? What client adoption process worked? What pushback did they face and overcome? Use this BEFORE Nilfisk demos, International expansion (Singapore/Malaysia): Does SBM have international operations? If not, who has expanded to new countries/regions? What legal, HR, operational considerations? Tap this BEFORE formal introduction, Cleanroom production labs (ID1, ID2 - 600K sq ft each): Which SBM sites have large cleanroom experience? What equipment, training, safety protocols are essential? Learn BEFORE Q2 go-live, Scope expansion strategy (converting $35,771 investment to billable): Which ADs have successfully converted value-adds into billable scope? What was their client conversation approach? Pricing justification?, (4) MARK'S OBSERVATION: 'Made Boise not an island' - this is the goal for every AD, (5) CONTINUATION: Keep asking 'who does this?' for EVERY new initiative, Assimilate learnings from others BEFORE implementing, Leverage vertical strength (Mark, Val, other ADs) as resources, (6) RECIPROCAL: As Siddarth succeeds with MAC work, Singapore, autonomous equipment - he becomes the 'who does this?' answer for other ADs, (7) Mark's encouragement: 'I think that is really a strength of yours' - don't lose this collaborative approach as you become more experienced",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity Timeline - ID1 Production Lab",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "ID1 Go-Live Q2 2026 - Pricing Submitted, Partner with CNW, Autonomous Equipment Ready",
      "quote": "Siddarth: 'The ID1 training lab, the potential go-live is in Q2 of 2026. We've already submitted pricing for two FTEs at this location. The project was put on hold in 2025 because of construction delays, but we're starting to see some tractions for the ID1 facility.'",
      "action": "ID1 production lab execution plan (600K sq ft cleanroom): (1) TIMELINE: Q2 2026 go-live (April-June), currently seeing traction after 2025 construction delays, (2) CURRENT STATUS: Pricing submitted for 2 FTEs, Hoffman construction cleaning ongoing ($116K/month), Parth Gandani meeting scheduled next week, (3) PRE-GO-LIVE ACTIONS: Reconfirm pricing and FTE count (is 2 FTEs sufficient for 600K sq ft cleanroom?), Autonomous equipment demo with Nilfisk - coordinate with Parth Gandani meeting, present autonomous solution for mile-long hallways, CNW partnership confirmation - ensure SBM is vendor of choice (not RFP), Staffing recruitment and cleanroom training plan (cleanroom requirements are specialized), Equipment procurement - autonomous machines, specialized cleanroom equipment, Safety and compliance training for production lab environment, (4) OPPORTUNITY SIZING: 600K sq ft cleanroom (massive facility), Mile-long hallways (autonomous equipment justification), Currently servicing construction via Hoffman - natural transition to operations, (5) RISK: 'The project was put on hold in 2025' - could happen again, need backup timeline, (6) NEXT WEEK MEETING WITH PARTH GANDANI: Confirm Q2 timeline, Discuss SBM operations transition from construction cleaning, Present autonomous equipment vision, Confirm FTE needs, Explore ID2 timeline (adjacent 600K sq ft lab), Discuss Syracuse opportunities, (7) STRATEGIC IMPORTANCE: First major production lab for SBM at Micron, Proof of concept for ID2 (also 600K sq ft), Demonstration of autonomous equipment capabilities, Expansion of existing Boise portfolio (currently 5.3M sq ft → 6.3M sq ft), (8) CONNECTION TO VAL'S FEEDBACK: Set specific date for go-live, autonomous demo, CNW partnership meeting, staffing completion - don't leave in 'Q2' generality",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity Timeline - Building 42",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "Building 42 (7-Story Admin) - Q2 Completion, Q3 Go-Live, Partner for Pre-Mobilization Cleaning",
      "quote": "Siddarth: 'We've got a new seven story admin building which is called Building 42. It should be completed by Q2 and will go live in Q3. We want to make sure that we partner with Cushman and Wakefield to take on the janitorial services there, discuss taking over the construction, pre-mobilization cleaning services in Building 42. Building 42 has been erected. It's a seven story building which is smack center of what used to be our parking lot. If you come back to Boise, you will see a complete different facility now.'",
      "action": "Building 42 execution strategy: (1) TIMELINE: Q2 2026 completion (April-June), Q3 2026 go-live (July-September), Currently erected, under construction, (2) FACILITY: 7-story admin building, Center of Boise campus (former parking lot location), Significant visibility on campus, (3) TWO-PHASE OPPORTUNITY: PHASE 1 - Pre-mobilization cleaning: Construction cleaning/turnover services, Typically higher-margin work, Demonstrates capabilities before operations begin, Get in early to secure operations relationship, PHASE 2 - Janitorial services: Ongoing operations once building goes live in Q3, Addition to existing Boise portfolio, (4) PARTNERSHIP STRATEGY: 'Partner with Cushman and Wakefield' - CNW is existing client across Micron portfolio, Leverage existing relationship, not competitive bid, Position SBM as natural choice due to campus presence (201 employees, 5.3M sq ft), Convenience and efficiency of single vendor for entire campus, (5) NEXT ACTIONS (PER VAL'S FEEDBACK - SET DATES): CNW partnership discussion date - propose both pre-mobilization and operations, Pre-mobilization pricing submission date - Q1 2026 before Q2 completion, Operations pricing and staffing plan date - before Q3 go-live, Staffing recruitment timeline - admin building may need different skill mix, Equipment and supplies procurement date, (6) STRATEGIC IMPORTANCE: Highly visible facility (7 stories, campus center), Admin building = executive presence, white-glove expectations likely, MAC services opportunity (new admin building = desks, moves, setups), Complements existing Boise campus portfolio, Could be included in proposed MAC services program (end of Feb CNW response), (7) RISK MITIGATION: Completion date could slip (construction often delays) - maintain CNW communication, Competition for pre-mobilization work - move quickly to secure, Different expectations for admin vs production/lab spaces - clarify scope early, (8) OPPORTUNITY SIZING: 7 stories = significant square footage addition, Admin building = potential for additional services (MAC, events) beyond janitorial, (9) VAL'S FEEDBACK APPLICATION: 'By what day do you want to...' - set specific CNW meeting date, pricing date, decision date, implementation date for both phases",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity Timeline - ID2 Production Lab",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "ID2 Second Production Lab - Q3/Q4 2026 Construction Start, Double Hoffman Contract",
      "quote": "Siddarth: 'ID2 is a huge one. We continue to support the construction cleaning through the Hoffman construction projects. ID2 is going to be a second production lab that they're building right behind ID1. That would give us the opportunity to put our foot in the door and make sure that we continue servicing the trailers and then hopefully get grandfathered in to actually servicing the janitorial services for ID2 once it goes live. We're looking at them starting construction in Q3 or Q4 of 2026. They've already broken ground.'",
      "action": "ID2 strategy and timeline (second 600K sq ft cleanroom): (1) TIMELINE: Ground already broken, Q3 or Q4 2026 construction start (July-December), Behind ID1 (which goes live Q2 2026), (2) CONSTRUCTION PHASE OPPORTUNITY: Currently: Hoffman contract $116K/month (ID1 trailers), ID2 potential: Double the trailer space and construction area, 'Hopefully doubling' Hoffman contract to ~$232K/month, Timeline: Set expansion negotiation date with Hoffman, (3) 'GRANDFATHERED IN' STRATEGY: Foot in door via construction cleaning (Hoffman trailers), Transition from construction to operations (like ID1 approach), 'Grandfathered in' suggests avoiding RFP by being incumbent, Requires: Excellent construction cleaning performance, Strong relationship with Parth Gandani (meeting next week), CNW partnership on transition plan, (4) NEXT WEEK PARTH GANDANI MEETING: ID1 timeline confirmation (Q2 go-live), ID2 construction timeline (Q3/Q4 start), Hoffman contract expansion discussion (doubling opportunity), Operations transition strategy (construction → janitorial for both ID1 and ID2), Syracuse opportunities (separate discussion), (5) STRATEGIC IMPORTANCE: Second 600K sq ft production lab (matching ID1), Demonstrates SBM's scalability (can handle multiple massive production labs), Proof of autonomous equipment value (mile-long hallways × 2 facilities), Total opportunity: ID1 + ID2 = 1.2M sq ft of new cleanroom space, (6) RISK: 'Hopefully get grandfathered in' - not guaranteed, need proactive positioning, Construction start could delay (common in projects this size), Competition could bid for operations even if SBM does construction cleaning, (7) REVENUE IMPACT: Construction phase: ~$232K/month (if doubled from current $116K), Operations phase: TBD, but 600K sq ft cleanroom with autonomous equipment = significant monthly revenue, (8) CONNECTION TO OTHER INITIATIVES: Autonomous equipment: ID2 is second use case (after ID1), Nilfisk partnership: Demonstrate value across both production labs, Parth Gandani relationship: Critical for ID1 and ID2 success, (9) VAL'S FEEDBACK APPLICATION: Set specific dates: Parth meeting next week outcomes, Hoffman expansion negotiation date, ID2 construction start confirmation date, Operations proposal submission date, CNW transition plan discussion date, (10) JAMES'S FEEDBACK APPLICATION: Change language from 'hopefully get grandfathered in' to 'WHEN we transition from construction to operations' - confidence, not hope",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity Timeline - Syracuse NY",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "Syracuse NY New Investment - Parth Gandani Meeting Next Week, Existing 2-Floor Opportunity On Hold",
      "quote": "Siddarth: 'Syracuse, NY is a new one that just recently they're going to be investing a lot of money in Syracuse, NY. I've met up with a contact at Micron by the name of Parth Gandani, who I'm currently dealing with with the production lab building in the construction of ID1 and ID2. I've actually got a meeting with him next week to actually discuss how we can actually start supporting the Syracuse building and the construction of Syracuse, if it's gonna be through Hoffman, if it's gonna be through Hansel Phillips, if it's gonna be through any other vendor which we want in. So we're gonna look at current existing opportunities in Syracuse. I know there's one building over there where initially we were looking at potentially taking on two floors, but that was put on hold because that was landlord driven.'",
      "action": "Syracuse NY execution plan: (1) MEETING NEXT WEEK WITH PARTH GANDANI: Agenda: Syracuse construction support opportunities, Vendor identification (Hoffman? Hansel Phillips? Other?), Existing 2-floor opportunity status (was landlord-driven, on hold), SBM entry strategy for Syracuse market, (2) CONTEXT: Micron investing heavily in Syracuse, NY, New facility/expansion (construction phase starting), Parth Gandani is Siddarth's contact for ID1, ID2, and now Syracuse, Relationship leverage: Using ID1/ID2 relationship to enter Syracuse, (3) CONSTRUCTION PHASE: 'How we can start supporting Syracuse building and construction', Similar to Hoffman model in Boise (trailers, construction cleaning), Foot-in-door strategy for operations (like ID1, ID2 approach), Vendor TBD: Hoffman (current Boise partner), Hansel Phillips, or other, (4) EXISTING OPPORTUNITY: 2-floor opportunity in one building, Was 'landlord driven' (not Micron direct), Put on hold, Status: Need to reactivate or confirm dead, (5) NEXT WEEK MEETING OBJECTIVES: Understand Micron's Syracuse investment scale and timeline, Identify construction vendor (Hoffman preferred due to relationship), Discuss SBM's role: construction cleaning, trailers, pre-mobilization, operations, Clarify 2-floor opportunity - still viable? Different approach needed?, Position SBM as Micron's partner across geographies (Boise, Syracuse, future), Connect Syracuse to Singapore/Malaysia strategy (expanding beyond Boise), (6) STRATEGIC IMPORTANCE: Geographic expansion beyond Boise/San Jose/Longmont/Folsom, Demonstrates SBM's ability to support Micron nationally, Parth Gandani relationship extending across multiple projects/locations, Precedent for future Micron expansions (if successful in Syracuse), (7) RISK: 'Landlord driven' complexity - less control than Micron-direct facilities, 'Put on hold' history - could delay again, New market for SBM - may need local partnerships or hiring, (8) VAL'S FEEDBACK APPLICATION: After next week meeting, set specific dates: If construction support approved: Start date, staffing plan date, equipment/supplies date, If 2-floor opportunity reactivated: Proposal date, decision timeline, implementation date, If new opportunities identified: Pursuit timeline, proposal dates, decision dates, (9) JAMES'S FEEDBACK APPLICATION: Use next week meeting to 'talk about wins and success and progress' from Boise (Curbit Award, $201K growth, CNW relationship), Use every touch point as marketing opportunity - this meeting isn't just about Syracuse, it's about SBM's capabilities, (10) MARK'S FEEDBACK APPLICATION: 'Who does this?' - Which SBM sites have expanded into new geographic markets? What was their approach? Learn before Syracuse execution, (11) CONNECTION TO OTHER INITIATIVES: Singapore/Malaysia: Syracuse is domestic expansion proof point, ID1/ID2: Parth sees SBM execution across projects, Hoffman relationship: May extend to Syracuse construction if Hoffman is vendor",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity Timeline - Longmont Max Lab Migration",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "Longmont Max Lab - Pike Lease Ends February, 100% Capacity Q3 2026, Phased Growth Approach",
      "quote": "Siddarth: 'In Longmont, we're currently servicing the Pike location to the Max location in Longmont, Colorado. So we're going to continue servicing this Pike location until the Micron lease ends in February and then once they migrate completely to the Max lab, we're going to start servicing that facility at 100% capacity based off the construction. So we're looking at maybe Q3 of 2026.'",
      "action": "Longmont Max Lab transition plan: (1) CURRENT STATE: Servicing Pike location (existing), Migrating to Max Lab (Clover Basin - new facility), Currently servicing 65,000 sq ft at Max Lab (partial), Phased approach as facility grows, (2) TIMELINE: February 2026: Pike location lease ends, Continue servicing Pike until then, Q3 2026: Max Lab at 100% capacity (July-September), 'Based off construction' - completion dependent, (3) TRANSITION PLAN: Phase 1 (Current - Feb 2026): Dual service - Pike + partial Max Lab (65K sq ft), Phase 2 (Feb 2026): Pike lease ends, Max Lab still growing but Pike service ends, Phase 3 (Q3 2026): Max Lab 100% capacity, full service begins, (4) EQUIPMENT INVESTMENT: 'Bigger, more efficient equipment in Longmont, specifically for Clover Basin (Max Lab)', 'Larger machine covers more ground, reduces need for additional headcount', Already invested and deployed, (5) NEXT ACTIONS (VAL'S FEEDBACK - SET DATES): Max Lab 100% completion confirmation date (Q3 2026 estimate - get specific), Pike location final day of service (February 2026 - get specific date), Staffing transition plan: Pike employees to Max Lab? New hires? Timeline?, Equipment delivery/setup completion date for 100% capacity service, Training completion for new facility (larger equipment, different layout), Micron walkthrough and scope confirmation date for 100% capacity, (6) FINANCIAL IMPACT: Pike location monthly revenue: TBD, Max Lab partial (65K sq ft) current monthly revenue: TBD, Max Lab 100% capacity monthly revenue: TBD (need to calculate growth), Net change: Potentially higher revenue with larger, more efficient facility, (7) STRATEGIC IMPORTANCE: Facility upgrade: Pike (old) → Max Lab (new, larger, more efficient), Equipment advantage: Larger machine positioning SBM well for efficiency, Growth trajectory: Started 65K sq ft, growing to 100% capacity, Demonstrates SBM's ability to grow with client through facility transitions, (8) RISK: 'Based off construction' - Q3 100% could delay, Pike lease ends February but Max Lab may not be 100% ready - gap period?, Construction completion risk (common delays), Dual service period (Pike + Max) is operationally complex, (9) COORDINATION: With Boise campus (Siddarth's main portfolio), With CNW (property management), With Micron Longmont team (different POCs than Boise?), (10) VAL'S FEEDBACK APPLICATION: Set specific dates: February Pike end date, Q3 Max Lab 100% date, Transition milestones (equipment, staffing, training), Revenue impact calculation dates (11) CONNECTION: Growing from 5 sites to 6 sites in 2025 (mentioned in opening) - this was likely the Max Lab addition",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity - MAC Services & Events",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "MAC Services & Event Support - $25K/Month Proposal, CNW Response Expected End of February",
      "quote": "Siddarth: 'Should we successfully introduce the new event and MAC services at the site, this will increase the number of services that SBM can offer across the portfolio. Just recently I put together a proposal of how SBM can support MAC services and event support. It's a completely different program, completely new program that I've been working with the CNW team. Once it's been approved, we'll be able to pilot it at Boise and in San Jose, making sure that we are supporting all the events, but more importantly with all this growth that's happening in Boise, the MAC services, this is the desk move, the setups of all the conference rooms and all that. This is going to be a huge part of our growth. That's one of the opportunities that I'm currently working on with CNW. I'm hoping to hear back from them by the end of February.' Next steps: 'We've already submitted proposals for the event and MAC support that should bring an additional $25,000 a month.'",
      "action": "MAC services implementation strategy: (1) PROPOSAL STATUS: Submitted to CNW, $25K/month additional revenue, Response expected end of February 2026, (2) SCOPE: MAC SERVICES: Desk moves (major need with Boise growth), Conference room setups, Furniture moves/adjustments, Space reconfigurations, EVENTS SUPPORT: Event setup/breakdown, Coordination support, Materials handling, (3) PILOT LOCATIONS: Boise (primary - due to massive growth: Building 42, ID1, ID2), San Jose (secondary - flagship facility), (4) STRATEGIC RATIONALE: 'With all this growth happening in Boise, the MAC services is going to be a huge part of our growth', Building 42: 7-story admin building = significant desk moves/setups, ID1: 600K sq ft production lab = facility setup support, ID2: Second 600K sq ft lab = additional setup support, Return to office initiatives = desk moves and space reconfigurations, (5) MARK SCHLERF'S FEEDBACK: 'Plenty of sites do MAC work at SBM, just not in Boise', Siddarth is 'leaning into things where playbook isn't as well defined', 'Leaning on the vertical, the strength of the vertical', ACTION: Before February response, identify which SBM sites do MAC work, get their staffing models, pricing structures, client communication processes, operational playbooks, (6) NEXT ACTIONS IF APPROVED (VAL'S FEEDBACK - SET DATES): Pilot launch date in Boise, Pilot launch date in San Jose, Staffing plan: How many FTEs? What skills needed? Hire or train existing staff?, Equipment/supplies procurement date (moving equipment, furniture protection, tools), Training completion date for MAC services team, Client communication process setup (work order integration, scheduling, billing), Success metrics definition (what makes pilot successful for portfolio-wide rollout?), (7) NEXT ACTIONS IF NOT APPROVED: Understand CNW objections, Revise proposal (pricing? scope? timing?), Alternative approach (start with events only? smaller pilot?), (8) REVENUE IMPACT: $25K/month = $300K annual, If successful in Boise/San Jose, expand across portfolio (Longmont, Folsom, future Syracuse, Singapore?), (9) COMPETITIVE ADVANTAGE: SBM already on-site with 201 employees in Boise - convenience factor, Existing relationship with CNW - trust established, Knowledge of facilities - faster ramp-up than external vendor, (10) CONNECTION TO $35,771 INVESTMENT: 'My intention is to eliminate this $35,000 and introduce new programs into scope which warrant that $35,000', MAC services could be one of the programs that converts investment into billable, (11) VAL'S FEEDBACK EMPHASIS: 'By the end of February' is good, but then set: If approved: Pilot start date (March? April?), If not approved: Revision submission date, follow-up meeting date, (12) JAMES'S FEEDBACK APPLICATION: When discussing with CNW, emphasize SBM's innovation leadership, existing on-site presence, convenience and efficiency of single-vendor solution, Use as marketing opportunity to showcase SBM's versatility beyond janitorial",
      "source": "Transcript"
    },
    {
      "category": "Growth Opportunity - Manassas VA",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "Manassas VA - Lost 2024 RFP to Incumbent, Reaching Out to Jason De Boer for Next RFP Invitation",
      "quote": "Siddarth: 'Micron Manassas, VA, the last RFP was in 2024. We were invited to bid. It did not go in our favor. It went in the favor of the incumbent, but I've already reached out to the point of contact there. His name is Jason De Boer in hope to get invited for the next RFP at Micron in Manassas.'",
      "action": "Manassas VA re-engagement strategy: (1) HISTORY: 2024 RFP: SBM invited to bid, Lost to incumbent vendor, Relationship exists: Jason De Boer is POC, (2) CURRENT STATUS: Siddarth has reached out to Jason De Boer, Goal: Get invited to next RFP, (3) CONTEXT: Lost RFPs are learning opportunities, Incumbent advantage overcome by: Demonstrating differentiation (autonomous equipment, sustainability leadership, technology alignment), Building relationship during off-cycle (not just at RFP time), Showcasing SBM's Micron success at other locations, (4) JAMES'S FEEDBACK APPLICATION: 'Use every touch point as marketing communications opportunity', Don't wait for next RFP announcement to engage with Jason De Boer, Ongoing conversation strategy: Share Micron wins from other locations (Curbit Award, $201K Boise growth, autonomous equipment plans, Singapore expansion), Position SBM as Micron's strategic partner nationally, not just vendor, Offer to visit/present SBM capabilities, Include Jason in relevant updates (not spam, but strategic touches), (5) NEXT ACTIONS (VAL'S FEEDBACK - SET DATES): Jason De Boer follow-up meeting date - don't just leave at 'reached out', Manassas facility visit date - face-to-face relationship building, SBM capabilities presentation date - proactive, not waiting for RFP, Next RFP timing research - when is incumbent contract up? Set calendar reminder for 6 months before, Competitive intelligence - what did incumbent offer that won? How can SBM differentiate?, (6) DIFFERENTIATION STRATEGY: Highlight SBM's Micron portfolio: 6 sites across Boise, San Jose, Longmont, Folsom (not just single-site vendor), Technology leadership: Autonomous equipment partnership (Nilfisk), work order integration innovation, Waxy product, Sustainability: Curbit Award, compostable programs, paper product repurposing, carbon footprint focus, Scale: 201 employees at Boise alone, $1.1M monthly revenue in portfolio, proven large-scale management, Growth partnership: $201K growth in 2025, expanding to Syracuse, Building 42, ID1, ID2 - not static vendor, (7) RISK: Incumbent advantage is strong (they won 2024), 'Hope to get invited' is not a plan - need proactive relationship strategy, Without regular engagement, Jason De Boer may not think of SBM for next RFP, (8) VAL'S FEEDBACK EMPHASIS: 'By what day do you want to...' - Set specific Jason De Boer engagement dates: Q1 2026: Capabilities presentation, Q2 2026: Facility visit, Q3 2026: Follow-up on contract timing, Q4 2026: Pre-RFP relationship confirmation, (9) JAMES'S 'WHEN NOT IF': Change 'hope to get invited' to 'WHEN we're invited to next RFP' - then work backwards on relationship building to make that true, (10) STRATEGIC IMPORTANCE: Geographic expansion (Virginia), Demonstrates persistence (didn't give up after 2024 loss), Learning from loss and re-engaging strategically",
      "source": "Transcript"
    },
    {
      "category": "2026 Proposal Deliverables - In Progress",
      "reviewer": "Siddarth Shah (Self-Documented)",
      "title": "8 FTEs White Glove Service - $37K/Month Executive Building Restroom Enhancement Submitted",
      "quote": "Siddarth: 'We've submitted proposals for an additional 8 FTEs to enhance the white glove services in executive buildings and executive spaces specifically for restrooms that should be bringing in at least $37,000 a month.'",
      "action": "8 FTE white-glove service proposal: (1) PROPOSAL STATUS: Submitted (timing not specified), $37K/month additional revenue, Scope: 8 additional FTEs, (2) SCOPE: White-glove services in executive buildings, Executive spaces, Specifically focused on restrooms, (3) CONTEXT: San Jose is flagship facility (Sonia Marotta, CEO, sits there), 'New FM wanted more of a white glove service than what was agreed upon when we took on contract', This proposal addresses that elevated expectation, (4) STRATEGIC RATIONALE: Building 42 (7-story admin building) opening Q2/Q3 2026 - executive presence, Executive spaces require higher service standards, Restrooms in executive areas are high-visibility, high-impact, Proactive proposal vs reactive to complaints, (5) NEXT ACTIONS (VAL'S FEEDBACK - SET DATES): CNW/Micron decision date - when do you expect response? Follow-up date if no response by [specific date], If approved: Staffing recruitment timeline (8 FTEs - specialized white-glove skills), Training completion date (white-glove standards, executive building protocols), Implementation start date, If not approved: Understand objections, Revised proposal submission date, Alternative approach (fewer FTEs? different scope?), (6) REVENUE IMPACT: $37K/month = $444K annual, Combined with MAC services ($25K/month) = $62K/month = $744K annual in new proposals, (7) CONNECTION TO $35,771 INVESTMENT: Could this be part of converting the cost-avoidance investment into billable scope?, Current $35,771/month in free additional resources could justify this $37K proposal, (8) COMPETITIVE POSITIONING: Proactive vs reactive: Proposing enhancements before being asked/demanded, Aligns with client's elevated expectations (white-glove vs standard janitorial), Demonstrates understanding of executive building needs, (9) RISK: 8 FTEs is significant addition - are margins modeled correctly?, White-glove service is subjective - need clear KPIs/expectations documented, Executive spaces = higher scrutiny = higher performance pressure, (10) VAL'S FEEDBACK APPLICATION: Set specific dates: Decision expected by [date], Recruitment start date if approved, Training completion date, Go-live date, Success metrics date (how will white-glove service be measured?), (11) JAMES'S FEEDBACK APPLICATION: This is a marketing opportunity: Position SBM's white-glove capabilities, Use as example of proactive partnership (not waiting for RFP), Highlight in conversations with other Micron locations (Syracuse, Singapore), (12) STRATEGIC IMPORTANCE: Addresses 2025 San Jose challenge (white-glove expectations), Positions SBM for executive-level facilities (Building 42, future admin buildings), Differentiates from standard janitorial - moves SBM upmarket",
      "source": "Transcript"
    }
  ],
  "Jacob Reed": [
    {
      "category": "SMART Goals & Timelines - All 2026 Initiatives",
      "reviewer": "Valarie Barnett",
      "title": "Set Specific Dates for Every Goal - 'A Goal Without a Date is Just a Wish'",
      "quote": "Valarie: 'Overall, I think that you have really good high aspirations. I love that. But the only way that I can do that is for you to put dates. I jokingly say this on my OPS calls, and you've probably heard me say this before. A goal without a date is just a wish. So we have aspirations to get things done. It's almost like we hope to do these things, but the way that we can action them is by saying by this day I'm going to hold myself accountable to achieving XYZ. So if you say I want Optimus to be at one of the Tesla sites, we would need to know the release date of Optimus and then work backwards for implementation, purchase and implementation and start to come up with the actual strategy around that. If you say you want to win data centers along with John Mann and the tech team, where is that in play? When is the next RFP? So I'm looking for you to have a little more depth in this. I want you to develop this out. This is not a just like a one time feedback thing. This is a as you meet, whether it's with me, Nick, Nicole, this team, tech team, whoever as you meet, we want to hold you to your forward strategy and vision. So all these things are going to go into our Workday file, like each person's review. Your summary of your review is going to go into Workday. So will your personal goals.'",
      "action": "Set specific dates for all 2026 goals and initiatives: (1) OPTIMUS ROBOT IMPLEMENTATION: Research Optimus release date, Work backwards for purchase/implementation timeline, Set date for Tesla conversation about piloting Optimus, Define specific route or task for pilot (floors, bathrooms, trash, etc.), Set success metrics definition date, Valarie emphasized: 'We would need to know the release date of Optimus and then work backwards', (2) DATA CENTER (DOJO) RFP: Jacob mentioned Q2 2026 for Dojo RFP - get specific month, Set proposal preparation completion date, Set collaboration meeting date with John Mann/tech team, Set client presentation date, Define win strategy timeline, (3) LEADERSHIP DEVELOPMENT (3-6 months): Jacob said '3 to 6 months' for getting leadership (Francisco, Edgar) in front of Nico - pick specific date, Set Gloria and other supervisor MIT program completion dates (started this month), Define operations manager promotion timeline, Set client introduction dates for each leader, (4) EXTERNAL BUILDING SUPPORT: Set date for proposal submission, Set date for client decision, Implementation timeline if approved, (5) ROBO TAXI SCOPE: Set date for scope clarification meeting with Tesla, Decision timeline for SBM involvement, (6) SUSTAINABILITY/SUSTAINED GROWTH: Set quarterly check-in dates for '3-4 or 5 years down the road' sustainability validation, (7) VAL'S KEY MESSAGE: 'I want you to develop this out. We want to hold you to your forward strategy and vision. All these things are going to go into Workday as your actionable goals for 2026. I want to be able to sit down next year and go, man, look at what you were able to accomplish last year because you had a plan. Everything needs a date. Everything that you have shared with us today, I am excited. I want to be a part of those things with you, but I also want to hold you accountable because I can't do them for you.'",
      "source": "Transcript"
    },
    {
      "category": "Internal Gaps & Accountability",
      "reviewer": "Valarie Barnett",
      "title": "Own Internal Challenges - Missing #2 Position & Service Delivery Gaps",
      "quote": "Valarie: 'I don't feel like we necessarily owned any of the gaps on our side or problems that we had. I also was looking for corrective actions and timelines to some of the challenges or issues that we had, what came up or where are we with those things now? And what are our actions that we're taking in order to solution them in 2026? If there were any gaps, just want you to be transparent about whatever the gaps are. If it's service delivery, I think one of the gaps we experienced last year going into this year would have been that we didn't have, you didn't have a #2 right on the site for an extended period of time. I think that that's something that would have been a clear thing to call out, whether it be recruiting, whether it be the quality of candidates we had.'",
      "action": "Acknowledge and document internal gaps with corrective actions: (1) #2 POSITION GAP: Jacob didn't have a #2 on site for extended period, Corrective action needed: How was this resolved? When was position filled? What was impact? What's the plan to prevent future gaps?, (2) SERVICE DELIVERY CHALLENGES: Jacob mentioned 'there was some hiccups' and 'challenges' but didn't detail them in presentation, Valarie wants transparency about internal problems, not just client-side issues, Action: Document any service delivery gaps in 2025, Root cause analysis for each gap, Corrective actions taken and timelines, Prevention strategies for 2026, (3) SAFETY POSITION: Jacob called out safety as a problem that Dave Stauffer fixed, Good transparency, but need timeline: When did gap occur? How long was it unfilled? When was it resolved? What was impact during gap period?, (4) VAL'S EXPECTATION: 'This is a safe space. I appreciate you identifying the challenges as it pertains to Tesla site management changes, but I don't feel like we necessarily owned any of the gaps on our side. So safety was a problem for us. So it sounds like we're fully realigned there. Have we reinstated the safety position at Tesla?' (Jacob confirmed yes, quarterly Dave visits, Nico at ease), (5) 2026 PREVENTION: For any future internal gaps: Immediate acknowledgment, Root cause analysis, Corrective action with timeline, Communication plan to leadership, (6) TRANSPARENCY PRINCIPLE: Don't hide internal problems or only focus on client-side challenges, Own SBM gaps openly in reviews, Show what was learned and how it was fixed",
      "source": "Transcript"
    },
    {
      "category": "ForoInsight Asset Management Implementation",
      "reviewer": "Valarie Barnett",
      "title": "Track Equipment Check-In/Check-Out & Usage Hours for Tesla",
      "quote": "Valarie: 'I challenge you in 2026 to see if there's a way to incorporate the asset management tracker for the check in check out portion just so that you have the records. You may not want to. Maybe we're not tracking the assets in a way that we own them, but maybe we could at least track the check in, check out the hours usage so that you can produce a log to Tesla in addition to the trainings that you're doing.' Jacob context: 'We're not yet [using asset management] just because those are rented out through Tesla. One of the things they brought up was essentially they're getting to the point where it makes sense to buy them. So one of the asks for quarter two, quarter three was to potentially submit pricing for buying them out, right. And then that's what we would flip on the asset management because it would be SBM owned through Tesla using it out.' Valarie followup: '100% So that's OK. Just a challenge for 2026. I'm writing notes, so you'll get my note about that.'",
      "action": "Implement ForoInsight asset management for Tesla equipment tracking: (1) CURRENT STATE: Equipment is Tesla-owned/rented (like Optimus model), Jacob said 'We've done Excel sheets, but eventually the Excel sheet thing gets kind of redundant and not as tasteful', Monthly equipment trainings happening but no systematic tracking, (2) VAL'S CHALLENGE: Use ForoInsight asset management feature for check-in/check-out tracking, Track usage hours per machine, Produce logs for Tesla showing equipment usage patterns, Complement monthly training program with usage data, (3) JUSTIFICATION: Tesla was upset about equipment going down, thinking it was SBM's fault/negligence, Usage tracking + training logs = proof of proper care and maintenance, Data-driven approach to demonstrate equipment stewardship, (4) TIMELINE: Set date for ForoInsight asset management setup, Set date for training team on check-in/check-out process, Set date for first usage report to Tesla, Quarterly review dates for usage data analysis, (5) POTENTIAL EQUIPMENT PURCHASE (Q2/Q3 2026): Jacob mentioned Tesla considering buying equipment vs renting, If equipment purchased and becomes SBM-owned through contract, full asset management tracking becomes essential, Set dates: Equipment purchase proposal submission, Decision timeline, Asset management full implementation if purchased, (6) JACOB'S RECOGNITION: 'I think that's the route we want to go. We definitely want to be able to showcase the ForoInsight thing that's been the big picture seller for kind of moving on to 2026 is ForoInsight really showcases the difference between us and the other vendors.', (7) STRATEGIC VALUE: Differentiates SBM from other vendors (data-driven equipment management), Addresses Tesla's concerns about equipment care proactively, Positions SBM as tech-savvy, professional partner, Provides ammunition for equipment purchase justification",
      "source": "Transcript"
    },
    {
      "category": "Documentation & Scalability",
      "reviewer": "John Mann",
      "title": "Document Flood Support Process for Multi-Site Scaling",
      "quote": "John: 'That sounds like a great value add. Jacob, that's something that sounds like it's pretty scalable. Do you happen to have any like formal documentation around kind of what equipment you're using or what the workflow is for that within like the management team or the team so we can help scale that across other locations potentially?' Jacob: 'Yes, Sir. We're working on it right now. It's mainly just kind of a process driven. One of the feedback they gave us is that it just felt like there was just a cluster of people where it's like the old fashioned, you know, there's a fire in the building and everybody's grabbing buckets and running around. And now it's more of an alignment of showing leaders that are coaching, maneuvering people around or utilizing floor scrubbers, the tenants and there's just a process to it.' John: 'Cool. Yeah, that'd be great. That'd be cool. Best practice. Thanks.'",
      "action": "Create formal documentation for flood support process: (1) CURRENT STATE: 'We're working on it right now' - documentation in progress, Process driven by leaders coaching and maneuvering teams, Using floor scrubbers, Tenants (equipment), Systematic approach vs 'cluster of people grabbing buckets', (2) DOCUMENTATION NEEDED: Equipment list (floor scrubbers, Tenant equipment, water extraction tools, etc.), Workflow diagram: Initial assessment, Team deployment, Water containment, Extraction process, Cleanup and verification, Production coordination, Leadership roles: Who coaches? Who deploys? Who coordinates with Tesla production?, Response time benchmarks (45 min - 1 hour max), Training requirements for team members, Safety protocols, Communication process with Tesla during flood events, (3) VALUE PROPOSITION TO DOCUMENT: Time reduction: 4 hours → 45 minutes (75% improvement), Cost savings: $200K annually by eliminating subcontractors, Production uptime protection, Professional appearance ('Team looks like they're supposed to be there'), (4) SCALABILITY GOAL: John Mann identified this as scalable across other SBM locations, Other sites may have similar needs (manufacturing, data centers with water risks), Best practice for SBM enterprise-wide, (5) TIMELINE: Set completion date for documentation, Set review date with John Mann and tech team, Set date for presenting to other ADs/sites as best practice, (6) STRATEGIC IMPORTANCE: Differentiates SBM as emergency response capable, Quantifiable value add ($200K), Trackable metrics (time, cost), Replicable process for portfolio growth",
      "source": "Transcript"
    },
    {
      "category": "Data Center Strategy & Collaboration",
      "reviewer": "John Mann",
      "title": "Collaborate with Tech Team on Dojo Data Center Expertise & RFP Strategy",
      "quote": "John: 'I appreciate it is really good to learn, kind of understand Jacob and kind of get up to speed of how we can support you. Also want to make sure we talk through data centers more, right. We've got a pretty talented team out here. So what can we do to support that the information, the communication, the client, the operational excellence, you know, kind of mitigating the risks, but with the knowledge we already have. So happy to help you on that. Looking forward to it.' Jacob context: 'I really want to be that data center person for Tesla. I think it's a huge opportunity for us. Once you get into that data center environment it kind of expands from there. I'm sure John can let everybody know that. A lot of people think that data center cleaning is just normal warehouse bare footage cleanings. But there really is a science and kind of a dance to it and I want to be able to lead with that. I'm telling them like, hey, we're the experts when it comes to data centers there. The first one is going to come open for RFP in Q2 of 2026. That is the dojo that you guys are probably familiar with. We're already in there. We have about 4 to 5 employees in there servicing it. We stay ahead of those conversations. We meet with the different teams that are running it.'",
      "action": "Data center collaboration and RFP preparation plan: (1) DOJO RFP TIMELINE: Q2 2026 (April-June) - get specific month for RFP, Flagship data center for Austin area/Boston Tesla, Currently servicing with 4-5 employees (foot in door), Meeting with teams running it (Roger and his team - different from Nico/workplace), (2) JOHN MANN COLLABORATION AREAS: Information: SBM's data center best practices, industry standards, Tesla-specific requirements, Communication: Joint messaging for RFP, positioning SBM as data center experts, Client: Leveraging tech team's data center client relationships/case studies, Operational excellence: Tech team's playbook for data center cleaning protocols, Risk mitigation: What are common data center pitfalls? How to avoid them?, (3) JACOB'S LEARNING NEED: 'A lot of people think that data center cleaning is just normal warehouse bare footage cleanings. But there really is a science and kind of a dance to it', John's team has this expertise - transfer knowledge to Jacob's team, Train current 4-5 employees on data center best practices before RFP, Differentiate SBM's approach in RFP vs competitors, (4) POSITIONING STRATEGY: Jacob wants to 'lead with' data center expertise, 'Tell them like, hey, we're the experts when it comes to data centers', John's team provides credibility and track record for this claim, (5) MEETING/COLLABORATION TIMELINE: Set date for joint strategy session with John Mann/tech team, Set date for data center training for Jacob's 4-5 current Dojo employees, Set date for RFP preparation collaboration, Set date for client presentation dry run with tech team feedback, (6) RFP PREPARATION: Leverage SBM's data center portfolio (John's team), Quantify Jacob's current Dojo performance (4-5 employees - what metrics?), Differentiate from 'normal warehouse cleaning' narrative, Demonstrate 'science and dance' understanding, Address Roger's team separately from Nico's workplace team, (7) EXPANSION VISION: Jacob: 'Once you get into that data center environment it kind of expands from there', Dojo win = pathway to more Tesla data centers (X AI, other mergers mentioned), Set dates for pursuing additional data center opportunities after Dojo",
      "source": "Transcript"
    },
    {
      "category": "Strategy Documentation & Tracking",
      "reviewer": "Nick Mcmackins",
      "title": "Memorialize Presentation Highlights in Writing for Leadership Support & Tracking",
      "quote": "Nick: 'I won't repeat everything, Jacob. Obviously I'm close to a lot of what you're doing, but always just good hearing you repeat the strategy. I would like to, as others said, like memorialize it more on paper of what you feel the opportunities are both positive meaning revenue and just how we can support you better so you can deliver that. I think most of us are traveling next week, but maybe by the end of the week try and put something together of like every the highlights of what you presented today and just memorialize it down so we can track it and support you better on it.'",
      "action": "Create written strategy document from presentation: (1) TIMELINE: Nick suggested 'by the end of the week' (most leadership traveling next week), Set specific date for strategy document completion, (2) CONTENT TO MEMORIALIZE: REVENUE OPPORTUNITIES: Data center (Dojo) Q2 2026 RFP with estimated value, Robo taxi scope expansion with revenue estimate, External building support with pricing, Any other scope expansion discussions, Equipment purchase opportunity (Q2/Q3), SUPPORT NEEDS FROM LEADERSHIP: John Mann/tech team collaboration on data centers, Recruiting/HR support for continued rapid scaling, Equipment budget/approvals, ForoInsight asset management setup support, Optimus pilot approval and budget, GOALS & TIMELINES: Leadership development (Francisco, Edgar, Gloria + 3 MIT supervisors), 3-6 month timeline for client visibility, Single vendor positioning expansion, Sustained growth validation checkpoints, WINS TO TRACK: $200K flood support savings (annually), $250K holiday/shutdown savings (annually), #1 ranking out of 6 programs on Work ticketing, 1.2M sq ft tape laid by taping team, 2-week rapid scaling capability, (3) PURPOSE: Nick: 'So we can track it and support you better on it', Leadership wants to hold Jacob accountable to goals (Valarie's Workday comment), Leadership wants to know how to support Jacob's success, Tracking revenue opportunities for pipeline visibility, (4) FORMAT: Highlights of presentation (key accomplishments, wins, metrics), 2026 opportunities with revenue potential, Timelines for each initiative (per Valarie's 'dates' feedback), Support needed from leadership for each initiative, Success metrics for tracking, (5) DISTRIBUTION: Submit to Nick, Valarie, Nicole, John Mann, tech team, Share with Nico (client) as applicable for transparency, (6) ONGOING: Not one-time - update quarterly or as initiatives progress, Use for check-ins with leadership, Reference for mid-year and year-end reviews",
      "source": "Transcript"
    },
    {
      "category": "Presentation Skills & Visual Communication",
      "reviewer": "Valarie Barnett",
      "title": "Develop Visual Presentations - Highlight Key Takeaways in ForoInsight or Slides",
      "quote": "Valarie: 'I think you presented very well overall here today. You should be proud of what you've been able to communicate to us. It's just a little bit of the details are missing and I think a visual would have been extremely helpful even if you went in ForoInsight and kind of highlighted some of the key things or takeaways and then even if you didn't have a visual for the rest, but it wasn't required. This was a test to see how each person would respond to the request and overall thought you did pretty well.' Context: Valarie asked early on: 'Do you have a PowerPoint you're presenting from? If you do, for whatever reason, the screen just isn't sharing with us.' Jacob: 'No, I'm just reading from notes here. The PowerPoint is the one that's with ForoInsight, but no, I'm just reading off the notes I have here.'",
      "action": "Develop visual presentation skills for future client and leadership meetings: (1) VAL'S FEEDBACK: 'A visual would have been extremely helpful', Suggestion: Use ForoInsight to highlight key takeaways, OR create separate slide deck for key points, Then supplement with verbal notes for additional context, (2) THIS WAS A TEST: 'This was a test to see how each person would respond to the request', Jacob presented well overall but missed visual component, For future executive meetings, visuals will be expected/required, (3) FORINSIGHT AS VISUAL TOOL: Jacob mentioned 'The PowerPoint is the one that's with ForoInsight', Valarie suggested: 'Even if you went in ForoInsight and kind of highlighted some of the key things or takeaways', ForoInsight can serve as visual aid for data-driven presentations, (4) WHAT TO VISUALIZE: Key metrics: $200K flood savings, $250K holiday savings, #1 ranking, 1.2M sq ft tape, Timeline graphics: 2026 goals with dates (per Valarie's feedback), Leadership development roadmap (3-6 months), Data center RFP timeline (Q2 2026), Organizational charts: Francisco, Edgar, Gloria roles; MIT program structure, Process flows: Flood response workflow (per John Mann's documentation request), Revenue opportunities: Data center, robo taxi, external buildings with $ values, (5) 2026 APPLICATION: Client presentations (Nico, Roger for data center), Leadership QBRs (Nick, Valarie, Nicole), RFP presentations (Dojo data center Q2), Training/onboarding visuals for rapid scaling support, (6) JACOB'S STRENGTH: Valarie: 'You're extremely knowledgeable about your account. You're very confident when you speak. That's the type of presence that will want us to bring you into an executive meeting.' Add visuals to complement confidence and knowledge, 'Under the right leadership, I can see you focusing on flushing out your goals for 2026 and executing your actual vision.'",
      "source": "Transcript"
    },
    {
      "category": "Optimus Robot Implementation - Strategic Approach",
      "reviewer": "Jacob Reed (Self-Documented) + Valarie Barnett (Feedback)",
      "title": "Set Realistic Timeline for Being First SBM Vendor to Implement Optimus",
      "quote": "Jacob: 'My kind of goal here and I need you to kind of be patient with me is I want to be the first vendor to implement Optimus into one of our programs, one of our routes. I want to be the one that gets ahead of it with Tesla early to say like hey, let us be kind of the Guinea pig with getting this Optimus robot to either clean floors, clean the bathroom, service something, pick up trash, do something. I think it does a really good job of saying like, hey, we're willing to jump to those risky avenues with you. I think it too, it also helps shift like, hey, let us set up the narrative of this is what Optimus can do at the maximum instead of the latter where Tesla tells us, hey, we're gonna give you guys 5 robots, we need you to incorporate it, but we also need to cut 30% of your headcount. So I think it really does a really good job of allowing us to kind of tell them what we think Optimus to do instead of them telling us what we need to do with it. That's something I want to get to and have those conversations with you guys, but obviously I'll give you some time to chew on that. It's not like I'm going to do it tomorrow. I just want to be able to kind of let them know in the conversation like, yeah, I think it's really, really awesome to be in there with what Tesla's moving to.'",
      "action": "Optimus implementation strategic planning: (1) JACOB'S VISION: Be FIRST SBM vendor to implement Optimus robot, Pilot one route or task: floors, bathrooms, trash pickup, 'Guinea pig' approach - willing to test risky avenues, STRATEGIC GOAL: Control the narrative of what Optimus CAN do (maximize capabilities), vs Tesla dictating what Optimus MUST do (replace 30% headcount), Proactive vs reactive positioning, (2) VAL'S FEEDBACK ON TIMELINE: 'A goal without a date is just a wish', 'If you say I want Optimus to be at one of the Tesla sites, we would need to know the release date of Optimus and then work backwards for implementation, purchase and implementation and start to come up with the actual strategy around that', Need concrete timeline, not aspirational 'I want to', (3) REQUIRED RESEARCH/PLANNING: Optimus release date: When is it commercially available for pilot?, Optimus capabilities: What CAN it realistically do in 2026? (floors, bathrooms, trash - is this feasible?), Cost: Purchase vs lease? Budget approval needed?, Training: What's required to operate/maintain Optimus?, Integration: How does it work with existing routes/team?, Success metrics: How will pilot be evaluated?, (4) CONVERSATIONS WITH LEADERSHIP: Jacob: 'I want to have those conversations with you guys', Set date for Optimus strategy discussion with Nick, Valarie, Nicole, Set date for Tesla conversation about piloting (after internal approval), Get leadership buy-in before proposing to Tesla, (5) RISKS TO ADDRESS: Jacob's concern: 'Tesla tells us give you guys 5 robots, we need you to incorporate it, but we also need to cut 30% of your headcount', How to position pilot to avoid headcount reduction mandate?, What's the ROI that protects jobs vs eliminates them?, Is Optimus pilot genuinely helpful or just following Tesla's vision without SBM benefit?, (6) TIMELINE PRESSURE: Jacob: 'It's not like I'm going to do it tomorrow', But also: 'I want to be the FIRST vendor', Need to balance patience/realism with first-mover advantage, Other vendors may be having same conversations with Tesla, Set specific milestones: Q1 research, Q2 leadership approval, Q3 Tesla proposal, Q4 pilot?, (7) VAL'S OVERALL MESSAGE: 'I want to help you get there. But the only way that I can do that is for you to put dates. I want you to develop this out. Everything needs a date.'",
      "source": "Transcript"
    },
    {
      "category": "Leadership Development & Succession Planning",
      "reviewer": "Jacob Reed (Self-Documented)",
      "title": "Execute 3-6 Month Timeline for Francisco, Edgar & MIT Supervisors Client Visibility",
      "quote": "Jacob: 'More or less just giving them that confidence in 2026, like, hey, there's a structure of really great site managers. There's really good operations managers through the new structure that you announced and more or less getting those custodial supervisors in that mindset of like, hey, the next step as an operations manager is getting the operations managers into that mindset of like how do how do we get you to be a site manager. They haven't asked me the why yet, but I want to get ahead of it now to be able to say, hey, these are the leaders you can lean on and these are the people that are going to help bring that really beautiful program that we built here to the outside, outward expansion. In terms of your timeline there, I think getting the leadership and stuff like that, I want that to be in the next three to six months of really kind of getting them in front of Nico and then kind of taking a step back and saying, hey, they can do it there. I think Francisco and Edgar are really taking another approach and getting themselves into a limelight of like, OK, I trust Francisco, I trust Edgar and I want to continue to harbor that and get the next group already in that spotlight instead of just kind of waiting for things to fall and then throw them in there.'",
      "action": "Leadership development execution plan (3-6 months): (1) PRIMARY LEADERS (Francisco, Edgar): CURRENT STATE: 'Really taking another approach and getting themselves into a limelight', Nico starting to trust Francisco and Edgar, Jacob wants to 'continue to harbor that', GOAL: Get them in front of Nico consistently over next 3-6 months, Jacob 'taking a step back' - let them lead vs Jacob leading, Position them as go-to contacts for their areas, TIMELINE: Set specific date (3-6 months from now = April-July 2026) when Francisco and Edgar are primary client contacts, Set monthly milestones for client interactions, (2) MIT PROGRAM FOR SUPERVISORS: CURRENT STATUS: Started this month (January 2026), Selected 3 supervisors: 'hearty and ambitious', 'Shown they understand the capacity and need of Tesla', GOAL: Show them what's expected of operations manager, Create backup plan for quick deployment ('not a run around free for all'), Example: 'Gloria's going to be the OPS manager of the data center', TIMELINE: Set MIT program completion date (what month?), Set operations manager promotion timeline for successful graduates, Define 'what is expected of OPS manager' - document this, (3) CUSTODIAL SUPERVISORS DEVELOPMENT: Getting into mindset that 'next step is operations manager', Creating pipeline of leadership talent, Not waiting for 'bricks to fall' and then 'shove a brick in there', (4) STRATEGIC RATIONALE: Tesla concern: 'Things will get stretched too thin' with scope expansion, Jacob's response: Show strong leadership structure can handle growth, External building, data centers, robo taxi = need more leaders, 'These are the leaders you can lean on', (5) CLIENT VISIBILITY MILESTONES (3-6 MONTH PLAN): Month 1-2: Francisco and Edgar handling specific projects with Nico visibility, Month 3-4: Francisco and Edgar leading client meetings with Jacob attending, Month 5-6: Francisco and Edgar as primary contacts, Jacob in background, Throughout: MIT supervisors shadowing, learning, preparing for next level, (6) ACCOUNTABILITY: Set specific date for leadership handoff milestone review, Define success metrics: Client feedback on Francisco/Edgar?, Number of client interactions they lead?, Problems resolved independently?, (7) EXPANSION PREPAREDNESS: Once leadership proven, ready for: Data center (Dojo) RFP - Gloria as OPS manager?, External buildings - Francisco or Edgar leading?, Robo taxi scope - dedicated leader?, New scope = new leaders ready to deploy",
      "source": "Transcript"
    }
  ],
  "Jeremy Johnson": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Make Personal Goals SMART - Specific, Dated, Actionable",
      "quote": "Valarie: 'Your lowest score was your personal professional goals... I would love to hear your personal goal. I want to be able to give you all the credit in the world... What are your personal goals in a SMART format?' Jeremy: 'I want to force myself out of my comfort zone to learn something new.' Valarie: 'That's not very specific. Do you want to learn Lam Research? Life sciences? Technology and AI innovation at ForoInsight? What is your specific thing? When do you want it done by?' Jeremy: 'By Q3... broaden my horizon beyond Intel.' Valarie: 'I would agree. I definitely think you could take on more once you get through this RFP situation. Your brain has the capacity to learn a specialty different than something you know today.'",
      "action": "Define personal goal in SMART format: (1) Specific: What domain? (Lam Research, life sciences, tech/AI at ForoInsight, etc.), (2) Measurable: How will success be defined?, (3) Dated: By Q3 2026 (per Jeremy's commitment), (4) Actionable: Concrete steps to broaden beyond Intel",
      "source": "Transcript"
    },
    {
      "category": "Leadership & Succession",
      "reviewer": "Valarie Barnett",
      "title": "Bring Someone Under Your Wing - Develop 'Jeremy Part 2'",
      "quote": "Valarie: 'I challenge you to bring someone specifically under your wing. SBM is at a major disadvantage that someone is not with you at all times, observing, listening, learning. You should have a recent college graduate at 2-6, maybe 2-8 years max that all they do is follow you around. They go to meetings with you, they help you organize, you correct them non-stop, train with you for ~6 months. Then you say to me, Valarie, I've had this person, they really could take on that next monster account. I want a Jeremy Part 2. The only thing you can do for me is give me someone else who can operate at the level that you do.'",
      "action": "Identify shadow/mentee: Recent college grad (2-8 years max); have them follow Jeremy to meetings, whiteboarding sessions (e.g. with Mark Schlerf, Alex Kennedy); 6-month training commitment; define success metrics for mentorship; goal: person ready to take on next monster account",
      "source": "Transcript"
    },
    {
      "category": "Leadership & Succession",
      "reviewer": "Valarie Barnett",
      "title": "Include Amani (and Future Mentees) in Key Meetings",
      "quote": "Valarie: 'Do you take her to meetings like this one? Is she in the room with you and Mark Schlerf when you whiteboard? Is she in the room?' Jeremy: 'No, not as much as she could be. We'll give ourselves grace in first 60 days.' Valarie: 'If you're pouring into Amani, what are your measurements of success whether you've mentored her well or not?'",
      "action": "Include Amani in: Strategic calls (like this review), Whiteboarding sessions with Mark Schlerf/Alex Kennedy, Key client and leadership meetings; Define mentorship success metrics",
      "source": "Transcript"
    },
    {
      "category": "Documentation & Sharing",
      "reviewer": "Valarie Barnett",
      "title": "Prep Air Freshener Pilot for Broader Ops Call",
      "quote": "Valarie: 'We need to share that on the bigger, broader monthly call. So please prep for that or have Alyssa actually prep to speak to everyone on the bigger, broader monthly call for all of operations and in that maybe have some costs and things.'",
      "action": "Prepare air freshener pilot presentation for broader ops monthly call; Include Alyssa (Amazon) to present; Include cost data (20% savings) and end user feedback (90% favorable)",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Flush Out Clean Room Technology Differentiation & Timeline",
      "quote": "Valarie: 'When do you think you'll have a solution for a clean room? What's your plan? Flush that out just a little bit more as far as what the differentiation will be. We don't currently know what that is, but the goal will be to discover the differentiators for clean room space.' Jeremy: 'Every floor task in clean room is completely manual. If we introduce technology that takes away mop and bucket - significant safety, ergonomic, cost savings. Hurdle is making change to controlled environment. LAM has Safety iMop on site - goal to put hands on in Q1, proposal out Q2. Intel moves slower - implementation by end of year.'",
      "action": "Document clean room differentiation: Manual-to-automated value prop; safety/ergonomic/cost savings; Q1: hands on LAM Safety iMop; Q2: proposal to Intel; End of year: Implementation target",
      "source": "Transcript"
    }
  ],
  "RJ Ober": [
    {
      "category": "Financial Strategy",
      "reviewer": "Valarie Barnett",
      "title": "Get Specific Date for Budget Correction / Cost Increase",
      "quote": "Valarie: 'Do you have how you're gonna get it on budget? When will we have a date? When will we know about increasing our costs to offset how bad we are upside down?' Valarie: 'Our contract is technically over and we're going to wait until after the RFP process. What's the timeline on the RFP?' Valarie: 'That's the most pressing question I have about IBM, just the budget.'",
      "action": "Establish specific timeline: When does RFP process start? When will pricing/cost increase decisions be made? Communicate date to leadership for when budget correction is expected",
      "source": "Transcript"
    },
    {
      "category": "Relationship & Governance",
      "reviewer": "Nick Viskovich",
      "title": "Loop in Melissa Hampton - JLL Executive Sponsor",
      "quote": "Nick: 'We shouldn't be - if you haven't already - looped in Melissa Hampton who's overseeing our executive sponsor over the JLL portfolio to get involved in those conversations early and often, especially with your end scorecards coming up. That opportunity to connect her and let her be some connective tissue in the background that continues to drive the relationship and speak to some of the innovation opportunities.'",
      "action": "Connect Melissa Hampton (JLL executive sponsor) early and often; leverage for end scorecard reviews; use as connective tissue for innovation conversations (e.g. mobile conversion, AI audits)",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Technology",
      "reviewer": "Nick Viskovich",
      "title": "Implement AI/Real-Time Audits - Get Sticky Before June",
      "quote": "Nick: 'Have you showed them or would they have any interest in what we're doing with real time validations and AI assessments? We've gone from 400 audits a month to 2000 a day at La Guardia. We have a short window to get really sticky... these next couple of QBRs are going to be so important. Leverage Melissa on the solution side to have those conversations and try to get something implemented now.'",
      "action": "Show IBM/JLL real-time audits and AI validations (La Guardia example); set up walkthrough with Nick; aim to implement before June renewal; leverage Melissa Hampton for solution-side conversations",
      "source": "Transcript"
    },
    {
      "category": "Transition Management",
      "reviewer": "Valarie Barnett",
      "title": "Austin Transition - Partner with Transitions Team & Good Trainer",
      "quote": "Valarie: 'Who from the transitions team will be supporting? I just want to make sure you partner with a good trainer.' Valarie: 'It's a 90 day transition which is really long for us - we typically transition in 30 days. I'd like to understand that a little bit more - who you're partnered with, who's going to own it. You'll be owning it from customer facing perspective, but from an operations perspective they can't leave that on you - you don't know what you're doing yet.'",
      "action": "Identify transitions team support; partner with experienced trainer; clarify operational ownership (R.J = customer facing; operations team = operational execution); understand 90-day timeline rationale",
      "source": "Transcript"
    },
    {
      "category": "Professional Development",
      "reviewer": "Valarie Barnett",
      "title": "Deepen Operational Understanding - Stay Through Transition",
      "quote": "Valarie: 'It's gonna be important that you start digging into to the best of your ability to understand the overall operation. Getting on the transition staying from start to finish - not meaning you have to stay there for four weeks or 90 days, but you do need to be in a position where you can get those set up and running and be paying close attention to operations because you learn the most through the transition process.'",
      "action": "Be present through Austin transition start to finish; dig into overall operation; pay close attention to operations; use transition as learning opportunity",
      "source": "Transcript"
    },
    {
      "category": "Key Projects & Initiatives",
      "reviewer": "Yousef Abbasi",
      "title": "Document Scope Misalignment Origin & Corrective Steps",
      "quote": "Yousef: 'Regarding scope alignment, I would have appreciated additional detail on how the misalignment originated and whether any corrective steps were taken before end user concerns surfaced and the final resolution was reached. It would also be helpful to understand how our partnership and working relationship with JLL influenced the process and outcome.'",
      "action": "Document: (1) How scope misalignment originated, (2) Corrective steps taken before vs after end user concerns, (3) How JLL partnership influenced process and outcome",
      "source": "Scorecard"
    }
  ]
}