{
  "Jacqueline Maravilla": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Develop Growth Strategy for New Alonza Sites",
      "quote": "Path forward grow opportunities for 2026 for Vacaville. JLL has let me know that they are expanding.",
      "action": "Create growth plan for Vacaville expansion and 4 new Alonza accounts; document retention strategy",
      "source": "Transcript"
    }
  ],
  "Peggy Shum": [],
  "Kimberly Wittekind": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Kyle Wallace",
      "title": "Define Action Plan for Data Integrity Goals",
      "quote": "Additional understanding desired for how we plan to achieve goals - actionable, measurable, and tangible plan.",
      "action": "Create specific action plan with milestones for 4insite data cleanup and expectation realignment",
      "source": "Transcript"
    }
  ],
  "Paul Rhodes": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Melissa Hampton",
      "title": "Define Value Creation Strategy with Specifics",
      "quote": "How do you plan to increase engagement? What will you do with the account clarity? How will you create value?",
      "action": "Develop specific action plans with timelines for engagement, clarity, and value creation initiatives",
      "source": "Transcript"
    },
    {
      "category": "Key Projects & Initiatives",
      "reviewer": "Yousef Abbasi",
      "title": "Articulate Client Perspective on Projects",
      "quote": "I'd like deeper insight into the client's perspective and how these projects have influenced overall performance and strengthened/impacted the partnership.",
      "action": "Gather and document client feedback on project impact; incorporate client voice into future presentations",
      "source": "Transcript"
    }
  ],
  "Mark Schlerf": [
    {
      "category": "Strategic Planning",
      "reviewer": "Ryan Blackwood",
      "title": "Define Actual Plan for LAM Transition",
      "quote": "I would have liked to have seen your actual plan around LAM transition and increase. How will you use the dollars? What's the schedule and rollout for that increase?",
      "action": "Develop detailed LAM transition roadmap with budget allocation, timeline, and rollout schedule",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Ryan Blackwood",
      "title": "Articulate Personal AD Role Goals",
      "quote": "I would have liked to have understood your goals you have for yourself that aligns to the AD role.",
      "action": "Define measurable personal development goals specific to Account Director leadership growth",
      "source": "Transcript"
    }
  ],
  "Ana Sabater": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Shane Follmann",
      "title": "Add Personal Career Growth Goal",
      "quote": "I would have appreciated hearing about something you wanted to work on for your own career growth.",
      "action": "Identify one personal skill or capability to develop beyond account-level objectives",
      "source": "Transcript"
    }
  ],
  "Patrick Murtha": [
    {
      "category": "Leadership & Communication",
      "reviewer": "Valarie Barnett",
      "title": "Don't Sit on Problems - Proactively Ask for Help",
      "quote": "I challenge you to, even if you can't solve it, you're saying I need help with this... Everybody's too busy. Like, no, we we want to solve the problems because if you don't solve it, then it becomes our problem anyway.",
      "action": "Develop escalation plan for CW communication gaps; proactively engage Mike Jedan and Marvin for support on relationship challenges",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to 2026 Goals",
      "quote": "Any goal without a date attached to it is a wish... when will you have all of these things done?",
      "action": "Assign specific completion dates to all 2026 goals (Cardinal retention strategy, IQVIA CSAT improvement, McKesson contract alignment)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Specific Actions for Goals (Not Just Wishes)",
      "quote": "What are you hoping to achieve under it? Yes, we want an agreed contract, but the deliverables are to them... what are the issues and the root causes?",
      "action": "Define specific actions, root causes, and success metrics for each 2026 goal (KPI alignment, governance expectations, technology roadmap)",
      "source": "Transcript"
    }
  ],
  "Aaron Simpson": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Nicole Ouimet",
      "title": "Define 3M Growth Strategy to Compete with Compass",
      "quote": "How do those things differentiate from what Compass is delivering today to gain momentum, to gain the growth of three M? ... I think the the goal that you should be looking at is how do, how do we get them [the full portfolio]?",
      "action": "Develop specific initiatives with deliverables and dates to differentiate from Compass and win full 3M portfolio; focus on sustainable growth vs ATB",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to ALL Goals",
      "quote": "A goal without a date is a wish... By what day will you have executed your first cross portfolio sync? By what day will you have for insight where you can 100% rely on the data?",
      "action": "Assign specific dates to all 2026 goals (cross-portfolio sync, ForSight data integrity, Mars heat map implementation)",
      "source": "Transcript"
    },
    {
      "category": "Operational Excellence",
      "reviewer": "Valarie Barnett",
      "title": "Challenge Team on Data Transparency (No Osmosis)",
      "quote": "I challenge you to... Tell the regional team nobody's getting in trouble for the failures or the misses. We just want to capture all of the information accurately.",
      "action": "Implement data transparency reset with regional teams; create safe environment for honest reporting; validate ForSight accuracy",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Implement Mars Heat Map with Timeline",
      "quote": "Figuring out... we can be more proactive instead of reactive... I think you'll be able to solve for that [with heat map].",
      "action": "Create Mars portfolio heat map combining audits, complaints, and staff status; define rollout timeline and proactive intervention triggers",
      "source": "Transcript"
    }
  ],
  "Taylor Wattenberg": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Relationship Strategy",
      "quote": "Being a trusted provider, an expert, a point of authority for sustainability is important. Also important is relationship strategy - how are you connecting and with whom?",
      "action": "Map key stakeholders and define engagement strategy with specific touchpoints and objectives",
      "source": "Transcript"
    }
  ],
  "Jack Thornton": [
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Account Elevation Plan with Timelines",
      "quote": "I'd like to hear how the account will be elevated. More planned initiatives with timelines. Who are you mentoring?",
      "action": "Create 2026 account elevation roadmap with specific initiatives, dates, and mentorship plan",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Shane Follmann",
      "title": "Add Personal Skills Development Goals with Timeline",
      "quote": "I agree with all of the goals presented but they need some more explanation on what you were going to implement to achieve them and when.",
      "action": "Define how goals will be achieved with specific actions and target dates",
      "source": "Transcript"
    }
  ],
  "Brian Davis": [
    {
      "category": "Financial Impact & ROI",
      "reviewer": "Valarie Barnett",
      "title": "Track Cost Avoidance/Savings Year-Round",
      "quote": "Highly recommend in the future you should track those year round month over month and then you should have kind of your overall cost savings or cost avoidance that you had as far as your efforts were concerned.",
      "action": "Implement monthly tracking system for cost savings and cost avoidance; document value-add dollar figures throughout the year",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Add Timelines to ALL 2026 Goals",
      "quote": "Leadership development, succession planning for all key roles. You'll have that completed by what day? Continuous process improvement. OK, it's ongoing, but what are your milestones to get there? Asset management? When will you roll out that pilot 2026? Is it Q1?",
      "action": "Assign specific completion dates and milestone checkpoints to all strategic goals (leadership development, succession planning, asset management pilots, etc.)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Retention-Specific Goals",
      "quote": "What I'm missing in all of this: timelines, any retention specific goals, anything related to how we're going to retain the business, any differentiation that we're going to bring in 2026.",
      "action": "Develop retention strategy with specific differentiation initiatives for 2026; document how business will be protected",
      "source": "Transcript"
    },
    {
      "category": "People & Culture",
      "reviewer": "Valarie Barnett",
      "title": "Complete Succession Planning for All Key Roles with Date",
      "quote": "Succession planning for all key roles. You'll have that completed by what day?",
      "action": "Create succession plans for all critical roles (site managers, key supervisors) with target completion date; eliminate single points of failure",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Define Asset Management Pilot Timeline (Q1/Q2)",
      "quote": "Asset management? When will you roll out that pilot 2026? Is it Q1? You're going to do what? Q2, you're going to do what?",
      "action": "Create phased rollout plan for ForSight asset management pilots with Q1/Q2 milestones and deliverables",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Growth Goals (Still in Discussion with Marvin)",
      "quote": "The growth goals, I know we're we're discussing that within the life science that's figuring out what our specific goals is... I do not have that number yet. Marvin and I are still discussing it.",
      "action": "Finalize growth target number with Marvin; balance against cost savings commitments; document in goals",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Document ALL Goals for Management Review",
      "quote": "I'm asking these questions not in a sense of just asking them for this call. I actually want you to reply with these things in the documents that you have... I want to make sure that those things get into that you and your management team have them in order to have them for even your your review and things like that.",
      "action": "Create formal documentation of all 2026 goals with timelines, milestones, and success criteria for management review and performance tracking",
      "source": "Transcript"
    }
  ],
  "Isaac Calderon": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Mike Jedan",
      "title": "Define Specific Personal Development Information",
      "quote": "I think you covered some of this during the course of the presentation, however I would like to have heard some specific information about this topic.",
      "action": "Articulate specific personal development objectives with measurable outcomes",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence",
      "reviewer": "Mike Jedan",
      "title": "Attach Ideas to Concrete Examples & Results",
      "quote": "I think attaching those ideas to concrete examples and results would be a next step.",
      "action": "Support strategic ideas with specific account examples and measurable results",
      "source": "Transcript"
    }
  ],
  "Benjamin Ehrenberg": [
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Quantify Value-Adds with Dollar Figures (2026 Challenge)",
      "quote": "I challenge you in 2026 to tabulate the value-add and cost avoidance. Show them what we could have billed them for.",
      "action": "Track quarterly dollar value of gratuitous services (frequent setups, escort avoidance, out-of-scope work)",
      "source": "Transcript"
    },
    {
      "category": "Operational Excellence",
      "reviewer": "James Peate",
      "title": "Establish CSAT Benchmarks & YoY Comparisons",
      "quote": "Do we have a benchmark or target or year-over-year comparisons for the CSAT scores?",
      "action": "Develop baseline CSAT metrics and establish quarterly tracking with year-over-year trend analysis",
      "source": "Transcript"
    }
  ],
  "Stuart Kelloff": [
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Specific Dates and Actions to 2026 Goals",
      "quote": "Flush this section out a little more on when you want to have it done... Any goal without a date attached to it is a wish.",
      "action": "Assign specific completion dates and milestones to NVIDIA renewal goals, tiered wage structure sustainability, and service validation expansion",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Lean Into Technology Goals for 2026",
      "quote": "One of the specific goals that I don't see... are around technology... lean into the SBM service like our validation verification scans.",
      "action": "Create specific technology adoption goals for NVIDIA (service validation, mobile tools, ForSight capabilities) with rollout timeline",
      "source": "Transcript"
    }
  ],
  "Grant Frazier": [
    {
      "category": "Value-Add & Cost Avoidance",
      "reviewer": "Anonymous Reviewer",
      "title": "Add Quantified Dollars to Value-Adds",
      "quote": "There was quantified dollars to Cost Avoidance but not for the Value adds. Even if the exact dollar amount isn't known or tracked it would have been good to at least get a ball park amount.",
      "action": "Estimate and track dollar values for all value-add activities, even if directional",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Anonymous Reviewer",
      "title": "Add Personal Development Goals",
      "quote": "All of the goals were account focused and it would have been beneficial to hear what you Grant want to be better at or develop for yourself.",
      "action": "Define at least one self-reflective goal focused on personal skill development or growth area",
      "source": "Transcript"
    }
  ],
  "Justin Homa": [
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Send Multi-Year Optimization Plan to Leadership",
      "quote": "Can you send that to me? [15%/9% savings plan]",
      "action": "Forward the mid-December multi-year optimization plan (15% MMD, 9% West) to Valarie for review",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Create Colo White Paper (Extra Credit 2026)",
      "quote": "Extra credit in 2026 if you put together a white paper on this. At the three-month mark, the six-month mark, the nine-month mark, the one-year mark [document lessons learned]",
      "action": "Document Colo implementation lessons learned with ROI data at quarterly milestones; publish white paper for enterprise use",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add Dates to ALL 2026 Goals",
      "quote": "A goal without a date is a wish.",
      "action": "Review all 2026 strategic goals and assign specific completion dates and milestone checkpoints",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Flesh Out Consumable Tracking Strategy with Depth",
      "quote": "I would like to see that a little bit more fleshed out. I in concept, obviously I know what you're saying, but I'd like to understand more depth around how you intend to do that. What is your actual strategy there?",
      "action": "Document detailed implementation plan for QR code material tracking system with rollout timeline and KPIs",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define 'Agreed Contract with Clear Deliverables'",
      "quote": "What does that mean? What are you hoping to achieve? [Deliverables are] KPIs and expectations, governance, technology implementation road map and timeline.",
      "action": "Specify exact contract deliverables: KPI alignment, governance structure, technology roadmap with dates",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Add Technology Goals for 2026",
      "quote": "One of the specific goals that I don't see you having you or Brian, actually I don't think are around technology... lean into the SBM service like our validation verification scans.",
      "action": "Create specific 2026 goals for technology adoption (service validation, mobile tools, ForSight capabilities)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Asset Management Rollout Timeline by Location",
      "quote": "Put some deadlines to it... I'd like to understand more depth around... what location is first, second, third?",
      "action": "Create phased rollout plan for ForSight asset management with specific site order and completion dates",
      "source": "Transcript"
    },
    {
      "category": "Financial Impact & ROI",
      "reviewer": "Valarie Barnett",
      "title": "Complete AMR Vacuum ROI Analysis Before Client Proposal",
      "quote": "[You need] ROI # to sell this to people. [February 2026 proposal deadline]",
      "action": "Calculate ROI for AMR vacuum program (comparing 4 Wiz to 2 Tasky/Nilfisk) before February client presentation",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add More Teeth to Goals 6 & 7 for Workday Transfer",
      "quote": "Just flush this out a little bit more, six and seven, just put some more teeth to it... you should be able to transfer these goals right into Workday.",
      "action": "Enhance baseline revenue growth goal and contract deliverables goal with specific metrics, dates, and success criteria",
      "source": "Transcript"
    }
  ],
  "Justin Dallavis": [
    {
      "category": "Financial Impact & ROI",
      "reviewer": "James Peate",
      "title": "Quantify Value-Adds with Dollar Figures in Presentations",
      "quote": "Add in the quantification to the presentations... things like the challenges, corrective actions, what was the impact... the specific actions that were taken... and the improvements made",
      "action": "Add dollar figures and quantified impact to all value-add activities, corrective actions, and innovations in future presentations",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Define Timeline for Reported/Carrigo Integration",
      "quote": "When? [for Carrigo/Reported integration]",
      "action": "Establish specific rollout timeline for Carrigo and Reported integration; clarify dependencies and current status with JLL IT team",
      "source": "Transcript"
    },
    {
      "category": "Innovation & Continuous Improvement",
      "reviewer": "Valarie Barnett",
      "title": "Roll Out AI Verify with Melissa Hampton's Support",
      "quote": "I'm gonna have you reach out to Melissa Hampton... We're past the beginning stages. We're live across multiple sites.",
      "action": "Contact Melissa Hampton to accelerate AI Verify rollout at Saint Louis sites (Swansea, Cortex, O'Fallon) and Mesa; target completion within 3 months",
      "source": "Transcript"
    },
    {
      "category": "Operational Excellence",
      "reviewer": "Valarie Barnett",
      "title": "Validate Data Transparency Directly with Customers",
      "quote": "I challenge you to go directly to your customers and ask them, do they have any more complaints than what we have. What we don't want to ever have happen is for our data integrity to be in [question].",
      "action": "Implement regular validation with JLL/Boeing POCs to ensure ForSight complaint data matches their actual complaint count; address data integrity gaps",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Define Process Innovation Goal for 2026",
      "quote": "I'm going to challenge you in 2026 on the record. My challenge to you... will be to innovate a process or something that we do on a regular basis that could be being done better for Boeing. And what the value of that? What value creation is there in it?",
      "action": "Identify and implement one major process innovation for Boeing in 2026; document value creation and impact",
      "source": "Transcript"
    },
    {
      "category": "Personal Goals & Development",
      "reviewer": "Valarie Barnett",
      "title": "Add SMART Goals with Dates and Measurement Criteria",
      "quote": "SMART goals... They're measurable. How will we measure success?... Are they time bound? So we're missing time bound and how you'll measure yourself specifically.",
      "action": "Document all 2026 goals with specific dates, milestones, and measurement criteria for Workday system (Saint Louis growth by November, Colorado June/July, $250K/month growth target, 0 recordables, 5.0 CSAT/audit scores)",
      "source": "Transcript"
    },
    {
      "category": "Strategic Thinking & Planning",
      "reviewer": "Valarie Barnett",
      "title": "Define Success Timeline for CAP Sites (Huntsville/OKC)",
      "quote": "It sounds like they're still on kind of like the issues and challenges tracker... they're kind of on your watch list I guess. What's your timeline to say like these things are corrected?",
      "action": "Document specific criteria and timeline for Huntsville and OKC to move from 'watch list' to 'fully corrected' status; clarify 90-day CAP milestones",
      "source": "Transcript"
    },
    {
      "category": "Executive Presence",
      "reviewer": "Kyle Wallace",
      "title": "Add Mic Drop Moments to Presentations",
      "quote": "I was looking for... your mic drop moment... I know there's a significant amount of dollars that you've saved... you positioned yourself so well for Saint Louis, which has been remarkable by the way. That's a mic drop moment.",
      "action": "Identify and prominently feature major wins and differentiators in presentations (e.g., Saint Louis positioning, cost savings, Fort Walton Beach transformation, Huntsville turnaround)",
      "source": "Transcript"
    },
    {
      "category": "2026 Strategy & Vision",
      "reviewer": "Valarie Barnett",
      "title": "Document Path Forward with Specific Timelines",
      "quote": "Clean up goals, add dates/targets/actions for workday system.",
      "action": "Create formal documentation of Saint Louis growth strategy ($250K/month), MIT development program expansion (Mesa, Mascouda), Brian's leadership role transition, and pricing plan collaboration with Strategic Pricing team and Nick Viskovich",
      "source": "Transcript"
    }
  ]
}